--------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Dropbox\papers\active\dissertation-csrhub\project\code/logs/20190129-yearly-analysis.txt
  log type:  text
 opened on:   1 Feb 2019, 12:21:14

. 
. ///     LOAD DATA
> use data/csrhub-kld-cstat-year-level-with-treatment-variables.dta, clear

. 
. est clear

. 
. /// SET PANEL
> encode cusip, gen(cusip_n)

. xtset cusip_n year, y
       panel variable:  cusip_n (unbalanced)
        time variable:  year, 1990 to 2018, but with gaps
                delta:  1 year

. 
. ///     GENERATE YEAR-ON-YEAR REVENUE CHANGE
> gen revt_yoy = revt - l.revt
(74,693 missing values generated)

. label var revt_yoy "Year-on-year change in revenue (revt - previous year revt)"

. 
end of do-file

. do "C:\Users\work\AppData\Local\Temp\STD2b3c_000000.tmp"

. keep cusip cusip_n year revt revt_yoy dltt at xad xrd emp age ///
>         over_rtg *rtg_lym sic tobinq

. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Dropbox\papers\active\dissertation-csrhub\project\code/logs/20190129-yearly-analysis.txt
  log type:  text
 closed on:   1 Feb 2019, 12:21:27
--------------------------------------------------------------------------------------------------------------------------------------
