----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Dropbox\papers\active\dissertation-csrhub\project\code/logs/20190123-yearly-analysis.txt
  log type:  text
 opened on:  23 Jan 2019, 11:09:11

. 
. ///     LOAD DATA
> use data/csrhub-kld-cstat-year-level-with-treatment-variables.dta, clear

. 
. /// SET PANEL
> encode cusip, gen(cusip_n)

. xtset cusip_n year, y
       panel variable:  cusip_n (unbalanced)
        time variable:  year, 1990 to 2018, but with gaps
                delta:  1 year

. 
. ///     GENERATE YEAR-ON-YEAR REVENUE CHANGE
> gen revt_yoy = revt - l.revt
(74,693 missing values generated)

. label var revt_yoy "Year-on-year change in revenue (revt)"

. 
. ///     KEEP VARIABLES IN REGRESSION MODELS TO REDUCE FILE SIZE
> keep cusip cusip_n year revt revt_yoy dltt at xad xrd emp age ///
>         over_rtg *rtg_lym

. 
. 
.         
.         
.         
.         
.         
.                                                 ***===========================***
.                                                 *       FIXED EFFECTS REGRESSION        *       
.                                                 ***===========================***       
. ***===========================***
. *       REVENUE LEVEL = F (CSRHUB)      *
. ***===========================***
. ///     CONTROL VARIABLE MODELS
> 
. ***     DV: Revenue (Level)
. *mark mark3
. *markout mark3 revt over_rtg dltt at xad xrd emp year
. 
. xtreg revt over_rtg, fe cluster(cusip_n)                                                                                

Fixed-effects (within) regression               Number of obs     =     19,816
Group variable: cusip_n                         Number of groups  =      3,673

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0132                                         avg =        5.4
     overall = 0.0130                                         max =         10

                                                F(1,3672)         =       0.81
corr(u_i, Xb)  = 0.1146                         Prob > F          =     0.3694

                            (Std. Err. adjusted for 3,673 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   8.215993   9.152477     0.90   0.369    -9.728447    26.16043
       _cons |    6123.36   472.3233    12.96   0.000     5197.318    7049.402
-------------+----------------------------------------------------------------
     sigma_u |  15532.368
     sigma_e |  5384.1819
         rho |  .89272869   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con1

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. xtreg revt over_rtg i.year, fe cluster(cusip_n)                                                                 

Fixed-effects (within) regression               Number of obs     =     19,816
Group variable: cusip_n                         Number of groups  =      3,673

R-sq:                                           Obs per group:
     within  = 0.0214                                         min =          1
     between = 0.0575                                         avg =        5.4
     overall = 0.0115                                         max =         10

                                                F(10,3672)        =      16.21
corr(u_i, Xb)  = -0.1491                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,673 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -7.711574   13.48909    -0.57   0.568    -34.15842    18.73527
             |
        year |
       2009  |  -1221.905   664.0215    -1.84   0.066    -2523.792    79.98222
       2010  |   413.0925   670.9539     0.62   0.538    -902.3866    1728.572
       2011  |   1379.388   683.3967     2.02   0.044     39.51306    2719.262
       2012  |    1667.07   788.2525     2.11   0.035     121.6144    3212.526
       2013  |   1896.674   827.9046     2.29   0.022     273.4758    3519.872
       2014  |   2188.401   859.9293     2.54   0.011     502.4152    3874.388
       2015  |   2022.174   903.2845     2.24   0.025     251.1851    3793.163
       2016  |   2113.648   919.9608     2.30   0.022     309.9634    3917.332
       2017  |   2491.881   914.6081     2.72   0.006     698.6908    4285.071
             |
       _cons |   5185.622   964.1799     5.38   0.000     3295.241    7076.003
-------------+----------------------------------------------------------------
     sigma_u |   15654.91
     sigma_e |  5327.9151
         rho |   .8961955   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con2

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt i.year, fe cluster(cusip_n)                                                    

Fixed-effects (within) regression               Number of obs     =     19,736
Group variable: cusip_n                         Number of groups  =      3,664

R-sq:                                           Obs per group:
     within  = 0.0583                                         min =          1
     between = 0.0303                                         avg =        5.4
     overall = 0.0340                                         max =         10

                                                F(11,3663)        =      17.64
corr(u_i, Xb)  = 0.0331                         Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,664 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   -19.1501   11.64656    -1.64   0.100    -41.98448    3.684285
        dltt |   .0420342   .0071661     5.87   0.000     .0279842    .0560841
             |
        year |
       2009  |  -1212.861   645.2859    -1.88   0.060    -2478.016    52.29411
       2010  |   184.5193   637.0373     0.29   0.772    -1064.464    1433.502
       2011  |   1152.838   651.8575     1.77   0.077    -125.2016    2430.878
       2012  |   1406.831   758.3615     1.86   0.064    -80.02166    2893.683
       2013  |   1690.069   807.0962     2.09   0.036      107.667    3272.472
       2014  |   1995.257   842.6632     2.37   0.018      343.122    3647.393
       2015  |   1778.798   882.0052     2.02   0.044     49.52846    3508.068
       2016  |   1850.293   897.3722     2.06   0.039     90.89398    3609.691
       2017  |   2179.773   886.8097     2.46   0.014     441.0836    3918.463
             |
       _cons |   5811.298   811.9522     7.16   0.000     4219.375    7403.221
-------------+----------------------------------------------------------------
     sigma_u |   15322.92
     sigma_e |  5237.7416
         rho |  .89538048   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con3

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at i.year, fe cluster(cusip_n)                                                 

Fixed-effects (within) regression               Number of obs     =     19,736
Group variable: cusip_n                         Number of groups  =      3,664

R-sq:                                           Obs per group:
     within  = 0.1114                                         min =          1
     between = 0.1830                                         avg =        5.4
     overall = 0.1733                                         max =         10

                                                F(12,3663)        =      20.06
corr(u_i, Xb)  = -0.0310                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,664 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -23.95959    11.4073    -2.10   0.036    -46.32487   -1.594307
        dltt |  -.0294841   .0212673    -1.39   0.166     -.071181    .0122127
          at |   .0794305   .0237503     3.34   0.001     .0328655    .1259956
             |
        year |
       2009  |   -1524.49   641.8031    -2.38   0.018    -2782.816   -266.1627
       2010  |  -488.1386   629.1409    -0.78   0.438     -1721.64    745.3625
       2011  |   295.4268   629.8287     0.47   0.639    -939.4228    1530.276
       2012  |   402.8156   736.0563     0.55   0.584    -1040.305    1845.936
       2013  |   640.3766   783.0082     0.82   0.414    -894.7986    2175.552
       2014  |   893.8098   815.8265     1.10   0.273    -705.7092    2493.329
       2015  |   622.7553   851.0297     0.73   0.464    -1045.784    2291.294
       2016  |   629.9196   867.9634     0.73   0.468     -1071.82    2331.659
       2017  |   876.1937   856.7789     1.02   0.307    -803.6172    2556.005
             |
       _cons |   5697.143   787.0342     7.24   0.000     4154.075    7240.212
-------------+----------------------------------------------------------------
     sigma_u |  14060.579
     sigma_e |   5087.925
         rho |  .88421957   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con4

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at emp i.year, fe cluster(cusip_n)                                             

Fixed-effects (within) regression               Number of obs     =     19,553
Group variable: cusip_n                         Number of groups  =      3,638

R-sq:                                           Obs per group:
     within  = 0.2585                                         min =          1
     between = 0.5753                                         avg =        5.4
     overall = 0.5646                                         max =         10

                                                F(13,3637)        =      27.08
corr(u_i, Xb)  = -0.1368                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,638 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -10.15172   9.125061    -1.11   0.266    -28.04246    7.739027
        dltt |  -.0162158    .016863    -0.96   0.336    -.0492776    .0168461
          at |   .0622456   .0191342     3.25   0.001     .0247309    .0997603
         emp |   .2207727   .0468091     4.72   0.000      .128998    .3125475
             |
        year |
       2009  |  -1212.506   622.7152    -1.95   0.052    -2433.412    8.399249
       2010  |  -411.3382   596.9605    -0.69   0.491    -1581.749    759.0723
       2011  |   156.6275   585.5796     0.27   0.789    -991.4694    1304.724
       2012  |   130.5879   689.2683     0.19   0.850    -1220.803    1481.979
       2013  |   218.9764   729.2125     0.30   0.764     -1210.73    1648.682
       2014  |   356.0531   758.3628     0.47   0.639    -1130.805    1842.912
       2015  |   37.48095   799.2259     0.05   0.963    -1529.494    1604.456
       2016  |   23.79405   816.0531     0.03   0.977    -1576.173    1623.761
       2017  |   261.0683   808.2241     0.32   0.747    -1323.549    1845.686
             |
       _cons |   1862.807   1087.553     1.71   0.087    -269.4681    3995.082
-------------+----------------------------------------------------------------
     sigma_u |  10278.114
     sigma_e |  4670.0456
         rho |  .82887796   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con5

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at emp xad i.year, fe cluster(cusip_n)                                 

Fixed-effects (within) regression               Number of obs     =      7,980
Group variable: cusip_n                         Number of groups  =      1,575

R-sq:                                           Obs per group:
     within  = 0.4792                                         min =          1
     between = 0.7596                                         avg =        5.1
     overall = 0.7878                                         max =         10

                                                F(14,1574)        =      23.60
corr(u_i, Xb)  = 0.1640                         Prob > F          =     0.0000

                            (Std. Err. adjusted for 1,575 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -19.28929    18.3389    -1.05   0.293    -55.26053    16.68195
        dltt |   .2239822   .0597957     3.75   0.000     .1066947    .3412697
          at |   .0216072    .021885     0.99   0.324    -.0213197    .0645341
         emp |   .1340061   .0445281     3.01   0.003     .0466655    .2213466
         xad |   11.27971   2.320962     4.86   0.000     6.727213    15.83222
             |
        year |
       2009  |   395.3783   723.5554     0.55   0.585    -1023.855    1814.612
       2010  |   1122.171   677.1351     1.66   0.098    -206.0109    2450.353
       2011  |   1719.982   679.8473     2.53   0.012     386.4806    3053.484
       2012  |   1854.993   715.2659     2.59   0.010     452.0183    3257.967
       2013  |    2069.34   794.3679     2.61   0.009     511.2091     3627.47
       2014  |   2141.277   816.8157     2.62   0.009     539.1159    3743.438
       2015  |   2027.031   795.3437     2.55   0.011     466.9861    3587.075
       2016  |   2013.557   761.7179     2.64   0.008     519.4686    3507.646
       2017  |   2073.469   750.8201     2.76   0.006     600.7562    3546.182
             |
       _cons |  -121.7204   1177.975    -0.10   0.918    -2432.285    2188.844
-------------+----------------------------------------------------------------
     sigma_u |  9003.8665
     sigma_e |  3491.7425
         rho |   .8692685   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con6

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at emp xad xrd i.year, fe cluster(cusip_n)                             

Fixed-effects (within) regression               Number of obs     =      4,650
Group variable: cusip_n                         Number of groups  =        928

R-sq:                                           Obs per group:
     within  = 0.6649                                         min =          1
     between = 0.8619                                         avg =        5.0
     overall = 0.8761                                         max =         10

                                                F(15,927)         =      12.73
corr(u_i, Xb)  = 0.4423                         Prob > F          =     0.0000

                              (Std. Err. adjusted for 928 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -41.11178   23.73924    -1.73   0.084    -87.70066    5.477103
        dltt |  -.4795382   .2354681    -2.04   0.042    -.9416505   -.0174259
          at |   .5103574   .1642739     3.11   0.002     .1879655    .8327493
         emp |     .09675   .0461174     2.10   0.036     .0062435    .1872566
         xad |   3.754353   2.376474     1.58   0.114    -.9095403    8.418246
         xrd |   .7643147   1.048184     0.73   0.466    -1.292773    2.821403
             |
        year |
       2009  |  -1511.188    963.473    -1.57   0.117    -3402.029    379.6531
       2010  |  -684.6548   764.7263    -0.90   0.371     -2185.45    816.1406
       2011  |   -11.9185   698.4746    -0.02   0.986    -1382.693    1358.856
       2012  |  -21.63107   765.8373    -0.03   0.977    -1524.607    1481.345
       2013  |   382.0979   848.7598     0.45   0.653    -1283.616    2047.811
       2014  |   542.7697   889.3181     0.61   0.542    -1202.541     2288.08
       2015  |   255.4093   858.9047     0.30   0.766    -1430.214    1941.032
       2016  |   158.2844   868.4368     0.18   0.855    -1546.046    1862.615
       2017  |   10.67318   857.0574     0.01   0.990    -1671.325    1692.671
             |
       _cons |   2876.228   1555.929     1.85   0.065    -177.3238     5929.78
-------------+----------------------------------------------------------------
     sigma_u |  8717.9689
     sigma_e |  3434.8048
         rho |  .86562907   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con7

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at emp xad xrd age i.year, fe cluster(cusip_n)                         
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,650
Group variable: cusip_n                         Number of groups  =        928

R-sq:                                           Obs per group:
     within  = 0.6649                                         min =          1
     between = 0.8619                                         avg =        5.0
     overall = 0.8761                                         max =         10

                                                F(15,927)         =      12.73
corr(u_i, Xb)  = 0.4418                         Prob > F          =     0.0000

                              (Std. Err. adjusted for 928 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -41.11178   23.73924    -1.73   0.084    -87.70066    5.477103
        dltt |  -.4795382   .2354681    -2.04   0.042    -.9416505   -.0174259
          at |   .5103574   .1642739     3.11   0.002     .1879655    .8327493
         emp |     .09675   .0461174     2.10   0.036     .0062435    .1872566
         xad |   3.754353   2.376474     1.58   0.114    -.9095403    8.418246
         xrd |   .7643147   1.048184     0.73   0.466    -1.292773    2.821403
         age |   1.185909    95.2286     0.01   0.990    -185.7027    188.0746
             |
        year |
       2009  |  -1512.374   886.5853    -1.71   0.088    -3252.321    227.5731
       2010  |  -687.0267   593.0822    -1.16   0.247    -1850.966    476.9127
       2011  |  -15.47622   432.2097    -0.04   0.971    -863.6991    832.7467
       2012  |   -26.3747   402.8861    -0.07   0.948    -817.0493    764.2999
       2013  |   376.1683   430.2299     0.87   0.382    -468.1692    1220.506
       2014  |   535.6542   406.0501     1.32   0.187    -261.2299    1332.538
       2015  |    247.108    267.187     0.92   0.355    -277.2535    771.4695
       2016  |   148.7971   149.2449     1.00   0.319    -144.0999    441.6941
       2017  |          0  (omitted)
             |
       _cons |    2852.86   2958.272     0.96   0.335    -2952.826    8658.546
-------------+----------------------------------------------------------------
     sigma_u |  8715.3321
     sigma_e |  3434.8048
         rho |  .86555868   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con8

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & over_rtg!=.                                                                                   /*      assumption      */
(43,211 real changes made)

. replace xrd=0 if xrd==. & over_rtg!=.                                                                                   /*      assumption      */
(41,111 real changes made)

. 
. xtreg revt over_rtg dltt at emp xad xrd age i.year, fe cluster(cusip_n)                         
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     19,553
Group variable: cusip_n                         Number of groups  =      3,638

R-sq:                                           Obs per group:
     within  = 0.3000                                         min =          1
     between = 0.6159                                         avg =        5.4
     overall = 0.6031                                         max =         10

                                                F(15,3637)        =      27.04
corr(u_i, Xb)  = 0.0461                         Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,638 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -12.99418   9.145914    -1.42   0.155    -30.92581    4.937447
        dltt |  -.0113777   .0145815    -0.78   0.435    -.0399664    .0172109
          at |    .056222    .016214     3.47   0.001     .0244326    .0880114
         emp |   .1740904   .0448737     3.88   0.000     .0861103    .2620706
         xad |   2.202605   1.291851     1.70   0.088    -.3302186     4.73543
         xrd |   4.049164    1.69977     2.38   0.017     .7165676     7.38176
         age |  -.1285394   89.01685    -0.00   0.999    -174.6564    174.3994
             |
        year |
       2009  |  -1187.096   534.0927    -2.22   0.026    -2234.247   -139.9455
       2010  |  -482.9422    423.691    -1.14   0.254    -1313.638    347.7533
       2011  |   45.61858   331.5897     0.14   0.891    -604.5017    695.7389
       2012  |  -3.730146   344.8535    -0.01   0.991    -679.8557    672.3954
       2013  |    90.0692   305.0357     0.30   0.768    -507.9889    688.1273
       2014  |   208.1249   250.0845     0.83   0.405    -282.1948    698.4446
       2015  |  -144.8699    191.204    -0.76   0.449    -519.7477    230.0078
       2016  |  -187.9356     110.31    -1.70   0.089    -404.2113    28.34008
       2017  |          0  (omitted)
             |
       _cons |    2422.07   2422.485     1.00   0.317    -2327.493    7171.633
-------------+----------------------------------------------------------------
     sigma_u |  9679.5271
     sigma_e |  4537.6373
         rho |  .81983252   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con9

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore

. 
. esttab con1 con2 con3 con4 con5 con6 con7 con8 con9, ///
>         b se s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC")) ///
>         keep(over_rtg dltt at xad xrd emp age)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
                     revt            revt            revt            revt            revt            revt            revt            revt            revt   
------------------------------------------------------------------------------------------------------------------------------------------------------------
over_rtg            8.216          -7.712          -19.15          -23.96*         -10.15          -19.29          -41.11          -41.11          -12.99   
                  (9.152)         (13.49)         (11.65)         (11.41)         (9.125)         (18.34)         (23.74)         (23.74)         (9.146)   

dltt                                               0.0420***      -0.0295         -0.0162           0.224***       -0.480*         -0.480*        -0.0114   
                                                (0.00717)        (0.0213)        (0.0169)        (0.0598)         (0.235)         (0.235)        (0.0146)   

at                                                                 0.0794***       0.0622**        0.0216           0.510**         0.510**        0.0562***
                                                                 (0.0238)        (0.0191)        (0.0219)         (0.164)         (0.164)        (0.0162)   

emp                                                                                 0.221***        0.134**        0.0968*         0.0968*          0.174***
                                                                                 (0.0468)        (0.0445)        (0.0461)        (0.0461)        (0.0449)   

xad                                                                                                 11.28***        3.754           3.754           2.203   
                                                                                                  (2.321)         (2.376)         (2.376)         (1.292)   

xrd                                                                                                                 0.764           0.764           4.049*  
                                                                                                                  (1.048)         (1.048)         (1.700)   

age                                                                                                                                 1.186          -0.129   
                                                                                                                                  (95.23)         (89.02)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        19816           19816           19736           19736           19553            7980            4650            4650           19553   
Firms                3673            3673            3664            3664            3638            1575             928             928            3638   
R^2             0.0000616          0.0214          0.0583           0.111           0.258           0.479           0.665           0.665           0.300   
AIC              392661.1        392251.7        389988.0        388843.2        381877.3        151106.5         87890.2         87890.2        380754.1   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
.         
. 
.         
. *** Loop to run regression models
. 
. 
.         
.         
.         
. ***===============================***
. *       REVENUE CHANGE = F (CSRHUB)     *
. ***===============================***   
. /// DV: Revenue (1-year change)
> local dv revt_yoy

. local iv over_rtg 

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,468
Group variable: cusip_n                         Number of groups  =      3,393

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0007                                         avg =        4.9
     overall = 0.0001                                         max =         10

                                                F(1,3392)         =       0.89
corr(u_i, Xb)  = -0.0079                        Prob > F          =     0.3449

                            (Std. Err. adjusted for 3,393 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -7.394739   7.828646    -0.94   0.345    -22.74408    7.954602
       _cons |    597.926   407.5567     1.47   0.142    -201.1555    1397.008
-------------+----------------------------------------------------------------
     sigma_u |  1298.1456
     sigma_e |  3925.1113
         rho |  .09859663   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store reg0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,468
Group variable: cusip_n                         Number of groups  =      3,393

R-sq:                                           Obs per group:
     within  = 0.0159                                         min =          1
     between = 0.0014                                         avg =        4.9
     overall = 0.0130                                         max =         10

                                                F(10,3392)        =       5.46
corr(u_i, Xb)  = -0.0153                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,393 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   14.78995   10.22059     1.45   0.148    -5.249188    34.82909
             |
        year |
       2009  |   3039.497     734.71     4.14   0.000     1598.978    4480.016
       2010  |    2850.19   702.0333     4.06   0.000     1473.739    4226.641
       2011  |   2186.465   560.9767     3.90   0.000     1086.578    3286.351
       2012  |   2170.154   581.7837     3.73   0.000     1029.472    3310.836
       2013  |   2234.871   562.1848     3.98   0.000     1132.616    3337.126
       2014  |   1753.317   513.9335     3.41   0.001     745.6662    2760.967
       2015  |   2061.204   559.5535     3.68   0.000     964.1075      3158.3
       2016  |   2418.049   593.8925     4.07   0.000     1253.625    3582.472
       2017  |   2529.427   583.4674     4.34   0.000     1385.444    3673.411
             |
       _cons |  -2743.427   871.9717    -3.15   0.002     -4453.07   -1033.784
-------------+----------------------------------------------------------------
     sigma_u |  1306.0064
     sigma_e |  3895.3237
         rho |  .10105057   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store reg1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store reg`counter'
  4.         estadd local yearFE "Yes", replace
  5.         
.         *       Increment
.         local vars "`vars' `control'"
  6.         local counter = `counter' + 1
  7. }

Fixed-effects (within) regression               Number of obs     =     16,404
Group variable: cusip_n                         Number of groups  =      3,382

R-sq:                                           Obs per group:
     within  = 0.1022                                         min =          1
     between = 0.0237                                         avg =        4.9
     overall = 0.0012                                         max =         10

                                                F(11,3381)        =      16.50
corr(u_i, Xb)  = -0.8560                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,382 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   27.10384   7.045693     3.85   0.000     13.28959    40.91809
        dltt |  -.0431331   .0041387   -10.42   0.000    -.0512477   -.0350184
             |
        year |
       2009  |   3025.321   727.7606     4.16   0.000     1598.426    4452.216
       2010  |   3088.873   698.6971     4.42   0.000     1718.961    4458.784
       2011  |   2421.959   557.2645     4.35   0.000     1329.349    3514.568
       2012  |   2439.262   576.9778     4.23   0.000     1308.001    3570.523
       2013  |   2446.145   561.3304     4.36   0.000     1345.564    3546.727
       2014  |   1946.529   515.5283     3.78   0.000     935.7506    2957.308
       2015  |   2311.924   559.4163     4.13   0.000     1215.096    3408.753
       2016  |    2687.76   594.0225     4.52   0.000      1523.08     3852.44
       2017  |   2838.449   582.1593     4.88   0.000     1697.029    3979.869
             |
       _cons |  -3376.187   761.4421    -4.43   0.000     -4869.12   -1883.253
-------------+----------------------------------------------------------------
     sigma_u |  2897.2942
     sigma_e |  3728.2447
         rho |  .37652587   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     16,404
Group variable: cusip_n                         Number of groups  =      3,382

R-sq:                                           Obs per group:
     within  = 0.1031                                         min =          1
     between = 0.0241                                         avg =        4.9
     overall = 0.0007                                         max =         10

                                                F(12,3381)        =      14.88
corr(u_i, Xb)  = -0.8770                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,382 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   27.39178   7.098092     3.86   0.000     13.47479    41.30876
        dltt |  -.0360327    .006435    -5.60   0.000    -.0486496   -.0234158
          at |  -.0078821   .0055854    -1.41   0.158    -.0188333     .003069
             |
        year |
       2009  |   3053.445   729.6876     4.18   0.000     1622.771    4484.118
       2010  |   3150.899   705.6047     4.47   0.000     1767.444    4534.354
       2011  |   2501.859   563.2829     4.44   0.000      1397.45    3606.269
       2012  |   2532.943   585.3239     4.33   0.000     1385.318    3680.567
       2013  |   2545.091   569.4392     4.47   0.000     1428.611    3661.571
       2014  |   2051.501   524.3964     3.91   0.000     1023.334    3079.667
       2015  |   2421.484   568.3237     4.26   0.000     1307.191    3535.777
       2016  |   2803.301   605.1599     4.63   0.000     1616.785    3989.818
       2017  |   2944.484    592.248     4.97   0.000     1783.284    4105.685
             |
       _cons |  -3338.789   756.1417    -4.42   0.000     -4821.33   -1856.247
-------------+----------------------------------------------------------------
     sigma_u |  3110.1858
     sigma_e |  3726.4868
         rho |  .41058032   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,404
Group variable: cusip_n                         Number of groups  =      3,382

R-sq:                                           Obs per group:
     within  = 0.1031                                         min =          1
     between = 0.0047                                         avg =        4.9
     overall = 0.0001                                         max =         10

                                                F(12,3381)        =      14.88
corr(u_i, Xb)  = -0.9597                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,382 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   27.39178   7.098092     3.86   0.000     13.47479    41.30876
        dltt |  -.0360327    .006435    -5.60   0.000    -.0486496   -.0234158
          at |  -.0078821   .0055854    -1.41   0.158    -.0188333     .003069
         age |   327.1649   65.80533     4.97   0.000     198.1426    456.1872
             |
        year |
       2009  |    2726.28    666.258     4.09   0.000      1419.97    4032.589
       2010  |    2496.57   578.1611     4.32   0.000     1362.989     3630.15
       2011  |   1520.365   378.5451     4.02   0.000     778.1643    2262.565
       2012  |   1224.283    331.236     3.70   0.000     574.8399    1873.726
       2013  |    909.266   256.0973     3.55   0.000     407.1449    1411.387
       2014  |   88.51111   170.4269     0.52   0.604     -245.639    422.6612
       2015  |   131.3297   152.0629     0.86   0.388    -166.8148    429.4743
       2016  |    185.982    133.671     1.39   0.164    -76.10212    448.0662
       2017  |          0  (omitted)
             |
       _cons |  -10433.34   2130.467    -4.90   0.000    -14610.48   -6256.211
-------------+----------------------------------------------------------------
     sigma_u |  6125.5576
     sigma_e |  3726.4868
         rho |   .7298788   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,269
Group variable: cusip_n                         Number of groups  =      3,361

R-sq:                                           Obs per group:
     within  = 0.1036                                         min =          1
     between = 0.0026                                         avg =        4.8
     overall = 0.0004                                         max =         10

                                                F(13,3360)        =      14.15
corr(u_i, Xb)  = -0.9598                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,361 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |    28.3589   7.044053     4.03   0.000     14.54783    42.16996
        dltt |  -.0354493    .006397    -5.54   0.000    -.0479917   -.0229068
          at |  -.0086297   .0055648    -1.55   0.121    -.0195404     .002281
         age |   322.9155   66.10172     4.89   0.000     193.3118    452.5192
         emp |    .009931   .0104384     0.95   0.341    -.0105354    .0303973
             |
        year |
       2009  |   2747.355   669.3242     4.10   0.000     1435.031    4059.679
       2010  |   2512.783   581.0247     4.32   0.000     1373.585    3651.981
       2011  |   1530.273   380.2187     4.02   0.000     784.7899    2275.757
       2012  |   1231.863   332.5022     3.70   0.000     579.9358     1883.79
       2013  |   912.5564   256.8136     3.55   0.000     409.0296    1416.083
       2014  |   86.52546   170.4728     0.51   0.612    -247.7156    420.7665
       2015  |   133.0713   152.0972     0.87   0.382    -165.1412    431.2838
       2016  |   194.4508   133.9751     1.45   0.147    -68.23025    457.1318
       2017  |          0  (omitted)
             |
       _cons |  -10565.98   2145.445    -4.92   0.000    -14772.49   -6359.468
-------------+----------------------------------------------------------------
     sigma_u |   6147.898
     sigma_e |  3741.5342
         rho |  .72972523   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      6,704
Group variable: cusip_n                         Number of groups  =      1,443

R-sq:                                           Obs per group:
     within  = 0.0131                                         min =          1
     between = 0.0011                                         avg =        4.6
     overall = 0.0019                                         max =         10

                                                F(14,1442)        =       2.47
corr(u_i, Xb)  = -0.8475                        Prob > F          =     0.0019

                            (Std. Err. adjusted for 1,443 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   36.54266   14.07654     2.60   0.010      8.92998    64.15535
        dltt |  -.0034632   .0618835    -0.06   0.955    -.1248546    .1179281
          at |  -.0141642   .0068963    -2.05   0.040     -.027692   -.0006363
         age |   148.5521   67.82815     2.19   0.029     15.49973    281.6045
         emp |   .0106291   .0114989     0.92   0.355    -.0119273    .0331856
         xad |  -.2617025   1.618492    -0.16   0.872    -3.436553    2.913148
             |
        year |
       2009  |   1166.009   781.7418     1.49   0.136    -367.4635    2699.482
       2010  |   1247.467   619.2567     2.01   0.044     32.72653    2462.207
       2011  |   297.7729   349.3791     0.85   0.394    -387.5728    983.1187
       2012  |   385.1568   317.7576     1.21   0.226    -238.1598    1008.473
       2013  |   60.48451   255.1218     0.24   0.813     -439.965     560.934
       2014  |  -235.5539   242.1344    -0.97   0.331    -710.5272    239.4194
       2015  |  -200.1748   191.6125    -1.04   0.296    -576.0439    175.6943
       2016  |  -88.53494   152.6707    -0.58   0.562    -388.0153    210.9454
       2017  |          0  (omitted)
             |
       _cons |  -5558.395   2246.528    -2.47   0.013    -9965.207   -1151.582
-------------+----------------------------------------------------------------
     sigma_u |  3279.7001
     sigma_e |  3464.9347
         rho |   .4725567   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      3,946
Group variable: cusip_n                         Number of groups  =        865

R-sq:                                           Obs per group:
     within  = 0.0246                                         min =          1
     between = 0.0006                                         avg =        4.6
     overall = 0.0014                                         max =         10

                                                F(15,864)         =       3.10
corr(u_i, Xb)  = -0.9084                        Prob > F          =     0.0001

                              (Std. Err. adjusted for 865 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |    50.5089   21.39721     2.36   0.018     8.512308     92.5055
        dltt |  -.0685147   .1119247    -0.61   0.541    -.2881908    .1511613
          at |  -.0241862   .0443638    -0.55   0.586    -.1112597    .0628873
         age |   295.1267   88.82344     3.32   0.001     120.7917    469.4616
         emp |   .0085148   .0114569     0.74   0.458    -.0139718    .0310014
         xad |  -1.088314   1.325453    -0.82   0.412    -3.689798     1.51317
         xrd |   1.028289   .6932208     1.48   0.138    -.3323047    2.388883
             |
        year |
       2009  |   2762.598   1104.787     2.50   0.013     594.2175    4930.979
       2010  |   2460.728   903.3888     2.72   0.007     687.6348    4233.822
       2011  |   971.7877   351.5182     2.76   0.006     281.8581    1661.717
       2012  |   970.0817   425.1908     2.28   0.023     135.5539     1804.61
       2013  |   374.1839   273.9362     1.37   0.172    -163.4744    911.8422
       2014  |  -194.6249   287.1866    -0.68   0.498    -758.2898      369.04
       2015  |  -258.9164   250.6313    -1.03   0.302    -750.8338     233.001
       2016  |  -190.1462   197.6498    -0.96   0.336    -578.0762    197.7837
       2017  |          0  (omitted)
             |
       _cons |     -10477   3299.329    -3.18   0.002    -16952.63   -4001.358
-------------+----------------------------------------------------------------
     sigma_u |  5358.6812
     sigma_e |  4202.4638
         rho |  .61918582   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

. 
. esttab reg*, ///
>         keep(over_rtg dltt at age emp xad xrd) ///
>         order(over_rtg dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
over_rtg           -7.395           14.79           27.10***        27.39***        27.39***        28.36***        36.54**         50.51*  
                  (-0.94)          (1.45)          (3.85)          (3.86)          (3.86)          (4.03)          (2.60)          (2.36)   

dltt                                              -0.0431***      -0.0360***      -0.0360***      -0.0354***     -0.00346         -0.0685   
                                                 (-10.42)         (-5.60)         (-5.60)         (-5.54)         (-0.06)         (-0.61)   

at                                                               -0.00788        -0.00788        -0.00863         -0.0142*        -0.0242   
                                                                  (-1.41)         (-1.41)         (-1.55)         (-2.05)         (-0.55)   

age                                                                                 327.2***        322.9***        148.6*          295.1***
                                                                                   (4.97)          (4.89)          (2.19)          (3.32)   

emp                                                                                               0.00993          0.0106         0.00851   
                                                                                                   (0.95)          (0.92)          (0.74)   

xad                                                                                                                -0.262          -1.088   
                                                                                                                  (-0.16)         (-0.82)   

xrd                                                                                                                                 1.028   
                                                                                                                                   (1.48)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16468           16468           16404           16404           16404           16269            6704            3946   
Firms                3393            3393            3382            3382            3382            3361            1443             865   
R^2             0.0000917          0.0159           0.102           0.103           0.103           0.104          0.0131          0.0246   
AIC              315485.8        315241.5        312576.1        312561.4        312561.4        310112.4        126691.5         76078.9   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & over_rtg!=.                                                                                   /*      assumption      */
(43,211 real changes made)

. replace xrd=0 if xrd==. & over_rtg!=.                                                                                   /*      assumption      */
(41,111 real changes made)

. 
. xtreg F.revt_yoy over_rtg dltt at age emp xad xrd i.year, fe cluster(cusip_n)   
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,269
Group variable: cusip_n                         Number of groups  =      3,361

R-sq:                                           Obs per group:
     within  = 0.1040                                         min =          1
     between = 0.0028                                         avg =        4.8
     overall = 0.0003                                         max =         10

                                                F(15,3360)        =      12.64
corr(u_i, Xb)  = -0.9594                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,361 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |     28.191   7.015598     4.02   0.000     14.43572    41.94627
        dltt |   -.035417    .006459    -5.48   0.000    -.0480809    -.022753
          at |  -.0087072    .005669    -1.54   0.125    -.0198223    .0024078
         age |   321.2639   66.32079     4.84   0.000     191.2307    451.2971
         emp |   .0098136   .0082305     1.19   0.233    -.0063237    .0259509
         xad |  -.6747043   .5548584    -1.22   0.224    -1.762599      .41319
         xrd |   .2748291   .5794911     0.47   0.635    -.8613618     1.41102
             |
        year |
       2009  |   2739.377   668.5953     4.10   0.000     1428.482    4050.272
       2010  |   2508.238   580.8678     4.32   0.000     1369.348    3647.128
       2011  |   1528.117   380.2121     4.02   0.000     782.6466    2273.588
       2012  |   1230.227   332.3788     3.70   0.000     578.5417    1881.912
       2013  |    915.223   256.3533     3.57   0.000     412.5988    1417.847
       2014  |   90.67451   169.6087     0.53   0.593    -241.8722    423.2212
       2015  |    138.674   151.1958     0.92   0.359    -157.7712    435.1192
       2016  |   199.0137   132.3247     1.50   0.133    -60.43128    458.4588
       2017  |          0  (omitted)
             |
       _cons |  -10494.72   2143.112    -4.90   0.000    -14696.65   -6292.781
-------------+----------------------------------------------------------------
     sigma_u |  6121.4859
     sigma_e |  3740.9852
         rho |  .72808172   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store as1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore 

. 
. *       Assume missing xad and xrd are 0, interact over_rtg and revt, 
. *       all independent variables lagged
. preserve

. replace xad=0 if xad==. & over_rtg!=.                                                                                   /*      assumption      */
(43,211 real changes made)

. replace xrd=0 if xrd==. & over_rtg!=.                                                                                   /*      assumption      */
(41,111 real changes made)

. 
. xtreg F.revt_yoy c.over_rtg##c.revt dltt at age emp xad xrd i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,269
Group variable: cusip_n                         Number of groups  =      3,361

R-sq:                                           Obs per group:
     within  = 0.2586                                         min =          1
     between = 0.0000                                         avg =        4.8
     overall = 0.0102                                         max =         10

                                                F(17,3360)        =      18.65
corr(u_i, Xb)  = -0.9504                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 3,361 clusters in cusip_n)
-----------------------------------------------------------------------------------
                  |               Robust
       F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
         over_rtg |   32.35179   14.96575     2.16   0.031      3.00888     61.6947
             revt |  -.2622536   .1171247    -2.24   0.025    -.4918966   -.0326107
                  |
c.over_rtg#c.revt |  -.0012966   .0021343    -0.61   0.544    -.0054813    .0028881
                  |
             dltt |  -.0380674    .007554    -5.04   0.000    -.0528783   -.0232564
               at |   .0090487   .0063564     1.42   0.155    -.0034141    .0215115
              age |   323.1012   45.34054     7.13   0.000     234.2034    411.9991
              emp |   .0728085    .019833     3.67   0.000     .0339226    .1116945
              xad |   .2119361   .5433805     0.39   0.697    -.8534539    1.277326
              xrd |    1.75067   .4883706     3.58   0.000     .7931363    2.708204
                  |
             year |
            2009  |   2272.318   445.7855     5.10   0.000     1398.279    3146.356
            2010  |   2273.526   430.0682     5.29   0.000     1430.304    3116.748
            2011  |   1441.975   276.2543     5.22   0.000     900.3311    1983.618
            2012  |    1125.62   238.8797     4.71   0.000     657.2558    1593.985
            2013  |   817.8283   173.6131     4.71   0.000     477.4303    1158.226
            2014  |   7.144167   156.1397     0.05   0.964    -298.9942    313.2826
            2015  |  -44.24194   125.2463    -0.35   0.724    -289.8086    201.3247
            2016  |   15.04169   120.9758     0.12   0.901    -222.1519    252.2353
            2017  |          0  (omitted)
                  |
            _cons |  -10130.33   1807.161    -5.61   0.000    -13673.58   -6587.085
------------------+----------------------------------------------------------------
          sigma_u |  6542.2015
          sigma_e |  3403.3572
              rho |  .78701453   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. est store int1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore

. 
. *       Assume missing xad and xrd are 0, interact over_rtg and revt, 
. *       all independent variables lagged, and standardized revt and over_rtg
. preserve

. replace xad=0 if xad==. & over_rtg!=.                                                                                   /*      assumption      */
(43,211 real changes made)

. replace xrd=0 if xrd==. & over_rtg!=.                                                                                   /*      assumption      */
(41,111 real changes made)

. 
. egen Sover_rtg = std(over_rtg)
(126629 missing values generated)

. egen Srevt = std(revt)
(67607 missing values generated)

. 
. xtreg F.revt_yoy c.Sover_rtg##c.Srevt dltt at emp xad xrd age i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,269
Group variable: cusip_n                         Number of groups  =      3,361

R-sq:                                           Obs per group:
     within  = 0.2586                                         min =          1
     between = 0.0000                                         avg =        4.8
     overall = 0.0102                                         max =         10

                                                F(17,3360)        =      18.65
corr(u_i, Xb)  = -0.9504                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 3,361 clusters in cusip_n)
-------------------------------------------------------------------------------------
                    |               Robust
         F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          Sover_rtg |   214.6284   72.36713     2.97   0.003     72.74029    356.5165
              Srevt |  -4838.567   626.1738    -7.73   0.000    -6066.288   -3610.847
                    |
c.Sover_rtg#c.Srevt |  -147.7039   243.1308    -0.61   0.544    -624.4032    328.9954
                    |
               dltt |  -.0380674    .007554    -5.04   0.000    -.0528783   -.0232564
                 at |   .0090487   .0063564     1.42   0.155    -.0034141    .0215115
                emp |   .0728085    .019833     3.67   0.000     .0339226    .1116945
                xad |   .2119361   .5433805     0.39   0.697     -.853454    1.277326
                xrd |    1.75067   .4883707     3.58   0.000     .7931363    2.708204
                age |   323.1012   45.34054     7.13   0.000     234.2034    411.9991
                    |
               year |
              2009  |   2272.318   445.7855     5.10   0.000     1398.279    3146.356
              2010  |   2273.526   430.0682     5.29   0.000     1430.304    3116.748
              2011  |   1441.975   276.2543     5.22   0.000     900.3311    1983.618
              2012  |    1125.62   238.8797     4.71   0.000     657.2558    1593.985
              2013  |   817.8283   173.6131     4.71   0.000     477.4303    1158.226
              2014  |   7.144192   156.1397     0.05   0.964    -298.9942    313.2826
              2015  |  -44.24194   125.2463    -0.35   0.724    -289.8085    201.3247
              2016  |    15.0417   120.9758     0.12   0.901    -222.1519    252.2353
              2017  |          0  (omitted)
                    |
              _cons |  -9642.928   1438.011    -6.71   0.000    -12462.39   -6823.463
--------------------+----------------------------------------------------------------
            sigma_u |  6542.2015
            sigma_e |  3403.3572
                rho |  .78701453   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. est store int2

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore

. 
. esttab reg* as1, ///
>         keep(over_rtg dltt at age emp xad xrd) ///
>         order(over_rtg dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
over_rtg           -7.395           14.79           27.10***        27.39***        27.39***        28.36***        36.54**         50.51*          28.19***
                  (-0.94)          (1.45)          (3.85)          (3.86)          (3.86)          (4.03)          (2.60)          (2.36)          (4.02)   

dltt                                              -0.0431***      -0.0360***      -0.0360***      -0.0354***     -0.00346         -0.0685         -0.0354***
                                                 (-10.42)         (-5.60)         (-5.60)         (-5.54)         (-0.06)         (-0.61)         (-5.48)   

at                                                               -0.00788        -0.00788        -0.00863         -0.0142*        -0.0242        -0.00871   
                                                                  (-1.41)         (-1.41)         (-1.55)         (-2.05)         (-0.55)         (-1.54)   

age                                                                                 327.2***        322.9***        148.6*          295.1***        321.3***
                                                                                   (4.97)          (4.89)          (2.19)          (3.32)          (4.84)   

emp                                                                                               0.00993          0.0106         0.00851         0.00981   
                                                                                                   (0.95)          (0.92)          (0.74)          (1.19)   

xad                                                                                                                -0.262          -1.088          -0.675   
                                                                                                                  (-0.16)         (-0.82)         (-1.22)   

xrd                                                                                                                                 1.028           0.275   
                                                                                                                                   (1.48)          (0.47)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16468           16468           16404           16404           16404           16269            6704            3946           16269   
Firms                3393            3393            3382            3382            3382            3361            1443             865            3361   
R^2             0.0000917          0.0159           0.102           0.103           0.103           0.104          0.0131          0.0246           0.104   
AIC              315485.8        315241.5        312576.1        312561.4        312561.4        310112.4        126691.5         76078.9        310109.1   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

.         
. esttab int1 int2, ///
>         keep(over_rtg revt c.over_rtg* Sover_rtg Srevt c.Sover_rtg* dltt at age emp xad xrd) ///
>         order(over_rtg revt c.over_rtg* Sover_rtg Srevt c.Sover_rtg* dltt at age emp xad xrd) ///
>         r2 ar2 aic

--------------------------------------------
                      (1)             (2)   
               F.revt_yoy      F.revt_yoy   
--------------------------------------------
over_rtg            32.35*                  
                   (2.16)                   

revt               -0.262*                  
                  (-2.24)                   

c.over_rtg~t     -0.00130                   
                  (-0.61)                   

Sover_rtg                           214.6** 
                                   (2.97)   

Srevt                             -4838.6***
                                  (-7.73)   

c.Sover_rt~t                       -147.7   
                                  (-0.61)   

dltt              -0.0381***      -0.0381***
                  (-5.04)         (-5.04)   

at                0.00905         0.00905   
                   (1.42)          (1.42)   

age                 323.1***        323.1***
                   (7.13)          (7.13)   

emp                0.0728***       0.0728***
                   (3.67)          (3.67)   

xad                 0.212           0.212   
                   (0.39)          (0.39)   

xrd                 1.751***        1.751***
                   (3.58)          (3.58)   
--------------------------------------------
N                   16269           16269   
R-sq                0.259           0.259   
adj. R-sq           0.258           0.258   
AIC              307033.0        307033.0   
--------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.         
. 
. /*
> ///     REVENUE = F (CSRHUB CATEGORIES)
>                 CSRHub CATEGORIES and subcategories:
>                         -       COMMUNITY
>                                 *       Community development and philanthropy
>                                 *       Product
>                                 *       Human rights and supply chain
>                         -       EMPLOYEES
>                                 *       Compensation and benefits
>                                 *       Diversity and labor rights
>                                 *       Training health and safety
>                         -       ENVIRONMENT
>                                 *       Energy and climate change
>                                 *       Environmental policy and reporting
>                                 *       Resource management
>                         -       GOVERNANCE
>                                 *       Board
>                                 *       Leadership ethics
>                                 *       Transparency and reporting
> */
. 
. ///     COMMUNITY
> 
. local dv revt_yoy

. local iv cmty_rtg_lym

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,230
Group variable: cusip_n                         Number of groups  =      3,931

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          1
     between = 0.0002                                         avg =        5.4
     overall = 0.0000                                         max =         10

                                                F(1,3930)         =       0.06
corr(u_i, Xb)  = -0.0156                        Prob > F          =     0.8134

                            (Std. Err. adjusted for 3,931 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   .6466296   2.739543     0.24   0.813    -4.724429    6.017688
       _cons |   133.9278   145.8052     0.92   0.358    -151.9332    419.7887
-------------+----------------------------------------------------------------
     sigma_u |  1155.0299
     sigma_e |   3526.318
         rho |  .09689106   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store cmty0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,230
Group variable: cusip_n                         Number of groups  =      3,931

R-sq:                                           Obs per group:
     within  = 0.0105                                         min =          1
     between = 0.0003                                         avg =        5.4
     overall = 0.0084                                         max =         10

                                                F(10,3930)        =       6.12
corr(u_i, Xb)  = -0.0134                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,931 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   4.263702   3.261315     1.31   0.191    -2.130326    10.65773
             |
        year |
       2009  |   1534.974   333.8148     4.60   0.000     880.5076    2189.441
       2010  |   1471.169   307.5094     4.78   0.000     868.2758    2074.062
       2011  |   1011.623   224.0699     4.51   0.000     572.3182    1450.927
       2012  |   998.5601   231.6205     4.31   0.000     544.4523    1452.668
       2013  |   1083.943   222.0101     4.88   0.000     648.6776    1519.209
       2014  |   689.9682   192.2696     3.59   0.000     313.0107    1066.926
       2015  |    914.784   217.5495     4.20   0.000     488.2635    1341.305
       2016  |   1243.915   243.1652     5.12   0.000     767.1737    1720.657
       2017  |   1301.881   237.7612     5.48   0.000     835.7338    1768.028
             |
       _cons |  -1080.386   335.3323    -3.22   0.001    -1737.828    -422.944
-------------+----------------------------------------------------------------
     sigma_u |  1160.5834
     sigma_e |   3508.716
         rho |  .09861983   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store cmty1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store cmty`counter'
  4.         estadd local yearFE "Yes", replace
  5.         
.         *       Increment
.         local vars "`vars' `control'"
  6.         local counter = `counter' + 1
  7. }

Fixed-effects (within) regression               Number of obs     =     21,145
Group variable: cusip_n                         Number of groups  =      3,923

R-sq:                                           Obs per group:
     within  = 0.0512                                         min =          1
     between = 0.0181                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(11,3922)        =      16.59
corr(u_i, Xb)  = -0.7171                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,923 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.493375   3.239373     2.31   0.021      1.14236    13.84439
        dltt |  -.0248217   .0024107   -10.30   0.000    -.0295479   -.0200954
             |
        year |
       2009  |   1558.795   338.7077     4.60   0.000     894.7351    2222.855
       2010  |   1586.961   314.4881     5.05   0.000      970.385    2203.536
       2011  |   1120.122   232.4589     4.82   0.000     664.3707    1575.874
       2012  |   1119.478   241.7741     4.63   0.000     645.4634    1593.493
       2013  |   1191.279   231.1577     5.15   0.000     738.0786     1644.48
       2014  |   800.8912   202.8199     3.95   0.000     403.2488    1198.534
       2015  |   1029.269   227.0674     4.53   0.000     584.0875     1474.45
       2016  |   1369.524   253.3701     5.41   0.000     872.7748    1866.274
       2017  |   1422.694   248.0288     5.74   0.000      936.417    1908.972
             |
       _cons |  -1248.519   355.2113    -3.51   0.000    -1944.935    -552.103
-------------+----------------------------------------------------------------
     sigma_u |  1775.1362
     sigma_e |  3443.4876
         rho |  .20995192   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     21,145
Group variable: cusip_n                         Number of groups  =      3,923

R-sq:                                           Obs per group:
     within  = 0.0512                                         min =          1
     between = 0.0181                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(12,3922)        =      15.86
corr(u_i, Xb)  = -0.7163                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,923 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.490232    3.32853     2.25   0.024     .9644188    14.01604
        dltt |  -.0249176   .0061631    -4.04   0.000    -.0370008   -.0128344
          at |   .0001074   .0065814     0.02   0.987    -.0127958    .0130106
             |
        year |
       2009  |   1558.655   341.2903     4.57   0.000      889.532    2227.779
       2010  |    1586.54   322.5156     4.92   0.000     954.2261    2218.854
       2011  |   1119.551   243.2961     4.60   0.000     642.5518     1596.55
       2012  |   1118.784   256.4776     4.36   0.000     615.9418    1621.626
       2013  |   1190.524   246.8695     4.82   0.000     706.5189    1674.528
       2014  |   800.0602   222.4673     3.60   0.000     363.8977    1236.223
       2015  |   1028.396   244.8947     4.20   0.000     548.2633    1508.529
       2016  |   1368.577   274.3341     4.99   0.000     830.7256    1906.428
       2017  |   1421.882   263.6625     5.39   0.000      904.953     1938.81
             |
       _cons |  -1249.279    340.169    -3.67   0.000    -1916.204   -582.3542
-------------+----------------------------------------------------------------
     sigma_u |  1773.2106
     sigma_e |  3443.5873
         rho |  .20958249   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,145
Group variable: cusip_n                         Number of groups  =      3,923

R-sq:                                           Obs per group:
     within  = 0.0512                                         min =          1
     between = 0.0039                                         avg =        5.4
     overall = 0.0002                                         max =         10

                                                F(12,3922)        =      15.86
corr(u_i, Xb)  = -0.8936                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,923 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.490232    3.32853     2.25   0.024     .9644188    14.01604
        dltt |  -.0249176   .0061631    -4.04   0.000    -.0370008   -.0128344
          at |   .0001074   .0065814     0.02   0.987    -.0127958    .0130106
         age |   157.9868   29.29583     5.39   0.000     100.5503    215.4233
             |
        year |
       2009  |   1400.668   315.7007     4.44   0.000     781.7154    2019.622
       2010  |   1270.567   271.3991     4.68   0.000       738.47    1802.663
       2011  |   645.5902   171.0323     3.77   0.000     310.2695    980.9108
       2012  |   486.8365   156.3782     3.11   0.002     180.2461    793.4268
       2013  |   400.5895   125.7014     3.19   0.001     154.1431    647.0358
       2014  |  -147.8608   101.1121    -1.46   0.144    -346.0981    50.37645
       2015  |  -77.51152   103.1233    -0.75   0.452    -279.6918    124.6688
       2016  |    104.682   107.2941     0.98   0.329    -105.6756    315.0396
       2017  |          0  (omitted)
             |
       _cons |  -4493.108   904.6538    -4.97   0.000    -6266.745   -2719.472
-------------+----------------------------------------------------------------
     sigma_u |  3068.3778
     sigma_e |  3443.5873
         rho |  .44257218   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,902
Group variable: cusip_n                         Number of groups  =      3,885

R-sq:                                           Obs per group:
     within  = 0.0518                                         min =          1
     between = 0.0005                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(13,3884)        =      15.05
corr(u_i, Xb)  = -0.8960                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,885 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.804894   3.326742     2.35   0.019     1.282566    14.32722
        dltt |  -.0241835   .0060416    -4.00   0.000    -.0360286   -.0123385
          at |  -.0008001   .0063767    -0.13   0.900     -.013302    .0117019
         age |   153.8415   30.17388     5.10   0.000     94.68336    212.9996
         emp |   .0113543   .0111217     1.02   0.307    -.0104506    .0331593
             |
        year |
       2009  |   1421.589   317.2704     4.48   0.000     799.5571    2043.622
       2010  |   1286.859   273.1653     4.71   0.000     751.2974     1822.42
       2011  |   658.3069   171.9143     3.83   0.000     321.2561    995.3578
       2012  |   498.3783   156.5228     3.18   0.001     191.5036     805.253
       2013  |   410.7511   125.3584     3.28   0.001     164.9764    656.5257
       2014  |  -141.6528   100.2532    -1.41   0.158    -338.2066    54.90104
       2015  |  -72.24382   102.6649    -0.70   0.482     -273.526    129.0383
       2016  |   117.8402   107.0536     1.10   0.271    -92.04631    327.7267
       2017  |          0  (omitted)
             |
       _cons |  -4589.624   909.3321    -5.05   0.000    -6372.438    -2806.81
-------------+----------------------------------------------------------------
     sigma_u |  3101.4778
     sigma_e |  3462.5309
         rho |  .44516094   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      8,581
Group variable: cusip_n                         Number of groups  =      1,711

R-sq:                                           Obs per group:
     within  = 0.0063                                         min =          1
     between = 0.0038                                         avg =        5.0
     overall = 0.0056                                         max =         10

                                                F(14,1710)        =       2.38
corr(u_i, Xb)  = -0.6464                        Prob > F          =     0.0028

                            (Std. Err. adjusted for 1,711 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.423943   5.404959     1.37   0.170    -3.177086    18.02497
        dltt |   .0318272    .079502     0.40   0.689    -.1241043    .1877587
          at |  -.0071425   .0090272    -0.79   0.429     -.024848    .0105629
         age |    75.7644   41.91828     1.81   0.071    -6.452106    157.9809
         emp |   .0107564    .011571     0.93   0.353    -.0119385    .0334512
         xad |  -.4550323   1.806852    -0.25   0.801    -3.998905     3.08884
             |
        year |
       2009  |   622.9248   441.2809     1.41   0.158    -242.5824    1488.432
       2010  |   731.0457   352.0857     2.08   0.038     40.48166     1421.61
       2011  |   104.5288    228.063     0.46   0.647    -342.7831    551.8408
       2012  |   182.2076   180.6398     1.01   0.313    -172.0907    536.5059
       2013  |   77.42496   144.0979     0.54   0.591    -205.2019    360.0518
       2014  |  -81.72602   143.9623    -0.57   0.570    -364.0868    200.6348
       2015  |  -155.5733   151.0837    -1.03   0.303    -451.9016    140.7549
       2016  |  -10.02498   127.8742    -0.08   0.938    -260.8313    240.7813
       2017  |          0  (omitted)
             |
       _cons |  -2284.758   1209.117    -1.89   0.059    -4656.262    86.74677
-------------+----------------------------------------------------------------
     sigma_u |  2116.9317
     sigma_e |  3287.0101
         rho |  .29317337   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,938
Group variable: cusip_n                         Number of groups  =        998

R-sq:                                           Obs per group:
     within  = 0.0233                                         min =          1
     between = 0.0001                                         avg =        4.9
     overall = 0.0032                                         max =         10

                                                F(15,997)         =       3.64
corr(u_i, Xb)  = -0.8025                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 998 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   15.33351   7.685085     2.00   0.046     .2527135    30.41431
        dltt |  -.2096794   .1923237    -1.09   0.276    -.5870851    .1677263
          at |   .0511978   .0908217     0.56   0.573    -.1270258    .2294213
         age |   169.7534   42.85982     3.96   0.000     85.64755    253.8592
         emp |   .0041545   .0122715     0.34   0.735    -.0199264    .0282354
         xad |  -1.873713    1.70123    -1.10   0.271    -5.212115    1.464689
         xrd |   .7445088   .8269253     0.90   0.368    -.8782049    2.367223
             |
        year |
       2009  |   1509.318   537.4068     2.81   0.005     454.7399    2563.896
       2010  |    1386.07   439.2895     3.16   0.002     524.0319    2248.108
       2011  |   395.9265   202.5595     1.95   0.051    -1.565394    793.4185
       2012  |    421.723   179.8608     2.34   0.019     68.77388    774.6721
       2013  |   154.5529   134.9983     1.14   0.253    -110.3605    419.4663
       2014  |  -162.1497   178.8639    -0.91   0.365    -513.1426    188.8432
       2015  |  -314.6153   218.4262    -1.44   0.150    -743.2432    114.0126
       2016  |  -138.7763   176.6423    -0.79   0.432    -485.4097    207.8571
       2017  |          0  (omitted)
             |
       _cons |  -5029.516   1272.693    -3.95   0.000    -7526.981   -2532.052
-------------+----------------------------------------------------------------
     sigma_u |  3449.3949
     sigma_e |  3815.6482
         rho |  .44971471   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

. 
. esttab cmty*, ///
>         keep(cmty_rtg_lym dltt at age emp xad xrd) ///
>         order(cmty_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
cmty_rtg_lym        0.647           4.264           7.493*          7.490*          7.490*          7.805*          7.424           15.33*  
                   (0.24)          (1.31)          (2.31)          (2.25)          (2.25)          (2.35)          (1.37)          (2.00)   

dltt                                              -0.0248***      -0.0249***      -0.0249***      -0.0242***       0.0318          -0.210   
                                                 (-10.30)         (-4.04)         (-4.04)         (-4.00)          (0.40)         (-1.09)   

at                                                               0.000107        0.000107       -0.000800        -0.00714          0.0512   
                                                                   (0.02)          (0.02)         (-0.13)         (-0.79)          (0.56)   

age                                                                                 158.0***        153.8***        75.76           169.8***
                                                                                   (5.39)          (5.10)          (1.81)          (3.96)   

emp                                                                                                0.0114          0.0108         0.00415   
                                                                                                   (1.02)          (0.93)          (0.34)   

xad                                                                                                                -0.455          -1.874   
                                                                                                                  (-0.25)         (-1.10)   

xrd                                                                                                                                 0.745   
                                                                                                                                   (0.90)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21230           21230           21145           21145           21145           20902            8581            4938   
Firms                3931            3931            3923            3923            3923            3885            1711             998   
R^2            0.00000211          0.0105          0.0512          0.0512          0.0512          0.0518         0.00628          0.0233   
AIC              402715.4        402509.9        400096.0        400098.0        400098.0        395721.6        161427.3         94355.7   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & `iv'!=.                                                                                               /*      assumption      */
(63,271 real changes made)

. replace xrd=0 if xrd==. & `iv'!=.                                                                                               /*      assumption      */
(60,751 real changes made)

. 
. xtreg F.`dv' `iv' `controls' i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,902
Group variable: cusip_n                         Number of groups  =      3,885

R-sq:                                           Obs per group:
     within  = 0.0520                                         min =          1
     between = 0.0006                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(15,3884)        =      13.47
corr(u_i, Xb)  = -0.8950                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,885 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.825114   3.333562     2.35   0.019     1.289415    14.36081
        dltt |   -.024228   .0061422    -3.94   0.000    -.0362702   -.0121858
          at |  -.0007665   .0065021    -0.12   0.906    -.0135143    .0119814
         age |   153.2767   30.30144     5.06   0.000     93.86846    212.6849
         emp |    .011816   .0087719     1.35   0.178     -.005382     .029014
         xad |   -.567175   .6424038    -0.88   0.377    -1.826656    .6923059
         xrd |   .1629551    .606814     0.27   0.788    -1.026749    1.352659
             |
        year |
       2009  |   1419.313   316.5945     4.48   0.000     798.6061    2040.021
       2010  |   1286.846   273.1859     4.71   0.000     751.2442    1822.447
       2011  |    659.508   172.1203     3.83   0.000     322.0533    996.9626
       2012  |   499.7946   156.8344     3.19   0.001     192.3091    807.2801
       2013  |   413.6222   125.8207     3.29   0.001     166.9412    660.3031
       2014  |  -138.3148   100.2697    -1.38   0.168     -334.901    58.27144
       2015  |  -67.70519   103.0136    -0.66   0.511     -269.671    134.2606
       2016  |   121.4757   106.2828     1.14   0.253    -86.89975    329.8511
       2017  |          0  (omitted)
             |
       _cons |  -4568.168   902.7099    -5.06   0.000    -6337.998   -2798.338
-------------+----------------------------------------------------------------
     sigma_u |  3090.6921
     sigma_e |  3462.3183
         rho |  .44347105   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store as1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore 

. 
. *       Table
. esttab cmty* as1, ///
>         keep(cmty_rtg_lym dltt at age emp xad xrd) ///
>         order(cmty_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
cmty_rtg_lym        0.647           4.264           7.493*          7.490*          7.490*          7.805*          7.424           15.33*          7.825*  
                   (0.24)          (1.31)          (2.31)          (2.25)          (2.25)          (2.35)          (1.37)          (2.00)          (2.35)   

dltt                                              -0.0248***      -0.0249***      -0.0249***      -0.0242***       0.0318          -0.210         -0.0242***
                                                 (-10.30)         (-4.04)         (-4.04)         (-4.00)          (0.40)         (-1.09)         (-3.94)   

at                                                               0.000107        0.000107       -0.000800        -0.00714          0.0512       -0.000766   
                                                                   (0.02)          (0.02)         (-0.13)         (-0.79)          (0.56)         (-0.12)   

age                                                                                 158.0***        153.8***        75.76           169.8***        153.3***
                                                                                   (5.39)          (5.10)          (1.81)          (3.96)          (5.06)   

emp                                                                                                0.0114          0.0108         0.00415          0.0118   
                                                                                                   (1.02)          (0.93)          (0.34)          (1.35)   

xad                                                                                                                -0.455          -1.874          -0.567   
                                                                                                                  (-0.25)         (-1.10)         (-0.88)   

xrd                                                                                                                                 0.745           0.163   
                                                                                                                                   (0.90)          (0.27)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21230           21230           21145           21145           21145           20902            8581            4938           20902   
Firms                3931            3931            3923            3923            3923            3885            1711             998            3885   
R^2            0.00000211          0.0105          0.0512          0.0512          0.0512          0.0518         0.00628          0.0233          0.0520   
AIC              402715.4        402509.9        400096.0        400098.0        400098.0        395721.6        161427.3         94355.7        395720.5   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.         
.         
.         
. ///     EMPLOYEES
> 
. local dv revt_yoy

. local iv emp_rtg_lym

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,305
Group variable: cusip_n                         Number of groups  =      3,932

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0000                                         avg =        5.4
     overall = 0.0000                                         max =         10

                                                F(1,3931)         =       1.10
corr(u_i, Xb)  = -0.0132                        Prob > F          =     0.2954

                            (Std. Err. adjusted for 3,932 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |  -3.765992    3.59833    -1.05   0.295    -10.82076    3.288777
       _cons |   370.2442   192.5009     1.92   0.055    -7.166831    747.6553
-------------+----------------------------------------------------------------
     sigma_u |  1171.0391
     sigma_e |  3515.4949
         rho |  .09987828   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store emp0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,305
Group variable: cusip_n                         Number of groups  =      3,932

R-sq:                                           Obs per group:
     within  = 0.0104                                         min =          1
     between = 0.0008                                         avg =        5.4
     overall = 0.0085                                         max =         10

                                                F(10,3931)        =       5.89
corr(u_i, Xb)  = -0.0116                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,932 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   4.376255   5.219954     0.84   0.402    -5.857817    14.61033
             |
        year |
       2009  |   1540.408   328.5061     4.69   0.000     896.3497    2184.467
       2010  |   1473.809   303.9155     4.85   0.000     877.9618    2069.656
       2011  |   1036.834   224.3241     4.62   0.000     597.0318    1476.637
       2012  |   1013.576   229.6012     4.41   0.000     563.4271    1463.724
       2013  |   1089.396   222.8654     4.89   0.000     652.4534    1526.339
       2014  |    687.466   195.0205     3.53   0.000     305.1152    1069.817
       2015  |   912.6606   221.5041     4.12   0.000     478.3868    1346.934
       2016  |    1237.11   244.2304     5.07   0.000     758.2796     1715.94
       2017  |   1312.298   239.4885     5.48   0.000     842.7643    1781.831
             |
       _cons |  -1090.076   361.8135    -3.01   0.003    -1799.436   -380.7163
-------------+----------------------------------------------------------------
     sigma_u |  1174.8186
     sigma_e |  3498.1591
         rho |  .10135615   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store emp1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store emp`counter'
  4.         estadd local yearFE "Yes", replace
  5.         
.         *       Increment
.         local vars "`vars' `control'"
  6.         local counter = `counter' + 1
  7. }

Fixed-effects (within) regression               Number of obs     =     21,221
Group variable: cusip_n                         Number of groups  =      3,924

R-sq:                                           Obs per group:
     within  = 0.0514                                         min =          1
     between = 0.0174                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(11,3923)        =      18.39
corr(u_i, Xb)  = -0.7176                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,924 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   11.68024   4.146227     2.82   0.005     3.551281    19.80921
        dltt |  -.0249399   .0024226   -10.29   0.000    -.0296895   -.0201902
             |
        year |
       2009  |   1579.912   337.1266     4.69   0.000     918.9516    2240.872
       2010  |   1622.556    310.237     5.23   0.000     1014.315    2230.797
       2011  |   1192.332   232.2343     5.13   0.000     737.0204    1647.643
       2012  |    1184.62   238.8494     4.96   0.000     716.3393    1652.901
       2013  |    1209.76   232.5672     5.20   0.000     753.7961    1665.724
       2014  |    786.383   205.0185     3.84   0.000     384.4301    1188.336
       2015  |   1011.559   230.3784     4.39   0.000     559.8863    1463.232
       2016  |   1358.452   254.3108     5.34   0.000      859.858    1857.046
       2017  |   1449.962   250.7135     5.78   0.000     958.4206    1941.503
             |
       _cons |  -1489.751   340.9077    -4.37   0.000    -2158.124   -821.3783
-------------+----------------------------------------------------------------
     sigma_u |   1785.988
     sigma_e |  3432.4338
         rho |  .21305707   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     21,221
Group variable: cusip_n                         Number of groups  =      3,924

R-sq:                                           Obs per group:
     within  = 0.0514                                         min =          1
     between = 0.0173                                         avg =        5.4
     overall = 0.0013                                         max =         10

                                                F(12,3923)        =      17.79
corr(u_i, Xb)  = -0.7158                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,924 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   11.68103   4.142541     2.82   0.005     3.559295    19.80277
        dltt |  -.0251733   .0061477    -4.09   0.000    -.0372264   -.0131202
          at |   .0002613   .0065506     0.04   0.968    -.0125816    .0131042
             |
        year |
       2009  |   1579.598   339.5038     4.65   0.000     913.9772    2245.218
       2010  |   1621.575   317.8769     5.10   0.000     998.3554    2244.794
       2011  |   1190.968   243.2058     4.90   0.000     714.1463     1667.79
       2012  |   1182.973   253.2499     4.67   0.000     686.4591    1679.487
       2013  |   1207.912   248.7445     4.86   0.000     720.2315    1695.593
       2014  |   784.3466   224.7891     3.49   0.000      343.632    1225.061
       2015  |   1009.414   248.5394     4.06   0.000     522.1355    1496.693
       2016  |   1356.132   275.5369     4.92   0.000     815.9225    1896.341
       2017  |   1447.975   266.8999     5.43   0.000     924.6995    1971.251
             |
       _cons |  -1492.037   328.2381    -4.55   0.000    -2135.571    -848.504
-------------+----------------------------------------------------------------
     sigma_u |   1781.487
     sigma_e |  3432.5312
         rho |  .21220267   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,221
Group variable: cusip_n                         Number of groups  =      3,924

R-sq:                                           Obs per group:
     within  = 0.0514                                         min =          1
     between = 0.0038                                         avg =        5.4
     overall = 0.0002                                         max =         10

                                                F(12,3923)        =      17.79
corr(u_i, Xb)  = -0.8973                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,924 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   11.68103   4.142541     2.82   0.005     3.559295    19.80277
        dltt |  -.0251733   .0061477    -4.09   0.000    -.0372264   -.0131202
          at |   .0002613   .0065506     0.04   0.968    -.0125816    .0131042
         age |   160.8861   29.65554     5.43   0.000     102.7444    219.0279
             |
        year |
       2009  |   1418.712   313.5758     4.52   0.000     803.9247    2033.499
       2010  |   1299.803   266.1512     4.88   0.000      777.995     1821.61
       2011  |   708.3096   170.7905     4.15   0.000     373.4631    1043.156
       2012  |   539.4285   152.6705     3.53   0.000     240.1076    838.7495
       2013  |   403.4815   125.7698     3.21   0.001     156.9012    650.0619
       2014  |  -180.9702   104.0094    -1.74   0.082    -384.8879     22.9475
       2015  |  -116.7888   106.7049    -1.09   0.274     -325.991    92.41343
       2016  |   69.04264   107.4664     0.64   0.521    -141.6526    279.7379
       2017  |          0  (omitted)
             |
       _cons |  -4793.414   863.2193    -5.55   0.000    -6485.815   -3101.013
-------------+----------------------------------------------------------------
     sigma_u |  3133.8832
     sigma_e |  3432.5312
         rho |  .45461275   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,980
Group variable: cusip_n                         Number of groups  =      3,890

R-sq:                                           Obs per group:
     within  = 0.0521                                         min =          1
     between = 0.0004                                         avg =        5.4
     overall = 0.0013                                         max =         10

                                                F(13,3889)        =      16.98
corr(u_i, Xb)  = -0.9000                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,890 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |    12.3952   4.076787     3.04   0.002     4.402354    20.38804
        dltt |  -.0244239   .0060273    -4.05   0.000    -.0362409   -.0126069
          at |  -.0006752   .0063422    -0.11   0.915    -.0131096    .0117592
         age |   156.6706   30.58041     5.12   0.000     96.71541    216.6257
         emp |   .0117871   .0111433     1.06   0.290    -.0100602    .0336344
             |
        year |
       2009  |   1441.088   314.9961     4.57   0.000     823.5144    2058.661
       2010  |   1318.577   267.5976     4.93   0.000     793.9323    1843.222
       2011  |   725.0063   171.3993     4.23   0.000     388.9653    1061.047
       2012  |   555.0109   152.3404     3.64   0.000     256.3363    853.6855
       2013  |   413.7925    125.378     3.30   0.001     167.9795    659.6054
       2014  |  -177.6945   103.3644    -1.72   0.086    -380.3481    24.95909
       2015  |  -112.9038   106.1654    -1.06   0.288     -321.049    95.24142
       2016  |   80.92609   107.1993     0.75   0.450    -129.2462    291.0984
       2017  |          0  (omitted)
             |
       _cons |  -4916.797   865.3394    -5.68   0.000    -6613.359   -3220.235
-------------+----------------------------------------------------------------
     sigma_u |  3171.9006
     sigma_e |  3451.5576
         rho |  .45785293   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      8,642
Group variable: cusip_n                         Number of groups  =      1,711

R-sq:                                           Obs per group:
     within  = 0.0066                                         min =          1
     between = 0.0045                                         avg =        5.1
     overall = 0.0063                                         max =         10

                                                F(14,1710)        =       2.80
corr(u_i, Xb)  = -0.6675                        Prob > F          =     0.0004

                            (Std. Err. adjusted for 1,711 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   15.14521    6.35096     2.38   0.017     2.688738    27.60168
        dltt |   .0322222   .0797616     0.40   0.686    -.1242183    .1886627
          at |  -.0068901   .0089888    -0.77   0.443    -.0245203    .0107401
         age |   78.85962   42.68026     1.85   0.065    -4.851411    162.5706
         emp |   .0110043   .0114832     0.96   0.338    -.0115183     .033527
         xad |  -.3741701   1.810638    -0.21   0.836    -3.925469    3.177129
             |
        year |
       2009  |   636.1575   433.2855     1.47   0.142     -213.668    1485.983
       2010  |   771.8422   336.6849     2.29   0.022     111.4845      1432.2
       2011  |   201.4072   214.4683     0.94   0.348    -219.2407    622.0551
       2012  |   273.8775   166.9581     1.64   0.101    -53.58611    601.3411
       2013  |   86.56964   146.4384     0.59   0.554    -200.6476    373.7869
       2014  |  -123.5274   153.2212    -0.81   0.420    -424.0482    176.9934
       2015  |  -203.3439   157.5643    -1.29   0.197    -512.3831    105.6952
       2016  |   -56.8173    130.943    -0.43   0.664    -313.6427    200.0081
       2017  |          0  (omitted)
             |
       _cons |  -2793.455   1010.786    -2.76   0.006    -4775.962   -810.9474
-------------+----------------------------------------------------------------
     sigma_u |  2178.2366
     sigma_e |  3264.5438
         rho |  .30805913   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,980
Group variable: cusip_n                         Number of groups  =        999

R-sq:                                           Obs per group:
     within  = 0.0227                                         min =          1
     between = 0.0001                                         avg =        5.0
     overall = 0.0031                                         max =         10

                                                F(15,998)         =       3.72
corr(u_i, Xb)  = -0.8158                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 999 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   13.46267   6.752579     1.99   0.046     .2117845    26.71355
        dltt |  -.2120646   .1912977    -1.11   0.268    -.5874564    .1633272
          at |   .0525858   .0901609     0.58   0.560     -.124341    .2295125
         age |   175.5548    44.3755     3.96   0.000     88.47484    262.6348
         emp |   .0041979    .012159     0.35   0.730    -.0196621     .028058
         xad |  -1.792273   1.712451    -1.05   0.296    -5.152692    1.568145
         xrd |   .7369974   .8157278     0.90   0.366     -.863741    2.337736
             |
        year |
       2009  |   1481.453   529.5143     2.80   0.005     442.3638    2520.542
       2010  |   1369.632   428.7504     3.19   0.001     528.2765    2210.988
       2011  |   460.1939   204.7042     2.25   0.025     58.49389    861.8938
       2012  |   450.5279   182.2756     2.47   0.014     92.84055    808.2152
       2013  |   161.4796   136.4902     1.18   0.237    -106.3612    429.3204
       2014  |  -178.6263   184.9335    -0.97   0.334    -541.5295    184.2768
       2015  |  -334.6018   220.0841    -1.52   0.129    -766.4825    97.27887
       2016  |  -171.7113   179.4191    -0.96   0.339    -523.7933    180.3707
       2017  |          0  (omitted)
             |
       _cons |  -5079.539   1237.438    -4.10   0.000    -7507.818    -2651.26
-------------+----------------------------------------------------------------
     sigma_u |  3544.9889
     sigma_e |  3787.3172
         rho |  .46698665   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

. 
. esttab emp*, ///
>         keep(emp_rtg_lym dltt at age emp xad xrd) ///
>         order(emp_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
emp_rtg_lym        -3.766           4.376           11.68**         11.68**         11.68**         12.40**         15.15*          13.46*  
                  (-1.05)          (0.84)          (2.82)          (2.82)          (2.82)          (3.04)          (2.38)          (1.99)   

dltt                                              -0.0249***      -0.0252***      -0.0252***      -0.0244***       0.0322          -0.212   
                                                 (-10.29)         (-4.09)         (-4.09)         (-4.05)          (0.40)         (-1.11)   

at                                                               0.000261        0.000261       -0.000675        -0.00689          0.0526   
                                                                   (0.04)          (0.04)         (-0.11)         (-0.77)          (0.58)   

age                                                                                 160.9***        156.7***        78.86           175.6***
                                                                                   (5.43)          (5.12)          (1.85)          (3.96)   

emp                                                                                                0.0118          0.0110         0.00420   
                                                                                                   (1.06)          (0.96)          (0.35)   

xad                                                                                                                -0.374          -1.792   
                                                                                                                  (-0.21)         (-1.05)   

xrd                                                                                                                                 0.737   
                                                                                                                                   (0.90)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21305           21305           21221           21221           21221           20980            8642            4980   
Firms                3932            3932            3924            3924            3924            3890            1711             999   
R^2             0.0000745          0.0104          0.0514          0.0514          0.0514          0.0521         0.00664          0.0227   
AIC              404022.9        403819.2        401413.7        401415.6        401415.6        397076.7        162471.5         95093.4   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & `iv'!=.                                                                                               /*      assumption      */
(61,189 real changes made)

. replace xrd=0 if xrd==. & `iv'!=.                                                                                               /*      assumption      */
(58,658 real changes made)

. 
. xtreg F.`dv' `iv' `controls' i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,980
Group variable: cusip_n                         Number of groups  =      3,890

R-sq:                                           Obs per group:
     within  = 0.0523                                         min =          1
     between = 0.0005                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(15,3889)        =      15.06
corr(u_i, Xb)  = -0.8989                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,890 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   12.43314   4.057742     3.06   0.002     4.477637    20.38865
        dltt |  -.0244294   .0061297    -3.99   0.000    -.0364471   -.0124117
          at |  -.0006876   .0064697    -0.11   0.915    -.0133719    .0119967
         age |   156.0338   30.68625     5.08   0.000     95.87116    216.1965
         emp |   .0119654   .0087507     1.37   0.172    -.0051911    .0291218
         xad |  -.5348918   .6410036    -0.83   0.404    -1.791627    .7218433
         xrd |   .1854759   .5978444     0.31   0.756    -.9866423    1.357594
             |
        year |
       2009  |   1439.319   314.3355     4.58   0.000     823.0414    2055.597
       2010  |   1318.671    267.558     4.93   0.000     794.1042    1843.239
       2011  |     726.44   171.5263     4.24   0.000       390.15     1062.73
       2012  |   556.6749    152.613     3.65   0.000     257.4658    855.8839
       2013  |   416.7018   125.8325     3.31   0.001     169.9978    663.4058
       2014  |  -174.5232   103.3133    -1.69   0.091    -377.0766    28.03025
       2015  |  -108.6435   106.2208    -1.02   0.306    -316.8973    99.61026
       2016  |   84.24228   106.1223     0.79   0.427    -123.8184    292.3029
       2017  |          0  (omitted)
             |
       _cons |  -4893.918   859.0168    -5.70   0.000    -6578.084   -3209.751
-------------+----------------------------------------------------------------
     sigma_u |  3159.0358
     sigma_e |  3451.3582
         rho |  .45586467   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store as1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore 

. 
. *       Table
. esttab emp* as1, ///
>         keep(emp_rtg_lym dltt at age emp xad xrd) ///
>         order(emp_rtg_lym  dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
emp_rtg_lym        -3.766           4.376           11.68**         11.68**         11.68**         12.40**         15.15*          13.46*          12.43** 
                  (-1.05)          (0.84)          (2.82)          (2.82)          (2.82)          (3.04)          (2.38)          (1.99)          (3.06)   

dltt                                              -0.0249***      -0.0252***      -0.0252***      -0.0244***       0.0322          -0.212         -0.0244***
                                                 (-10.29)         (-4.09)         (-4.09)         (-4.05)          (0.40)         (-1.11)         (-3.99)   

at                                                               0.000261        0.000261       -0.000675        -0.00689          0.0526       -0.000688   
                                                                   (0.04)          (0.04)         (-0.11)         (-0.77)          (0.58)         (-0.11)   

age                                                                                 160.9***        156.7***        78.86           175.6***        156.0***
                                                                                   (5.43)          (5.12)          (1.85)          (3.96)          (5.08)   

emp                                                                                                0.0118          0.0110         0.00420          0.0120   
                                                                                                   (1.06)          (0.96)          (0.35)          (1.37)   

xad                                                                                                                -0.374          -1.792          -0.535   
                                                                                                                  (-0.21)         (-1.05)         (-0.83)   

xrd                                                                                                                                 0.737           0.185   
                                                                                                                                   (0.90)          (0.31)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21305           21305           21221           21221           21221           20980            8642            4980           20980   
Firms                3932            3932            3924            3924            3924            3890            1711             999            3890   
R^2             0.0000745          0.0104          0.0514          0.0514          0.0514          0.0521         0.00664          0.0227          0.0523   
AIC              404022.9        403819.2        401413.7        401415.6        401415.6        397076.7        162471.5         95093.4        397075.9   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. ///     ENVIRONMENT
> 
. local dv revt_yoy

. local iv enviro_rtg_lym

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,490
Group variable: cusip_n                         Number of groups  =      3,415

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0006                                         avg =        4.8
     overall = 0.0000                                         max =         10

                                                F(1,3414)         =       1.24
corr(u_i, Xb)  = -0.0036                        Prob > F          =     0.2653

                              (Std. Err. adjusted for 3,415 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |  -3.019088   2.709779    -1.11   0.265    -8.332042    2.293865
         _cons |   365.0245    136.507     2.67   0.008     97.38085    632.6681
---------------+----------------------------------------------------------------
       sigma_u |  1295.9882
       sigma_e |  3925.1881
           rho |  .09829789   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store enviro0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. estadd local firmFE "Yes", replace

added macro:
             e(firmFE) : "Yes"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,490
Group variable: cusip_n                         Number of groups  =      3,415

R-sq:                                           Obs per group:
     within  = 0.0158                                         min =          1
     between = 0.0018                                         avg =        4.8
     overall = 0.0132                                         max =         10

                                                F(10,3414)        =       5.52
corr(u_i, Xb)  = -0.0106                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,415 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   5.989879   3.493282     1.71   0.086     -.859256    12.83901
               |
          year |
         2009  |   3012.876   732.6556     4.11   0.000     1576.388    4449.364
         2010  |   2818.117   694.4382     4.06   0.000     1456.561    4179.674
         2011  |    2156.64   556.0401     3.88   0.000     1066.435    3246.845
         2012  |   2138.247   574.2518     3.72   0.000     1012.335    3264.159
         2013  |    2202.59   556.1719     3.96   0.000     1112.127    3293.054
         2014  |   1743.375   511.1792     3.41   0.001     741.1264    2745.623
         2015  |   2052.497   557.6647     3.68   0.000     959.1062    3145.887
         2016  |   2396.841   589.5849     4.07   0.000     1240.866    3552.816
         2017  |   2474.755   571.9321     4.33   0.000     1353.391    3596.119
               |
         _cons |  -2253.259   634.7966    -3.55   0.000    -3497.878   -1008.639
---------------+----------------------------------------------------------------
       sigma_u |  1301.7314
       sigma_e |  3895.5863
           rho |  .10044427   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store enviro1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store enviro`counter'
  4.         estadd local yearFE "Yes", replace
  5.         estadd local firmFE "Yes", replace
  6.         
.         *       Increment
.         local vars "`vars' `control'"
  7.         local counter = `counter' + 1
  8. }

Fixed-effects (within) regression               Number of obs     =     16,426
Group variable: cusip_n                         Number of groups  =      3,404

R-sq:                                           Obs per group:
     within  = 0.1016                                         min =          1
     between = 0.0235                                         avg =        4.8
     overall = 0.0012                                         max =         10

                                                F(11,3403)        =      15.38
corr(u_i, Xb)  = -0.8554                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,404 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   9.406453    2.85474     3.30   0.001     3.809274    15.00363
          dltt |  -.0429904   .0041758   -10.30   0.000    -.0511777    -.034803
               |
          year |
         2009  |   2974.285   722.5474     4.12   0.000     1557.614    4390.956
         2010  |   3026.123   692.7331     4.37   0.000     1667.908    4384.338
         2011  |   2364.423    554.181     4.27   0.000     1277.862    3450.985
         2012  |   2371.442    572.068     4.15   0.000     1249.811    3493.074
         2013  |   2399.314   555.7884     4.32   0.000     1309.601    3489.027
         2014  |   1944.055   512.3402     3.79   0.000     939.5297    2948.581
         2015  |   2297.558   557.6099     4.12   0.000     1204.274    3390.842
         2016  |   2651.426   590.2174     4.49   0.000      1494.21    3808.642
         2017  |    2735.69   573.3073     4.77   0.000     1611.629    3859.751
               |
         _cons |  -2402.416   622.6739    -3.86   0.000    -3623.269   -1181.563
---------------+----------------------------------------------------------------
       sigma_u |  2879.7285
       sigma_e |  3729.4147
           rho |  .37352812   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     16,426
Group variable: cusip_n                         Number of groups  =      3,404

R-sq:                                           Obs per group:
     within  = 0.1025                                         min =          1
     between = 0.0239                                         avg =        4.8
     overall = 0.0007                                         max =         10

                                                F(12,3403)        =      14.09
corr(u_i, Xb)  = -0.8768                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,404 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   9.888409   2.897949     3.41   0.001     4.206513    15.57031
          dltt |  -.0358274   .0064919    -5.52   0.000    -.0485557   -.0230991
            at |  -.0079526   .0056148    -1.42   0.157    -.0189615    .0030562
               |
          year |
         2009  |   3002.584   724.4913     4.14   0.000     1582.102    4423.066
         2010  |   3088.811   699.5856     4.42   0.000      1717.16    4460.461
         2011  |   2444.959   559.9406     4.37   0.000     1347.105    3542.813
         2012  |   2467.367   580.1327     4.25   0.000     1329.923     3604.81
         2013  |   2495.536   563.6796     4.43   0.000     1390.351    3600.721
         2014  |   2045.929    521.324     3.92   0.000     1023.789    3068.069
         2015  |   2407.373   566.5359     4.25   0.000     1296.588    3518.158
         2016  |   2766.813   601.2536     4.60   0.000     1587.958    3945.667
         2017  |    2841.99   582.8472     4.88   0.000     1699.225    3984.756
               |
         _cons |  -2372.765   618.3658    -3.84   0.000    -3585.171   -1160.359
---------------+----------------------------------------------------------------
       sigma_u |  3095.7548
       sigma_e |  3727.6249
           rho |  .40818368   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,426
Group variable: cusip_n                         Number of groups  =      3,404

R-sq:                                           Obs per group:
     within  = 0.1025                                         min =          1
     between = 0.0051                                         avg =        4.8
     overall = 0.0001                                         max =         10

                                                F(12,3403)        =      14.09
corr(u_i, Xb)  = -0.9575                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,404 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   9.888409   2.897949     3.41   0.001     4.206513    15.57031
          dltt |  -.0358274   .0064919    -5.52   0.000    -.0485557   -.0230991
            at |  -.0079526   .0056148    -1.42   0.157    -.0189615    .0030562
           age |   315.7767    64.7608     4.88   0.000     188.8027    442.7507
               |
          year |
         2009  |   2686.807   662.1792     4.06   0.000     1388.498    3985.116
         2010  |   2457.257   574.3326     4.28   0.000     1331.186    3583.329
         2011  |   1497.629   377.6712     3.97   0.000     757.1435    2238.114
         2012  |    1204.26   330.3843     3.65   0.000      556.488    1852.031
         2013  |   916.6523    255.286     3.59   0.000     416.1229    1417.182
         2014  |   151.2688   168.1295     0.90   0.368    -178.3762    480.9139
         2015  |   196.9359   153.9367     1.28   0.201    -104.8819    498.7537
         2016  |   240.5989   135.6772     1.77   0.076    -25.41807     506.616
         2017  |          0  (omitted)
               |
         _cons |  -9220.002    2003.46    -4.60   0.000    -13148.11   -5291.895
---------------+----------------------------------------------------------------
       sigma_u |  5946.6213
       sigma_e |  3727.6249
           rho |  .71790713   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,291
Group variable: cusip_n                         Number of groups  =      3,383

R-sq:                                           Obs per group:
     within  = 0.1030                                         min =          1
     between = 0.0029                                         avg =        4.8
     overall = 0.0004                                         max =         10

                                                F(13,3382)        =      13.30
corr(u_i, Xb)  = -0.9576                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,383 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   10.09239   2.896385     3.48   0.000     4.413547    15.77123
          dltt |  -.0352624   .0064542    -5.46   0.000    -.0479169   -.0226079
            at |  -.0086694   .0055929    -1.55   0.121    -.0196352    .0022964
           age |   311.2467   65.00929     4.79   0.000     183.7852    438.7082
           emp |   .0095292   .0104241     0.91   0.361    -.0109089    .0299674
               |
          year |
         2009  |   2705.831   665.2004     4.07   0.000     1401.595    4010.066
         2010  |   2471.114   577.0871     4.28   0.000     1339.639    3602.588
         2011  |   1506.263   379.3005     3.97   0.000     762.5818    2249.945
         2012  |   1210.122   331.6273     3.65   0.000     559.9113    1860.332
         2013  |    921.138   255.9883     3.60   0.000     419.2305    1423.046
         2014  |   152.6957   168.2914     0.91   0.364    -177.2675    482.6588
         2015  |   201.0281   154.1813     1.30   0.192    -101.2698     503.326
         2016  |   250.7864     136.14     1.84   0.066    -16.13864    517.7115
         2017  |          0  (omitted)
               |
         _cons |  -9297.435   2016.552    -4.61   0.000    -13251.22   -5343.651
---------------+----------------------------------------------------------------
       sigma_u |   5959.177
       sigma_e |  3742.7672
           rho |  .71711877   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      6,718
Group variable: cusip_n                         Number of groups  =      1,457

R-sq:                                           Obs per group:
     within  = 0.0119                                         min =          1
     between = 0.0011                                         avg =        4.6
     overall = 0.0017                                         max =         10

                                                F(14,1456)        =       2.22
corr(u_i, Xb)  = -0.8340                        Prob > F          =     0.0057

                              (Std. Err. adjusted for 1,457 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   12.97547   5.752697     2.26   0.024     1.691013    24.25993
          dltt |  -.0035888   .0621741    -0.06   0.954    -.1255492    .1183717
            at |  -.0143545   .0069387    -2.07   0.039    -.0279654   -.0007435
           age |   136.5046   66.95014     2.04   0.042     5.175568    267.8336
           emp |   .0100561   .0114953     0.87   0.382     -.012493    .0326053
           xad |  -.2497328   1.622399    -0.15   0.878    -3.432222    2.932757
               |
          year |
         2009  |   1138.052   777.7406     1.46   0.144    -387.5593    2663.664
         2010  |   1219.894   616.0433     1.98   0.048     11.46711    2428.322
         2011  |   286.4897   351.3031     0.82   0.415    -402.6245    975.6038
         2012  |   367.1385   320.0177     1.15   0.251    -260.6065    994.8836
         2013  |   80.61631   250.0085     0.32   0.747    -409.7991    571.0317
         2014  |  -146.6011   227.4498    -0.64   0.519    -592.7654    299.5633
         2015  |  -112.9266   187.1005    -0.60   0.546     -479.942    254.0887
         2016  |  -19.60372   150.4856    -0.13   0.896    -314.7955     275.588
         2017  |          0  (omitted)
               |
         _cons |   -4009.06   2065.029    -1.94   0.052    -8059.811    41.69071
---------------+----------------------------------------------------------------
       sigma_u |  3131.7735
       sigma_e |   3467.123
           rho |  .44931189   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      3,954
Group variable: cusip_n                         Number of groups  =        873

R-sq:                                           Obs per group:
     within  = 0.0237                                         min =          1
     between = 0.0007                                         avg =        4.5
     overall = 0.0014                                         max =         10

                                                F(15,872)         =       2.98
corr(u_i, Xb)  = -0.8975                        Prob > F          =     0.0001

                                (Std. Err. adjusted for 873 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   23.79845   9.266787     2.57   0.010     5.610638    41.98627
          dltt |   -.071467   .1124124    -0.64   0.525    -.2920974    .1491634
            at |  -.0239667   .0447994    -0.53   0.593    -.1118939    .0639604
           age |   278.6588   84.93216     3.28   0.001     111.9635    445.3542
           emp |   .0078421   .0114456     0.69   0.493    -.0146221    .0303063
           xad |  -1.030021   1.323608    -0.78   0.437    -3.627851     1.56781
           xrd |   1.017583   .6909472     1.47   0.141    -.3385308    2.373697
               |
          year |
         2009  |   2734.427   1093.367     2.50   0.013      588.488    4880.366
         2010  |   2404.747   884.9726     2.72   0.007     667.8215    4141.672
         2011  |   930.6732   351.9845     2.64   0.008     239.8375    1621.509
         2012  |   951.6887   416.1681     2.29   0.022     134.8804    1768.497
         2013  |   338.8165   273.7389     1.24   0.216    -198.4476    876.0807
         2014  |  -136.9229    282.905    -0.48   0.629    -692.1772    418.3314
         2015  |  -151.9151   256.4951    -0.59   0.554    -655.3349    351.5047
         2016  |  -108.8505   200.7404    -0.54   0.588    -502.8413    285.1403
         2017  |          0  (omitted)
               |
         _cons |  -8615.891   2695.358    -3.20   0.001    -13906.04   -3325.743
---------------+----------------------------------------------------------------
       sigma_u |  5074.8387
       sigma_e |  4204.3184
           rho |  .59299611   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

. 
. esttab enviro*, ///
>         keep(enviro_rtg_lym dltt at age emp xad xrd) ///
>         order(enviro_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE firmFE N N_g r2 aic, label("Year FEs" "Firm FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
enviro_rtg~m       -3.019           5.990           9.406***        9.888***        9.888***        10.09***        12.98*          23.80*  
                  (-1.11)          (1.71)          (3.30)          (3.41)          (3.41)          (3.48)          (2.26)          (2.57)   

dltt                                              -0.0430***      -0.0358***      -0.0358***      -0.0353***     -0.00359         -0.0715   
                                                 (-10.30)         (-5.52)         (-5.52)         (-5.46)         (-0.06)         (-0.64)   

at                                                               -0.00795        -0.00795        -0.00867         -0.0144*        -0.0240   
                                                                  (-1.42)         (-1.42)         (-1.55)         (-2.07)         (-0.53)   

age                                                                                 315.8***        311.2***        136.5*          278.7** 
                                                                                   (4.88)          (4.79)          (2.04)          (3.28)   

emp                                                                                               0.00953          0.0101         0.00784   
                                                                                                   (0.91)          (0.87)          (0.69)   

xad                                                                                                                -0.250          -1.030   
                                                                                                                  (-0.15)         (-0.78)   

xrd                                                                                                                                 1.018   
                                                                                                                                   (1.47)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes                             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16490           16490           16426           16426           16426           16291            6718            3954   
Firms                3415            3415            3404            3404            3404            3383            1457             873   
R^2             0.0000526          0.0158           0.102           0.103           0.103           0.103          0.0119          0.0237   
AIC              315885.9        315642.9        312983.6        312968.6        312968.6        310520.5        126950.5         76228.6   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Many xad and xrd ob
. 
end of do-file

. do "C:\Users\poggi005\AppData\Local\Temp\STD26d4_000000.tmp"

. esttab gov9, ///
>         keep(cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt at age emp xad xrd) ///
>         r2 ar2 aic
estimation result gov9 not found
r(111);

end of do-file

r(111);

. log close
      name:  <unnamed>
       log:  D:\Dropbox\papers\active\dissertation-csrhub\project\code/logs/20190123-yearly-analysis.txt
  log type:  text
 closed on:  23 Jan 2019, 11:10:48
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
