-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Dropbox\papers\active\dissertation-csrhub\project\code/logs/20190212-yearly-analysis.txt
  log type:  text
 opened on:  12 Feb 2019, 16:53:28

. 
. ///     LOAD DATA
> use data/csrhub-kld-cstat-year-level-with-treatment-variables.dta, clear

. 
. *       Clear estimates
. est clear

. 
. *       Drop 2017
. drop if year>=2017
(13,884 observations deleted)

. 
. /// SET PANEL
> encode cusip, gen(cusip_n)

. xtset cusip_n year, y
--Break--
r(1);

end of do-file

--Break--
r(1);

. log close
      name:  <unnamed>
       log:  C:\Dropbox\papers\active\dissertation-csrhub\project\code/logs/20190212-yearly-analysis.txt
  log type:  text
 closed on:  12 Feb 2019, 16:53:36
-------------------------------------------------------------------------------------------------------------------------
