----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Dropbox\papers\active\dissertation-csrhub\project\logs/20190122-yearly-analysis.txt
  log type:  text
 opened on:  22 Jan 2019, 15:41:42

. 
. ///     LOAD DATA
> use data/csrhub-kld-cstat-year-level-with-treatment-variables.dta, clear

. 
. /// SET PANEL
> encode cusip, gen(cusip_n)

. xtset cusip_n year, y
       panel variable:  cusip_n (unbalanced)
        time variable:  year, 1990 to 2018, but with gaps
                delta:  1 year

. 
. ///     GENERATE YEAR-ON-YEAR REVENUE CHANGE
> gen revt_yoy = revt - l.revt
(74,693 missing values generated)

. label var revt_yoy "Year-on-year change in revenue (revt)"

. 
. ///     KEEP VARIABLES IN REGRESSION MODELS TO REDUCE FILE SIZE
> keep cusip cusip_n year revt revt_yoy dltt at xad xrd emp age ///
>         over_rtg *rtg_lym

. 
. 
.         
.         
.         
.         
.         
.                                                 ***===========================***
.                                                 *       FIXED EFFECTS REGRESSION        *       
.                                                 ***===========================***       
. ***===========================***
. *       REVENUE LEVEL = F (CSRHUB)      *
. ***===========================***
. ///     CONTROL VARIABLE MODELS
> 
. ***     DV: Revenue (Level)
. *mark mark3
. *markout mark3 revt over_rtg dltt at xad xrd emp year
. 
. xtreg revt over_rtg, fe cluster(cusip_n)                                                                                /*      non-sig */

Fixed-effects (within) regression               Number of obs     =     19,816
Group variable: cusip_n                         Number of groups  =      3,673

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0132                                         avg =        5.4
     overall = 0.0130                                         max =         10

                                                F(1,3672)         =       0.81
corr(u_i, Xb)  = 0.1146                         Prob > F          =     0.3694

                            (Std. Err. adjusted for 3,673 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   8.215993   9.152477     0.90   0.369    -9.728447    26.16043
       _cons |    6123.36   472.3233    12.96   0.000     5197.318    7049.402
-------------+----------------------------------------------------------------
     sigma_u |  15532.368
     sigma_e |  5384.1819
         rho |  .89272869   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con1

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. xtreg revt over_rtg i.year, fe cluster(cusip_n)                                                                 /*      non-sig */

Fixed-effects (within) regression               Number of obs     =     19,816
Group variable: cusip_n                         Number of groups  =      3,673

R-sq:                                           Obs per group:
     within  = 0.0214                                         min =          1
     between = 0.0575                                         avg =        5.4
     overall = 0.0115                                         max =         10

                                                F(10,3672)        =      16.21
corr(u_i, Xb)  = -0.1491                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,673 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -7.711574   13.48909    -0.57   0.568    -34.15842    18.73527
             |
        year |
       2009  |  -1221.905   664.0215    -1.84   0.066    -2523.792    79.98222
       2010  |   413.0925   670.9539     0.62   0.538    -902.3866    1728.572
       2011  |   1379.388   683.3967     2.02   0.044     39.51306    2719.262
       2012  |    1667.07   788.2525     2.11   0.035     121.6144    3212.526
       2013  |   1896.674   827.9046     2.29   0.022     273.4758    3519.872
       2014  |   2188.401   859.9293     2.54   0.011     502.4152    3874.388
       2015  |   2022.174   903.2845     2.24   0.025     251.1851    3793.163
       2016  |   2113.648   919.9608     2.30   0.022     309.9634    3917.332
       2017  |   2491.881   914.6081     2.72   0.006     698.6908    4285.071
             |
       _cons |   5185.622   964.1799     5.38   0.000     3295.241    7076.003
-------------+----------------------------------------------------------------
     sigma_u |   15654.91
     sigma_e |  5327.9151
         rho |   .8961955   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con2

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt i.year, fe cluster(cusip_n)                                                    /*      non-sig */

Fixed-effects (within) regression               Number of obs     =     19,736
Group variable: cusip_n                         Number of groups  =      3,664

R-sq:                                           Obs per group:
     within  = 0.0583                                         min =          1
     between = 0.0303                                         avg =        5.4
     overall = 0.0340                                         max =         10

                                                F(11,3663)        =      17.64
corr(u_i, Xb)  = 0.0331                         Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,664 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   -19.1501   11.64656    -1.64   0.100    -41.98448    3.684285
        dltt |   .0420342   .0071661     5.87   0.000     .0279842    .0560841
             |
        year |
       2009  |  -1212.861   645.2859    -1.88   0.060    -2478.016    52.29411
       2010  |   184.5193   637.0373     0.29   0.772    -1064.464    1433.502
       2011  |   1152.838   651.8575     1.77   0.077    -125.2016    2430.878
       2012  |   1406.831   758.3615     1.86   0.064    -80.02166    2893.683
       2013  |   1690.069   807.0962     2.09   0.036      107.667    3272.472
       2014  |   1995.257   842.6632     2.37   0.018      343.122    3647.393
       2015  |   1778.798   882.0052     2.02   0.044     49.52846    3508.068
       2016  |   1850.293   897.3722     2.06   0.039     90.89398    3609.691
       2017  |   2179.773   886.8097     2.46   0.014     441.0836    3918.463
             |
       _cons |   5811.298   811.9522     7.16   0.000     4219.375    7403.221
-------------+----------------------------------------------------------------
     sigma_u |   15322.92
     sigma_e |  5237.7416
         rho |  .89538048   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con3

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at i.year, fe cluster(cusip_n)                                                 /*      sig     */

Fixed-effects (within) regression               Number of obs     =     19,736
Group variable: cusip_n                         Number of groups  =      3,664

R-sq:                                           Obs per group:
     within  = 0.1114                                         min =          1
     between = 0.1830                                         avg =        5.4
     overall = 0.1733                                         max =         10

                                                F(12,3663)        =      20.06
corr(u_i, Xb)  = -0.0310                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,664 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -23.95959    11.4073    -2.10   0.036    -46.32487   -1.594307
        dltt |  -.0294841   .0212673    -1.39   0.166     -.071181    .0122127
          at |   .0794305   .0237503     3.34   0.001     .0328655    .1259956
             |
        year |
       2009  |   -1524.49   641.8031    -2.38   0.018    -2782.816   -266.1627
       2010  |  -488.1386   629.1409    -0.78   0.438     -1721.64    745.3625
       2011  |   295.4268   629.8287     0.47   0.639    -939.4228    1530.276
       2012  |   402.8156   736.0563     0.55   0.584    -1040.305    1845.936
       2013  |   640.3766   783.0082     0.82   0.414    -894.7986    2175.552
       2014  |   893.8098   815.8265     1.10   0.273    -705.7092    2493.329
       2015  |   622.7553   851.0297     0.73   0.464    -1045.784    2291.294
       2016  |   629.9196   867.9634     0.73   0.468     -1071.82    2331.659
       2017  |   876.1937   856.7789     1.02   0.307    -803.6172    2556.005
             |
       _cons |   5697.143   787.0342     7.24   0.000     4154.075    7240.212
-------------+----------------------------------------------------------------
     sigma_u |  14060.579
     sigma_e |   5087.925
         rho |  .88421957   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con4

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at emp i.year, fe cluster(cusip_n)                                             /*      non-sig */

Fixed-effects (within) regression               Number of obs     =     19,553
Group variable: cusip_n                         Number of groups  =      3,638

R-sq:                                           Obs per group:
     within  = 0.2585                                         min =          1
     between = 0.5753                                         avg =        5.4
     overall = 0.5646                                         max =         10

                                                F(13,3637)        =      27.08
corr(u_i, Xb)  = -0.1368                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,638 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -10.15172   9.125061    -1.11   0.266    -28.04246    7.739027
        dltt |  -.0162158    .016863    -0.96   0.336    -.0492776    .0168461
          at |   .0622456   .0191342     3.25   0.001     .0247309    .0997603
         emp |   .2207727   .0468091     4.72   0.000      .128998    .3125475
             |
        year |
       2009  |  -1212.506   622.7152    -1.95   0.052    -2433.412    8.399249
       2010  |  -411.3382   596.9605    -0.69   0.491    -1581.749    759.0723
       2011  |   156.6275   585.5796     0.27   0.789    -991.4694    1304.724
       2012  |   130.5879   689.2683     0.19   0.850    -1220.803    1481.979
       2013  |   218.9764   729.2125     0.30   0.764     -1210.73    1648.682
       2014  |   356.0531   758.3628     0.47   0.639    -1130.805    1842.912
       2015  |   37.48095   799.2259     0.05   0.963    -1529.494    1604.456
       2016  |   23.79405   816.0531     0.03   0.977    -1576.173    1623.761
       2017  |   261.0683   808.2241     0.32   0.747    -1323.549    1845.686
             |
       _cons |   1862.807   1087.553     1.71   0.087    -269.4681    3995.082
-------------+----------------------------------------------------------------
     sigma_u |  10278.114
     sigma_e |  4670.0456
         rho |  .82887796   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con5

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at emp xad i.year, fe cluster(cusip_n)                                 /*      non-sig */

Fixed-effects (within) regression               Number of obs     =      7,980
Group variable: cusip_n                         Number of groups  =      1,575

R-sq:                                           Obs per group:
     within  = 0.4792                                         min =          1
     between = 0.7596                                         avg =        5.1
     overall = 0.7878                                         max =         10

                                                F(14,1574)        =      23.60
corr(u_i, Xb)  = 0.1640                         Prob > F          =     0.0000

                            (Std. Err. adjusted for 1,575 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -19.28929    18.3389    -1.05   0.293    -55.26053    16.68195
        dltt |   .2239822   .0597957     3.75   0.000     .1066947    .3412697
          at |   .0216072    .021885     0.99   0.324    -.0213197    .0645341
         emp |   .1340061   .0445281     3.01   0.003     .0466655    .2213466
         xad |   11.27971   2.320962     4.86   0.000     6.727213    15.83222
             |
        year |
       2009  |   395.3783   723.5554     0.55   0.585    -1023.855    1814.612
       2010  |   1122.171   677.1351     1.66   0.098    -206.0109    2450.353
       2011  |   1719.982   679.8473     2.53   0.012     386.4806    3053.484
       2012  |   1854.993   715.2659     2.59   0.010     452.0183    3257.967
       2013  |    2069.34   794.3679     2.61   0.009     511.2091     3627.47
       2014  |   2141.277   816.8157     2.62   0.009     539.1159    3743.438
       2015  |   2027.031   795.3437     2.55   0.011     466.9861    3587.075
       2016  |   2013.557   761.7179     2.64   0.008     519.4686    3507.646
       2017  |   2073.469   750.8201     2.76   0.006     600.7562    3546.182
             |
       _cons |  -121.7204   1177.975    -0.10   0.918    -2432.285    2188.844
-------------+----------------------------------------------------------------
     sigma_u |  9003.8665
     sigma_e |  3491.7425
         rho |   .8692685   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con6

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at emp xad xrd i.year, fe cluster(cusip_n)                             /*      non-sig */

Fixed-effects (within) regression               Number of obs     =      4,650
Group variable: cusip_n                         Number of groups  =        928

R-sq:                                           Obs per group:
     within  = 0.6649                                         min =          1
     between = 0.8619                                         avg =        5.0
     overall = 0.8761                                         max =         10

                                                F(15,927)         =      12.73
corr(u_i, Xb)  = 0.4423                         Prob > F          =     0.0000

                              (Std. Err. adjusted for 928 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -41.11178   23.73924    -1.73   0.084    -87.70066    5.477103
        dltt |  -.4795382   .2354681    -2.04   0.042    -.9416505   -.0174259
          at |   .5103574   .1642739     3.11   0.002     .1879655    .8327493
         emp |     .09675   .0461174     2.10   0.036     .0062435    .1872566
         xad |   3.754353   2.376474     1.58   0.114    -.9095403    8.418246
         xrd |   .7643147   1.048184     0.73   0.466    -1.292773    2.821403
             |
        year |
       2009  |  -1511.188    963.473    -1.57   0.117    -3402.029    379.6531
       2010  |  -684.6548   764.7263    -0.90   0.371     -2185.45    816.1406
       2011  |   -11.9185   698.4746    -0.02   0.986    -1382.693    1358.856
       2012  |  -21.63107   765.8373    -0.03   0.977    -1524.607    1481.345
       2013  |   382.0979   848.7598     0.45   0.653    -1283.616    2047.811
       2014  |   542.7697   889.3181     0.61   0.542    -1202.541     2288.08
       2015  |   255.4093   858.9047     0.30   0.766    -1430.214    1941.032
       2016  |   158.2844   868.4368     0.18   0.855    -1546.046    1862.615
       2017  |   10.67318   857.0574     0.01   0.990    -1671.325    1692.671
             |
       _cons |   2876.228   1555.929     1.85   0.065    -177.3238     5929.78
-------------+----------------------------------------------------------------
     sigma_u |  8717.9689
     sigma_e |  3434.8048
         rho |  .86562907   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con7

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. xtreg revt over_rtg dltt at emp xad xrd age i.year, fe cluster(cusip_n)                         /*      non-sig */
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,650
Group variable: cusip_n                         Number of groups  =        928

R-sq:                                           Obs per group:
     within  = 0.6649                                         min =          1
     between = 0.8619                                         avg =        5.0
     overall = 0.8761                                         max =         10

                                                F(15,927)         =      12.73
corr(u_i, Xb)  = 0.4418                         Prob > F          =     0.0000

                              (Std. Err. adjusted for 928 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -41.11178   23.73924    -1.73   0.084    -87.70066    5.477103
        dltt |  -.4795382   .2354681    -2.04   0.042    -.9416505   -.0174259
          at |   .5103574   .1642739     3.11   0.002     .1879655    .8327493
         emp |     .09675   .0461174     2.10   0.036     .0062435    .1872566
         xad |   3.754353   2.376474     1.58   0.114    -.9095403    8.418246
         xrd |   .7643147   1.048184     0.73   0.466    -1.292773    2.821403
         age |   1.185909    95.2286     0.01   0.990    -185.7027    188.0746
             |
        year |
       2009  |  -1512.374   886.5853    -1.71   0.088    -3252.321    227.5731
       2010  |  -687.0267   593.0822    -1.16   0.247    -1850.966    476.9127
       2011  |  -15.47622   432.2097    -0.04   0.971    -863.6991    832.7467
       2012  |   -26.3747   402.8861    -0.07   0.948    -817.0493    764.2999
       2013  |   376.1683   430.2299     0.87   0.382    -468.1692    1220.506
       2014  |   535.6542   406.0501     1.32   0.187    -261.2299    1332.538
       2015  |    247.108    267.187     0.92   0.355    -277.2535    771.4695
       2016  |   148.7971   149.2449     1.00   0.319    -144.0999    441.6941
       2017  |          0  (omitted)
             |
       _cons |    2852.86   2958.272     0.96   0.335    -2952.826    8658.546
-------------+----------------------------------------------------------------
     sigma_u |  8715.3321
     sigma_e |  3434.8048
         rho |  .86555868   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con8

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & over_rtg!=.                                                                                   /*      assumption      */
(43,211 real changes made)

. replace xrd=0 if xrd==. & over_rtg!=.                                                                                   /*      assumption      */
(41,111 real changes made)

. 
. xtreg revt over_rtg dltt at emp xad xrd age i.year, fe cluster(cusip_n)                         /*      non-sig */
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     19,553
Group variable: cusip_n                         Number of groups  =      3,638

R-sq:                                           Obs per group:
     within  = 0.3000                                         min =          1
     between = 0.6159                                         avg =        5.4
     overall = 0.6031                                         max =         10

                                                F(15,3637)        =      27.04
corr(u_i, Xb)  = 0.0461                         Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,638 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
        revt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -12.99418   9.145914    -1.42   0.155    -30.92581    4.937447
        dltt |  -.0113777   .0145815    -0.78   0.435    -.0399664    .0172109
          at |    .056222    .016214     3.47   0.001     .0244326    .0880114
         emp |   .1740904   .0448737     3.88   0.000     .0861103    .2620706
         xad |   2.202605   1.291851     1.70   0.088    -.3302186     4.73543
         xrd |   4.049164    1.69977     2.38   0.017     .7165676     7.38176
         age |  -.1285394   89.01685    -0.00   0.999    -174.6564    174.3994
             |
        year |
       2009  |  -1187.096   534.0927    -2.22   0.026    -2234.247   -139.9455
       2010  |  -482.9422    423.691    -1.14   0.254    -1313.638    347.7533
       2011  |   45.61858   331.5897     0.14   0.891    -604.5017    695.7389
       2012  |  -3.730146   344.8535    -0.01   0.991    -679.8557    672.3954
       2013  |    90.0692   305.0357     0.30   0.768    -507.9889    688.1273
       2014  |   208.1249   250.0845     0.83   0.405    -282.1948    698.4446
       2015  |  -144.8699    191.204    -0.76   0.449    -519.7477    230.0078
       2016  |  -187.9356     110.31    -1.70   0.089    -404.2113    28.34008
       2017  |          0  (omitted)
             |
       _cons |    2422.07   2422.485     1.00   0.317    -2327.493    7171.633
-------------+----------------------------------------------------------------
     sigma_u |  9679.5271
     sigma_e |  4537.6373
         rho |  .81983252   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store con9

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore

. 
. esttab con1 con2 con3 con4 con5 con6 con7 con8 con9, ///
>         b se s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC")) ///
>         keep(over_rtg dltt at xad xrd emp age)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
                     revt            revt            revt            revt            revt            revt            revt            revt            revt   
------------------------------------------------------------------------------------------------------------------------------------------------------------
over_rtg            8.216          -7.712          -19.15          -23.96*         -10.15          -19.29          -41.11          -41.11          -12.99   
                  (9.152)         (13.49)         (11.65)         (11.41)         (9.125)         (18.34)         (23.74)         (23.74)         (9.146)   

dltt                                               0.0420***      -0.0295         -0.0162           0.224***       -0.480*         -0.480*        -0.0114   
                                                (0.00717)        (0.0213)        (0.0169)        (0.0598)         (0.235)         (0.235)        (0.0146)   

at                                                                 0.0794***       0.0622**        0.0216           0.510**         0.510**        0.0562***
                                                                 (0.0238)        (0.0191)        (0.0219)         (0.164)         (0.164)        (0.0162)   

emp                                                                                 0.221***        0.134**        0.0968*         0.0968*          0.174***
                                                                                 (0.0468)        (0.0445)        (0.0461)        (0.0461)        (0.0449)   

xad                                                                                                 11.28***        3.754           3.754           2.203   
                                                                                                  (2.321)         (2.376)         (2.376)         (1.292)   

xrd                                                                                                                 0.764           0.764           4.049*  
                                                                                                                  (1.048)         (1.048)         (1.700)   

age                                                                                                                                 1.186          -0.129   
                                                                                                                                  (95.23)         (89.02)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        19816           19816           19736           19736           19553            7980            4650            4650           19553   
Firms                3673            3673            3664            3664            3638            1575             928             928            3638   
R^2             0.0000616          0.0214          0.0583           0.111           0.258           0.479           0.665           0.665           0.300   
AIC              392661.1        392251.7        389988.0        388843.2        381877.3        151106.5         87890.2         87890.2        380754.1   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
.         
. 
.         
. *** Loop to run regression models
. 
. 
.         
.         
.         
. ***===============================***
. *       REVENUE CHANGE = F (CSRHUB)     *
. ***===============================***   
. /// DV: Revenue (1-year change)
> local dv revt_yoy

. local iv over_rtg 

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,468
Group variable: cusip_n                         Number of groups  =      3,393

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0007                                         avg =        4.9
     overall = 0.0001                                         max =         10

                                                F(1,3392)         =       0.89
corr(u_i, Xb)  = -0.0079                        Prob > F          =     0.3449

                            (Std. Err. adjusted for 3,393 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -7.394739   7.828646    -0.94   0.345    -22.74408    7.954602
       _cons |    597.926   407.5567     1.47   0.142    -201.1555    1397.008
-------------+----------------------------------------------------------------
     sigma_u |  1298.1456
     sigma_e |  3925.1113
         rho |  .09859663   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store reg0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,468
Group variable: cusip_n                         Number of groups  =      3,393

R-sq:                                           Obs per group:
     within  = 0.0159                                         min =          1
     between = 0.0014                                         avg =        4.9
     overall = 0.0130                                         max =         10

                                                F(10,3392)        =       5.46
corr(u_i, Xb)  = -0.0153                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,393 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   14.78995   10.22059     1.45   0.148    -5.249188    34.82909
             |
        year |
       2009  |   3039.497     734.71     4.14   0.000     1598.978    4480.016
       2010  |    2850.19   702.0333     4.06   0.000     1473.739    4226.641
       2011  |   2186.465   560.9767     3.90   0.000     1086.578    3286.351
       2012  |   2170.154   581.7837     3.73   0.000     1029.472    3310.836
       2013  |   2234.871   562.1848     3.98   0.000     1132.616    3337.126
       2014  |   1753.317   513.9335     3.41   0.001     745.6662    2760.967
       2015  |   2061.204   559.5535     3.68   0.000     964.1075      3158.3
       2016  |   2418.049   593.8925     4.07   0.000     1253.625    3582.472
       2017  |   2529.427   583.4674     4.34   0.000     1385.444    3673.411
             |
       _cons |  -2743.427   871.9717    -3.15   0.002     -4453.07   -1033.784
-------------+----------------------------------------------------------------
     sigma_u |  1306.0064
     sigma_e |  3895.3237
         rho |  .10105057   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store reg1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store reg`counter'
  4.         estadd local yearFE "Yes", replace
  5.         
.         *       Increment
.         local vars "`vars' `control'"
  6.         local counter = `counter' + 1
  7. }

Fixed-effects (within) regression               Number of obs     =     16,404
Group variable: cusip_n                         Number of groups  =      3,382

R-sq:                                           Obs per group:
     within  = 0.1022                                         min =          1
     between = 0.0237                                         avg =        4.9
     overall = 0.0012                                         max =         10

                                                F(11,3381)        =      16.50
corr(u_i, Xb)  = -0.8560                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,382 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   27.10384   7.045693     3.85   0.000     13.28959    40.91809
        dltt |  -.0431331   .0041387   -10.42   0.000    -.0512477   -.0350184
             |
        year |
       2009  |   3025.321   727.7606     4.16   0.000     1598.426    4452.216
       2010  |   3088.873   698.6971     4.42   0.000     1718.961    4458.784
       2011  |   2421.959   557.2645     4.35   0.000     1329.349    3514.568
       2012  |   2439.262   576.9778     4.23   0.000     1308.001    3570.523
       2013  |   2446.145   561.3304     4.36   0.000     1345.564    3546.727
       2014  |   1946.529   515.5283     3.78   0.000     935.7506    2957.308
       2015  |   2311.924   559.4163     4.13   0.000     1215.096    3408.753
       2016  |    2687.76   594.0225     4.52   0.000      1523.08     3852.44
       2017  |   2838.449   582.1593     4.88   0.000     1697.029    3979.869
             |
       _cons |  -3376.187   761.4421    -4.43   0.000     -4869.12   -1883.253
-------------+----------------------------------------------------------------
     sigma_u |  2897.2942
     sigma_e |  3728.2447
         rho |  .37652587   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     16,404
Group variable: cusip_n                         Number of groups  =      3,382

R-sq:                                           Obs per group:
     within  = 0.1031                                         min =          1
     between = 0.0241                                         avg =        4.9
     overall = 0.0007                                         max =         10

                                                F(12,3381)        =      14.88
corr(u_i, Xb)  = -0.8770                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,382 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   27.39178   7.098092     3.86   0.000     13.47479    41.30876
        dltt |  -.0360327    .006435    -5.60   0.000    -.0486496   -.0234158
          at |  -.0078821   .0055854    -1.41   0.158    -.0188333     .003069
             |
        year |
       2009  |   3053.445   729.6876     4.18   0.000     1622.771    4484.118
       2010  |   3150.899   705.6047     4.47   0.000     1767.444    4534.354
       2011  |   2501.859   563.2829     4.44   0.000      1397.45    3606.269
       2012  |   2532.943   585.3239     4.33   0.000     1385.318    3680.567
       2013  |   2545.091   569.4392     4.47   0.000     1428.611    3661.571
       2014  |   2051.501   524.3964     3.91   0.000     1023.334    3079.667
       2015  |   2421.484   568.3237     4.26   0.000     1307.191    3535.777
       2016  |   2803.301   605.1599     4.63   0.000     1616.785    3989.818
       2017  |   2944.484    592.248     4.97   0.000     1783.284    4105.685
             |
       _cons |  -3338.789   756.1417    -4.42   0.000     -4821.33   -1856.247
-------------+----------------------------------------------------------------
     sigma_u |  3110.1858
     sigma_e |  3726.4868
         rho |  .41058032   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,404
Group variable: cusip_n                         Number of groups  =      3,382

R-sq:                                           Obs per group:
     within  = 0.1031                                         min =          1
     between = 0.0047                                         avg =        4.9
     overall = 0.0001                                         max =         10

                                                F(12,3381)        =      14.88
corr(u_i, Xb)  = -0.9597                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,382 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   27.39178   7.098092     3.86   0.000     13.47479    41.30876
        dltt |  -.0360327    .006435    -5.60   0.000    -.0486496   -.0234158
          at |  -.0078821   .0055854    -1.41   0.158    -.0188333     .003069
         age |   327.1649   65.80533     4.97   0.000     198.1426    456.1872
             |
        year |
       2009  |    2726.28    666.258     4.09   0.000      1419.97    4032.589
       2010  |    2496.57   578.1611     4.32   0.000     1362.989     3630.15
       2011  |   1520.365   378.5451     4.02   0.000     778.1643    2262.565
       2012  |   1224.283    331.236     3.70   0.000     574.8399    1873.726
       2013  |    909.266   256.0973     3.55   0.000     407.1449    1411.387
       2014  |   88.51111   170.4269     0.52   0.604     -245.639    422.6612
       2015  |   131.3297   152.0629     0.86   0.388    -166.8148    429.4743
       2016  |    185.982    133.671     1.39   0.164    -76.10212    448.0662
       2017  |          0  (omitted)
             |
       _cons |  -10433.34   2130.467    -4.90   0.000    -14610.48   -6256.211
-------------+----------------------------------------------------------------
     sigma_u |  6125.5576
     sigma_e |  3726.4868
         rho |   .7298788   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,269
Group variable: cusip_n                         Number of groups  =      3,361

R-sq:                                           Obs per group:
     within  = 0.1036                                         min =          1
     between = 0.0026                                         avg =        4.8
     overall = 0.0004                                         max =         10

                                                F(13,3360)        =      14.15
corr(u_i, Xb)  = -0.9598                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,361 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |    28.3589   7.044053     4.03   0.000     14.54783    42.16996
        dltt |  -.0354493    .006397    -5.54   0.000    -.0479917   -.0229068
          at |  -.0086297   .0055648    -1.55   0.121    -.0195404     .002281
         age |   322.9155   66.10172     4.89   0.000     193.3118    452.5192
         emp |    .009931   .0104384     0.95   0.341    -.0105354    .0303973
             |
        year |
       2009  |   2747.355   669.3242     4.10   0.000     1435.031    4059.679
       2010  |   2512.783   581.0247     4.32   0.000     1373.585    3651.981
       2011  |   1530.273   380.2187     4.02   0.000     784.7899    2275.757
       2012  |   1231.863   332.5022     3.70   0.000     579.9358     1883.79
       2013  |   912.5564   256.8136     3.55   0.000     409.0296    1416.083
       2014  |   86.52546   170.4728     0.51   0.612    -247.7156    420.7665
       2015  |   133.0713   152.0972     0.87   0.382    -165.1412    431.2838
       2016  |   194.4508   133.9751     1.45   0.147    -68.23025    457.1318
       2017  |          0  (omitted)
             |
       _cons |  -10565.98   2145.445    -4.92   0.000    -14772.49   -6359.468
-------------+----------------------------------------------------------------
     sigma_u |   6147.898
     sigma_e |  3741.5342
         rho |  .72972523   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      6,704
Group variable: cusip_n                         Number of groups  =      1,443

R-sq:                                           Obs per group:
     within  = 0.0131                                         min =          1
     between = 0.0011                                         avg =        4.6
     overall = 0.0019                                         max =         10

                                                F(14,1442)        =       2.47
corr(u_i, Xb)  = -0.8475                        Prob > F          =     0.0019

                            (Std. Err. adjusted for 1,443 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   36.54266   14.07654     2.60   0.010      8.92998    64.15535
        dltt |  -.0034632   .0618835    -0.06   0.955    -.1248546    .1179281
          at |  -.0141642   .0068963    -2.05   0.040     -.027692   -.0006363
         age |   148.5521   67.82815     2.19   0.029     15.49973    281.6045
         emp |   .0106291   .0114989     0.92   0.355    -.0119273    .0331856
         xad |  -.2617025   1.618492    -0.16   0.872    -3.436553    2.913148
             |
        year |
       2009  |   1166.009   781.7418     1.49   0.136    -367.4635    2699.482
       2010  |   1247.467   619.2567     2.01   0.044     32.72653    2462.207
       2011  |   297.7729   349.3791     0.85   0.394    -387.5728    983.1187
       2012  |   385.1568   317.7576     1.21   0.226    -238.1598    1008.473
       2013  |   60.48451   255.1218     0.24   0.813     -439.965     560.934
       2014  |  -235.5539   242.1344    -0.97   0.331    -710.5272    239.4194
       2015  |  -200.1748   191.6125    -1.04   0.296    -576.0439    175.6943
       2016  |  -88.53494   152.6707    -0.58   0.562    -388.0153    210.9454
       2017  |          0  (omitted)
             |
       _cons |  -5558.395   2246.528    -2.47   0.013    -9965.207   -1151.582
-------------+----------------------------------------------------------------
     sigma_u |  3279.7001
     sigma_e |  3464.9347
         rho |   .4725567   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      3,946
Group variable: cusip_n                         Number of groups  =        865

R-sq:                                           Obs per group:
     within  = 0.0246                                         min =          1
     between = 0.0006                                         avg =        4.6
     overall = 0.0014                                         max =         10

                                                F(15,864)         =       3.10
corr(u_i, Xb)  = -0.9084                        Prob > F          =     0.0001

                              (Std. Err. adjusted for 865 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |    50.5089   21.39721     2.36   0.018     8.512308     92.5055
        dltt |  -.0685147   .1119247    -0.61   0.541    -.2881908    .1511613
          at |  -.0241862   .0443638    -0.55   0.586    -.1112597    .0628873
         age |   295.1267   88.82344     3.32   0.001     120.7917    469.4616
         emp |   .0085148   .0114569     0.74   0.458    -.0139718    .0310014
         xad |  -1.088314   1.325453    -0.82   0.412    -3.689798     1.51317
         xrd |   1.028289   .6932208     1.48   0.138    -.3323047    2.388883
             |
        year |
       2009  |   2762.598   1104.787     2.50   0.013     594.2175    4930.979
       2010  |   2460.728   903.3888     2.72   0.007     687.6348    4233.822
       2011  |   971.7877   351.5182     2.76   0.006     281.8581    1661.717
       2012  |   970.0817   425.1908     2.28   0.023     135.5539     1804.61
       2013  |   374.1839   273.9362     1.37   0.172    -163.4744    911.8422
       2014  |  -194.6249   287.1866    -0.68   0.498    -758.2898      369.04
       2015  |  -258.9164   250.6313    -1.03   0.302    -750.8338     233.001
       2016  |  -190.1462   197.6498    -0.96   0.336    -578.0762    197.7837
       2017  |          0  (omitted)
             |
       _cons |     -10477   3299.329    -3.18   0.002    -16952.63   -4001.358
-------------+----------------------------------------------------------------
     sigma_u |  5358.6812
     sigma_e |  4202.4638
         rho |  .61918582   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

. 
. esttab reg*, ///
>         keep(over_rtg dltt at age emp xad xrd) ///
>         order(over_rtg dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
over_rtg           -7.395           14.79           27.10***        27.39***        27.39***        28.36***        36.54**         50.51*  
                  (-0.94)          (1.45)          (3.85)          (3.86)          (3.86)          (4.03)          (2.60)          (2.36)   

dltt                                              -0.0431***      -0.0360***      -0.0360***      -0.0354***     -0.00346         -0.0685   
                                                 (-10.42)         (-5.60)         (-5.60)         (-5.54)         (-0.06)         (-0.61)   

at                                                               -0.00788        -0.00788        -0.00863         -0.0142*        -0.0242   
                                                                  (-1.41)         (-1.41)         (-1.55)         (-2.05)         (-0.55)   

age                                                                                 327.2***        322.9***        148.6*          295.1***
                                                                                   (4.97)          (4.89)          (2.19)          (3.32)   

emp                                                                                               0.00993          0.0106         0.00851   
                                                                                                   (0.95)          (0.92)          (0.74)   

xad                                                                                                                -0.262          -1.088   
                                                                                                                  (-0.16)         (-0.82)   

xrd                                                                                                                                 1.028   
                                                                                                                                   (1.48)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16468           16468           16404           16404           16404           16269            6704            3946   
Firms                3393            3393            3382            3382            3382            3361            1443             865   
R^2             0.0000917          0.0159           0.102           0.103           0.103           0.104          0.0131          0.0246   
AIC              315485.8        315241.5        312576.1        312561.4        312561.4        310112.4        126691.5         76078.9   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & over_rtg!=.                                                                                   /*      assumption      */
(43,211 real changes made)

. replace xrd=0 if xrd==. & over_rtg!=.                                                                                   /*      assumption      */
(41,111 real changes made)

. 
. xtreg F.revt_yoy over_rtg dltt at age emp xad xrd i.year, fe cluster(cusip_n)   
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,269
Group variable: cusip_n                         Number of groups  =      3,361

R-sq:                                           Obs per group:
     within  = 0.1040                                         min =          1
     between = 0.0028                                         avg =        4.8
     overall = 0.0003                                         max =         10

                                                F(15,3360)        =      12.64
corr(u_i, Xb)  = -0.9594                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,361 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |     28.191   7.015598     4.02   0.000     14.43572    41.94627
        dltt |   -.035417    .006459    -5.48   0.000    -.0480809    -.022753
          at |  -.0087072    .005669    -1.54   0.125    -.0198223    .0024078
         age |   321.2639   66.32079     4.84   0.000     191.2307    451.2971
         emp |   .0098136   .0082305     1.19   0.233    -.0063237    .0259509
         xad |  -.6747043   .5548584    -1.22   0.224    -1.762599      .41319
         xrd |   .2748291   .5794911     0.47   0.635    -.8613618     1.41102
             |
        year |
       2009  |   2739.377   668.5953     4.10   0.000     1428.482    4050.272
       2010  |   2508.238   580.8678     4.32   0.000     1369.348    3647.128
       2011  |   1528.117   380.2121     4.02   0.000     782.6466    2273.588
       2012  |   1230.227   332.3788     3.70   0.000     578.5417    1881.912
       2013  |    915.223   256.3533     3.57   0.000     412.5988    1417.847
       2014  |   90.67451   169.6087     0.53   0.593    -241.8722    423.2212
       2015  |    138.674   151.1958     0.92   0.359    -157.7712    435.1192
       2016  |   199.0137   132.3247     1.50   0.133    -60.43128    458.4588
       2017  |          0  (omitted)
             |
       _cons |  -10494.72   2143.112    -4.90   0.000    -14696.65   -6292.781
-------------+----------------------------------------------------------------
     sigma_u |  6121.4859
     sigma_e |  3740.9852
         rho |  .72808172   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store as1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore 

. 
. *       Assume missing xad and xrd are 0, interact over_rtg and revt, 
. *       all independent variables lagged
. preserve

. replace xad=0 if xad==. & over_rtg!=.                                                                                   /*      assumption      */
(43,211 real changes made)

. replace xrd=0 if xrd==. & over_rtg!=.                                                                                   /*      assumption      */
(41,111 real changes made)

. 
. xtreg F.revt_yoy c.over_rtg##c.revt dltt at age emp xad xrd i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,269
Group variable: cusip_n                         Number of groups  =      3,361

R-sq:                                           Obs per group:
     within  = 0.2586                                         min =          1
     between = 0.0000                                         avg =        4.8
     overall = 0.0102                                         max =         10

                                                F(17,3360)        =      18.65
corr(u_i, Xb)  = -0.9504                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 3,361 clusters in cusip_n)
-----------------------------------------------------------------------------------
                  |               Robust
       F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
         over_rtg |   32.35179   14.96575     2.16   0.031      3.00888     61.6947
             revt |  -.2622536   .1171247    -2.24   0.025    -.4918966   -.0326107
                  |
c.over_rtg#c.revt |  -.0012966   .0021343    -0.61   0.544    -.0054813    .0028881
                  |
             dltt |  -.0380674    .007554    -5.04   0.000    -.0528783   -.0232564
               at |   .0090487   .0063564     1.42   0.155    -.0034141    .0215115
              age |   323.1012   45.34054     7.13   0.000     234.2034    411.9991
              emp |   .0728085    .019833     3.67   0.000     .0339226    .1116945
              xad |   .2119361   .5433805     0.39   0.697    -.8534539    1.277326
              xrd |    1.75067   .4883706     3.58   0.000     .7931363    2.708204
                  |
             year |
            2009  |   2272.318   445.7855     5.10   0.000     1398.279    3146.356
            2010  |   2273.526   430.0682     5.29   0.000     1430.304    3116.748
            2011  |   1441.975   276.2543     5.22   0.000     900.3311    1983.618
            2012  |    1125.62   238.8797     4.71   0.000     657.2558    1593.985
            2013  |   817.8283   173.6131     4.71   0.000     477.4303    1158.226
            2014  |   7.144167   156.1397     0.05   0.964    -298.9942    313.2826
            2015  |  -44.24194   125.2463    -0.35   0.724    -289.8086    201.3247
            2016  |   15.04169   120.9758     0.12   0.901    -222.1519    252.2353
            2017  |          0  (omitted)
                  |
            _cons |  -10130.33   1807.161    -5.61   0.000    -13673.58   -6587.085
------------------+----------------------------------------------------------------
          sigma_u |  6542.2015
          sigma_e |  3403.3572
              rho |  .78701453   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. est store int1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore

. 
. *       Assume missing xad and xrd are 0, interact over_rtg and revt, 
. *       all independent variables lagged, and standardized revt and over_rtg
. preserve

. replace xad=0 if xad==. & over_rtg!=.                                                                                   /*      assumption      */
(43,211 real changes made)

. replace xrd=0 if xrd==. & over_rtg!=.                                                                                   /*      assumption      */
(41,111 real changes made)

. 
. egen Sover_rtg = std(over_rtg)
(126629 missing values generated)

. egen Srevt = std(revt)
(67607 missing values generated)

. 
. xtreg F.revt_yoy c.Sover_rtg##c.Srevt dltt at emp xad xrd age i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,269
Group variable: cusip_n                         Number of groups  =      3,361

R-sq:                                           Obs per group:
     within  = 0.2586                                         min =          1
     between = 0.0000                                         avg =        4.8
     overall = 0.0102                                         max =         10

                                                F(17,3360)        =      18.65
corr(u_i, Xb)  = -0.9504                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 3,361 clusters in cusip_n)
-------------------------------------------------------------------------------------
                    |               Robust
         F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          Sover_rtg |   214.6284   72.36713     2.97   0.003     72.74029    356.5165
              Srevt |  -4838.567   626.1738    -7.73   0.000    -6066.288   -3610.847
                    |
c.Sover_rtg#c.Srevt |  -147.7039   243.1308    -0.61   0.544    -624.4032    328.9954
                    |
               dltt |  -.0380674    .007554    -5.04   0.000    -.0528783   -.0232564
                 at |   .0090487   .0063564     1.42   0.155    -.0034141    .0215115
                emp |   .0728085    .019833     3.67   0.000     .0339226    .1116945
                xad |   .2119361   .5433805     0.39   0.697     -.853454    1.277326
                xrd |    1.75067   .4883707     3.58   0.000     .7931363    2.708204
                age |   323.1012   45.34054     7.13   0.000     234.2034    411.9991
                    |
               year |
              2009  |   2272.318   445.7855     5.10   0.000     1398.279    3146.356
              2010  |   2273.526   430.0682     5.29   0.000     1430.304    3116.748
              2011  |   1441.975   276.2543     5.22   0.000     900.3311    1983.618
              2012  |    1125.62   238.8797     4.71   0.000     657.2558    1593.985
              2013  |   817.8283   173.6131     4.71   0.000     477.4303    1158.226
              2014  |   7.144192   156.1397     0.05   0.964    -298.9942    313.2826
              2015  |  -44.24194   125.2463    -0.35   0.724    -289.8085    201.3247
              2016  |    15.0417   120.9758     0.12   0.901    -222.1519    252.2353
              2017  |          0  (omitted)
                    |
              _cons |  -9642.928   1438.011    -6.71   0.000    -12462.39   -6823.463
--------------------+----------------------------------------------------------------
            sigma_u |  6542.2015
            sigma_e |  3403.3572
                rho |  .78701453   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. est store int2

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore

. 
. esttab reg* as1, ///
>         keep(over_rtg dltt at age emp xad xrd) ///
>         order(over_rtg dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
over_rtg           -7.395           14.79           27.10***        27.39***        27.39***        28.36***        36.54**         50.51*          28.19***
                  (-0.94)          (1.45)          (3.85)          (3.86)          (3.86)          (4.03)          (2.60)          (2.36)          (4.02)   

dltt                                              -0.0431***      -0.0360***      -0.0360***      -0.0354***     -0.00346         -0.0685         -0.0354***
                                                 (-10.42)         (-5.60)         (-5.60)         (-5.54)         (-0.06)         (-0.61)         (-5.48)   

at                                                               -0.00788        -0.00788        -0.00863         -0.0142*        -0.0242        -0.00871   
                                                                  (-1.41)         (-1.41)         (-1.55)         (-2.05)         (-0.55)         (-1.54)   

age                                                                                 327.2***        322.9***        148.6*          295.1***        321.3***
                                                                                   (4.97)          (4.89)          (2.19)          (3.32)          (4.84)   

emp                                                                                               0.00993          0.0106         0.00851         0.00981   
                                                                                                   (0.95)          (0.92)          (0.74)          (1.19)   

xad                                                                                                                -0.262          -1.088          -0.675   
                                                                                                                  (-0.16)         (-0.82)         (-1.22)   

xrd                                                                                                                                 1.028           0.275   
                                                                                                                                   (1.48)          (0.47)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16468           16468           16404           16404           16404           16269            6704            3946           16269   
Firms                3393            3393            3382            3382            3382            3361            1443             865            3361   
R^2             0.0000917          0.0159           0.102           0.103           0.103           0.104          0.0131          0.0246           0.104   
AIC              315485.8        315241.5        312576.1        312561.4        312561.4        310112.4        126691.5         76078.9        310109.1   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

.         
. esttab int1 int2, ///
>         keep(over_rtg revt c.over_rtg* Sover_rtg Srevt c.Sover_rtg* dltt at age emp xad xrd) ///
>         order(over_rtg revt c.over_rtg* Sover_rtg Srevt c.Sover_rtg* dltt at age emp xad xrd) ///
>         r2 ar2 aic

--------------------------------------------
                      (1)             (2)   
               F.revt_yoy      F.revt_yoy   
--------------------------------------------
over_rtg            32.35*                  
                   (2.16)                   

revt               -0.262*                  
                  (-2.24)                   

c.over_rtg~t     -0.00130                   
                  (-0.61)                   

Sover_rtg                           214.6** 
                                   (2.97)   

Srevt                             -4838.6***
                                  (-7.73)   

c.Sover_rt~t                       -147.7   
                                  (-0.61)   

dltt              -0.0381***      -0.0381***
                  (-5.04)         (-5.04)   

at                0.00905         0.00905   
                   (1.42)          (1.42)   

age                 323.1***        323.1***
                   (7.13)          (7.13)   

emp                0.0728***       0.0728***
                   (3.67)          (3.67)   

xad                 0.212           0.212   
                   (0.39)          (0.39)   

xrd                 1.751***        1.751***
                   (3.58)          (3.58)   
--------------------------------------------
N                   16269           16269   
R-sq                0.259           0.259   
adj. R-sq           0.258           0.258   
AIC              307033.0        307033.0   
--------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.         
. 
. /*
> ///     REVENUE = F (CSRHUB CATEGORIES)
>                 CSRHub CATEGORIES and subcategories:
>                         -       COMMUNITY
>                                 *       Community development and philanthropy
>                                 *       Product
>                                 *       Human rights and supply chain
>                         -       EMPLOYEES
>                                 *       Compensation and benefits
>                                 *       Diversity and labor rights
>                                 *       Training health and safety
>                         -       ENVIRONMENT
>                                 *       Energy and climate change
>                                 *       Environmental policy and reporting
>                                 *       Resource management
>                         -       GOVERNANCE
>                                 *       Board
>                                 *       Leadership ethics
>                                 *       Transparency and reporting
> */
. 
. ///     COMMUNITY
> est clear

. local dv revt_yoy

. local iv cmty_rtg_lym

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,230
Group variable: cusip_n                         Number of groups  =      3,931

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          1
     between = 0.0002                                         avg =        5.4
     overall = 0.0000                                         max =         10

                                                F(1,3930)         =       0.06
corr(u_i, Xb)  = -0.0156                        Prob > F          =     0.8134

                            (Std. Err. adjusted for 3,931 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   .6466296   2.739543     0.24   0.813    -4.724429    6.017688
       _cons |   133.9278   145.8052     0.92   0.358    -151.9332    419.7887
-------------+----------------------------------------------------------------
     sigma_u |  1155.0299
     sigma_e |   3526.318
         rho |  .09689106   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store cmty0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,230
Group variable: cusip_n                         Number of groups  =      3,931

R-sq:                                           Obs per group:
     within  = 0.0105                                         min =          1
     between = 0.0003                                         avg =        5.4
     overall = 0.0084                                         max =         10

                                                F(10,3930)        =       6.12
corr(u_i, Xb)  = -0.0134                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,931 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   4.263702   3.261315     1.31   0.191    -2.130326    10.65773
             |
        year |
       2009  |   1534.974   333.8148     4.60   0.000     880.5076    2189.441
       2010  |   1471.169   307.5094     4.78   0.000     868.2758    2074.062
       2011  |   1011.623   224.0699     4.51   0.000     572.3182    1450.927
       2012  |   998.5601   231.6205     4.31   0.000     544.4523    1452.668
       2013  |   1083.943   222.0101     4.88   0.000     648.6776    1519.209
       2014  |   689.9682   192.2696     3.59   0.000     313.0107    1066.926
       2015  |    914.784   217.5495     4.20   0.000     488.2635    1341.305
       2016  |   1243.915   243.1652     5.12   0.000     767.1737    1720.657
       2017  |   1301.881   237.7612     5.48   0.000     835.7338    1768.028
             |
       _cons |  -1080.386   335.3323    -3.22   0.001    -1737.828    -422.944
-------------+----------------------------------------------------------------
     sigma_u |  1160.5834
     sigma_e |   3508.716
         rho |  .09861983   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store cmty1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store cmty`counter'
  4.         estadd local yearFE "Yes", replace
  5.         
.         *       Increment
.         local vars "`vars' `control'"
  6.         local counter = `counter' + 1
  7. }

Fixed-effects (within) regression               Number of obs     =     21,145
Group variable: cusip_n                         Number of groups  =      3,923

R-sq:                                           Obs per group:
     within  = 0.0512                                         min =          1
     between = 0.0181                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(11,3922)        =      16.59
corr(u_i, Xb)  = -0.7171                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,923 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.493375   3.239373     2.31   0.021      1.14236    13.84439
        dltt |  -.0248217   .0024107   -10.30   0.000    -.0295479   -.0200954
             |
        year |
       2009  |   1558.795   338.7077     4.60   0.000     894.7351    2222.855
       2010  |   1586.961   314.4881     5.05   0.000      970.385    2203.536
       2011  |   1120.122   232.4589     4.82   0.000     664.3707    1575.874
       2012  |   1119.478   241.7741     4.63   0.000     645.4634    1593.493
       2013  |   1191.279   231.1577     5.15   0.000     738.0786     1644.48
       2014  |   800.8912   202.8199     3.95   0.000     403.2488    1198.534
       2015  |   1029.269   227.0674     4.53   0.000     584.0875     1474.45
       2016  |   1369.524   253.3701     5.41   0.000     872.7748    1866.274
       2017  |   1422.694   248.0288     5.74   0.000      936.417    1908.972
             |
       _cons |  -1248.519   355.2113    -3.51   0.000    -1944.935    -552.103
-------------+----------------------------------------------------------------
     sigma_u |  1775.1362
     sigma_e |  3443.4876
         rho |  .20995192   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     21,145
Group variable: cusip_n                         Number of groups  =      3,923

R-sq:                                           Obs per group:
     within  = 0.0512                                         min =          1
     between = 0.0181                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(12,3922)        =      15.86
corr(u_i, Xb)  = -0.7163                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,923 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.490232    3.32853     2.25   0.024     .9644188    14.01604
        dltt |  -.0249176   .0061631    -4.04   0.000    -.0370008   -.0128344
          at |   .0001074   .0065814     0.02   0.987    -.0127958    .0130106
             |
        year |
       2009  |   1558.655   341.2903     4.57   0.000      889.532    2227.779
       2010  |    1586.54   322.5156     4.92   0.000     954.2261    2218.854
       2011  |   1119.551   243.2961     4.60   0.000     642.5518     1596.55
       2012  |   1118.784   256.4776     4.36   0.000     615.9418    1621.626
       2013  |   1190.524   246.8695     4.82   0.000     706.5189    1674.528
       2014  |   800.0602   222.4673     3.60   0.000     363.8977    1236.223
       2015  |   1028.396   244.8947     4.20   0.000     548.2633    1508.529
       2016  |   1368.577   274.3341     4.99   0.000     830.7256    1906.428
       2017  |   1421.882   263.6625     5.39   0.000      904.953     1938.81
             |
       _cons |  -1249.279    340.169    -3.67   0.000    -1916.204   -582.3542
-------------+----------------------------------------------------------------
     sigma_u |  1773.2106
     sigma_e |  3443.5873
         rho |  .20958249   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,145
Group variable: cusip_n                         Number of groups  =      3,923

R-sq:                                           Obs per group:
     within  = 0.0512                                         min =          1
     between = 0.0039                                         avg =        5.4
     overall = 0.0002                                         max =         10

                                                F(12,3922)        =      15.86
corr(u_i, Xb)  = -0.8936                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,923 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.490232    3.32853     2.25   0.024     .9644188    14.01604
        dltt |  -.0249176   .0061631    -4.04   0.000    -.0370008   -.0128344
          at |   .0001074   .0065814     0.02   0.987    -.0127958    .0130106
         age |   157.9868   29.29583     5.39   0.000     100.5503    215.4233
             |
        year |
       2009  |   1400.668   315.7007     4.44   0.000     781.7154    2019.622
       2010  |   1270.567   271.3991     4.68   0.000       738.47    1802.663
       2011  |   645.5902   171.0323     3.77   0.000     310.2695    980.9108
       2012  |   486.8365   156.3782     3.11   0.002     180.2461    793.4268
       2013  |   400.5895   125.7014     3.19   0.001     154.1431    647.0358
       2014  |  -147.8608   101.1121    -1.46   0.144    -346.0981    50.37645
       2015  |  -77.51152   103.1233    -0.75   0.452    -279.6918    124.6688
       2016  |    104.682   107.2941     0.98   0.329    -105.6756    315.0396
       2017  |          0  (omitted)
             |
       _cons |  -4493.108   904.6538    -4.97   0.000    -6266.745   -2719.472
-------------+----------------------------------------------------------------
     sigma_u |  3068.3778
     sigma_e |  3443.5873
         rho |  .44257218   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,902
Group variable: cusip_n                         Number of groups  =      3,885

R-sq:                                           Obs per group:
     within  = 0.0518                                         min =          1
     between = 0.0005                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(13,3884)        =      15.05
corr(u_i, Xb)  = -0.8960                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,885 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.804894   3.326742     2.35   0.019     1.282566    14.32722
        dltt |  -.0241835   .0060416    -4.00   0.000    -.0360286   -.0123385
          at |  -.0008001   .0063767    -0.13   0.900     -.013302    .0117019
         age |   153.8415   30.17388     5.10   0.000     94.68336    212.9996
         emp |   .0113543   .0111217     1.02   0.307    -.0104506    .0331593
             |
        year |
       2009  |   1421.589   317.2704     4.48   0.000     799.5571    2043.622
       2010  |   1286.859   273.1653     4.71   0.000     751.2974     1822.42
       2011  |   658.3069   171.9143     3.83   0.000     321.2561    995.3578
       2012  |   498.3783   156.5228     3.18   0.001     191.5036     805.253
       2013  |   410.7511   125.3584     3.28   0.001     164.9764    656.5257
       2014  |  -141.6528   100.2532    -1.41   0.158    -338.2066    54.90104
       2015  |  -72.24382   102.6649    -0.70   0.482     -273.526    129.0383
       2016  |   117.8402   107.0536     1.10   0.271    -92.04631    327.7267
       2017  |          0  (omitted)
             |
       _cons |  -4589.624   909.3321    -5.05   0.000    -6372.438    -2806.81
-------------+----------------------------------------------------------------
     sigma_u |  3101.4778
     sigma_e |  3462.5309
         rho |  .44516094   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      8,581
Group variable: cusip_n                         Number of groups  =      1,711

R-sq:                                           Obs per group:
     within  = 0.0063                                         min =          1
     between = 0.0038                                         avg =        5.0
     overall = 0.0056                                         max =         10

                                                F(14,1710)        =       2.38
corr(u_i, Xb)  = -0.6464                        Prob > F          =     0.0028

                            (Std. Err. adjusted for 1,711 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.423943   5.404959     1.37   0.170    -3.177086    18.02497
        dltt |   .0318272    .079502     0.40   0.689    -.1241043    .1877587
          at |  -.0071425   .0090272    -0.79   0.429     -.024848    .0105629
         age |    75.7644   41.91828     1.81   0.071    -6.452106    157.9809
         emp |   .0107564    .011571     0.93   0.353    -.0119385    .0334512
         xad |  -.4550323   1.806852    -0.25   0.801    -3.998905     3.08884
             |
        year |
       2009  |   622.9248   441.2809     1.41   0.158    -242.5824    1488.432
       2010  |   731.0457   352.0857     2.08   0.038     40.48166     1421.61
       2011  |   104.5288    228.063     0.46   0.647    -342.7831    551.8408
       2012  |   182.2076   180.6398     1.01   0.313    -172.0907    536.5059
       2013  |   77.42496   144.0979     0.54   0.591    -205.2019    360.0518
       2014  |  -81.72602   143.9623    -0.57   0.570    -364.0868    200.6348
       2015  |  -155.5733   151.0837    -1.03   0.303    -451.9016    140.7549
       2016  |  -10.02498   127.8742    -0.08   0.938    -260.8313    240.7813
       2017  |          0  (omitted)
             |
       _cons |  -2284.758   1209.117    -1.89   0.059    -4656.262    86.74677
-------------+----------------------------------------------------------------
     sigma_u |  2116.9317
     sigma_e |  3287.0101
         rho |  .29317337   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,938
Group variable: cusip_n                         Number of groups  =        998

R-sq:                                           Obs per group:
     within  = 0.0233                                         min =          1
     between = 0.0001                                         avg =        4.9
     overall = 0.0032                                         max =         10

                                                F(15,997)         =       3.64
corr(u_i, Xb)  = -0.8025                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 998 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   15.33351   7.685085     2.00   0.046     .2527135    30.41431
        dltt |  -.2096794   .1923237    -1.09   0.276    -.5870851    .1677263
          at |   .0511978   .0908217     0.56   0.573    -.1270258    .2294213
         age |   169.7534   42.85982     3.96   0.000     85.64755    253.8592
         emp |   .0041545   .0122715     0.34   0.735    -.0199264    .0282354
         xad |  -1.873713    1.70123    -1.10   0.271    -5.212115    1.464689
         xrd |   .7445088   .8269253     0.90   0.368    -.8782049    2.367223
             |
        year |
       2009  |   1509.318   537.4068     2.81   0.005     454.7399    2563.896
       2010  |    1386.07   439.2895     3.16   0.002     524.0319    2248.108
       2011  |   395.9265   202.5595     1.95   0.051    -1.565394    793.4185
       2012  |    421.723   179.8608     2.34   0.019     68.77388    774.6721
       2013  |   154.5529   134.9983     1.14   0.253    -110.3605    419.4663
       2014  |  -162.1497   178.8639    -0.91   0.365    -513.1426    188.8432
       2015  |  -314.6153   218.4262    -1.44   0.150    -743.2432    114.0126
       2016  |  -138.7763   176.6423    -0.79   0.432    -485.4097    207.8571
       2017  |          0  (omitted)
             |
       _cons |  -5029.516   1272.693    -3.95   0.000    -7526.981   -2532.052
-------------+----------------------------------------------------------------
     sigma_u |  3449.3949
     sigma_e |  3815.6482
         rho |  .44971471   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

. 
. esttab cmty*, ///
>         keep(cmty_rtg_lym dltt at age emp xad xrd) ///
>         order(cmty_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
cmty_rtg_lym        0.647           4.264           7.493*          7.490*          7.490*          7.805*          7.424           15.33*  
                   (0.24)          (1.31)          (2.31)          (2.25)          (2.25)          (2.35)          (1.37)          (2.00)   

dltt                                              -0.0248***      -0.0249***      -0.0249***      -0.0242***       0.0318          -0.210   
                                                 (-10.30)         (-4.04)         (-4.04)         (-4.00)          (0.40)         (-1.09)   

at                                                               0.000107        0.000107       -0.000800        -0.00714          0.0512   
                                                                   (0.02)          (0.02)         (-0.13)         (-0.79)          (0.56)   

age                                                                                 158.0***        153.8***        75.76           169.8***
                                                                                   (5.39)          (5.10)          (1.81)          (3.96)   

emp                                                                                                0.0114          0.0108         0.00415   
                                                                                                   (1.02)          (0.93)          (0.34)   

xad                                                                                                                -0.455          -1.874   
                                                                                                                  (-0.25)         (-1.10)   

xrd                                                                                                                                 0.745   
                                                                                                                                   (0.90)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21230           21230           21145           21145           21145           20902            8581            4938   
Firms                3931            3931            3923            3923            3923            3885            1711             998   
R^2            0.00000211          0.0105          0.0512          0.0512          0.0512          0.0518         0.00628          0.0233   
AIC              402715.4        402509.9        400096.0        400098.0        400098.0        395721.6        161427.3         94355.7   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & `iv'!=.                                                                               /*      assumption      */
(63,271 real changes made)

. replace xrd=0 if xrd==. & `iv'!=.                                                                               /*      assumption      */
(60,751 real changes made)

. 
. xtreg F.`dv' `iv' `controls' i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,902
Group variable: cusip_n                         Number of groups  =      3,885

R-sq:                                           Obs per group:
     within  = 0.0520                                         min =          1
     between = 0.0006                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(15,3884)        =      13.47
corr(u_i, Xb)  = -0.8950                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,885 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
cmty_rtg_lym |   7.825114   3.333562     2.35   0.019     1.289415    14.36081
        dltt |   -.024228   .0061422    -3.94   0.000    -.0362702   -.0121858
          at |  -.0007665   .0065021    -0.12   0.906    -.0135143    .0119814
         age |   153.2767   30.30144     5.06   0.000     93.86846    212.6849
         emp |    .011816   .0087719     1.35   0.178     -.005382     .029014
         xad |   -.567175   .6424038    -0.88   0.377    -1.826656    .6923059
         xrd |   .1629551    .606814     0.27   0.788    -1.026749    1.352659
             |
        year |
       2009  |   1419.313   316.5945     4.48   0.000     798.6061    2040.021
       2010  |   1286.846   273.1859     4.71   0.000     751.2442    1822.447
       2011  |    659.508   172.1203     3.83   0.000     322.0533    996.9626
       2012  |   499.7946   156.8344     3.19   0.001     192.3091    807.2801
       2013  |   413.6222   125.8207     3.29   0.001     166.9412    660.3031
       2014  |  -138.3148   100.2697    -1.38   0.168     -334.901    58.27144
       2015  |  -67.70519   103.0136    -0.66   0.511     -269.671    134.2606
       2016  |   121.4757   106.2828     1.14   0.253    -86.89975    329.8511
       2017  |          0  (omitted)
             |
       _cons |  -4568.168   902.7099    -5.06   0.000    -6337.998   -2798.338
-------------+----------------------------------------------------------------
     sigma_u |  3090.6921
     sigma_e |  3462.3183
         rho |  .44347105   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store as1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore 

. 
. *       Table
. esttab cmty* as1, ///
>         keep(cmty_rtg_lym dltt at age emp xad xrd) ///
>         order(cmty_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
cmty_rtg_lym        0.647           4.264           7.493*          7.490*          7.490*          7.805*          7.424           15.33*          7.825*  
                   (0.24)          (1.31)          (2.31)          (2.25)          (2.25)          (2.35)          (1.37)          (2.00)          (2.35)   

dltt                                              -0.0248***      -0.0249***      -0.0249***      -0.0242***       0.0318          -0.210         -0.0242***
                                                 (-10.30)         (-4.04)         (-4.04)         (-4.00)          (0.40)         (-1.09)         (-3.94)   

at                                                               0.000107        0.000107       -0.000800        -0.00714          0.0512       -0.000766   
                                                                   (0.02)          (0.02)         (-0.13)         (-0.79)          (0.56)         (-0.12)   

age                                                                                 158.0***        153.8***        75.76           169.8***        153.3***
                                                                                   (5.39)          (5.10)          (1.81)          (3.96)          (5.06)   

emp                                                                                                0.0114          0.0108         0.00415          0.0118   
                                                                                                   (1.02)          (0.93)          (0.34)          (1.35)   

xad                                                                                                                -0.455          -1.874          -0.567   
                                                                                                                  (-0.25)         (-1.10)         (-0.88)   

xrd                                                                                                                                 0.745           0.163   
                                                                                                                                   (0.90)          (0.27)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21230           21230           21145           21145           21145           20902            8581            4938           20902   
Firms                3931            3931            3923            3923            3923            3885            1711             998            3885   
R^2            0.00000211          0.0105          0.0512          0.0512          0.0512          0.0518         0.00628          0.0233          0.0520   
AIC              402715.4        402509.9        400096.0        400098.0        400098.0        395721.6        161427.3         94355.7        395720.5   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.         
.         
.         
. ///     EMPLOYEES
> est clear

. local dv revt_yoy

. local iv emp_rtg_lym

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,305
Group variable: cusip_n                         Number of groups  =      3,932

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0000                                         avg =        5.4
     overall = 0.0000                                         max =         10

                                                F(1,3931)         =       1.10
corr(u_i, Xb)  = -0.0132                        Prob > F          =     0.2954

                            (Std. Err. adjusted for 3,932 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |  -3.765992    3.59833    -1.05   0.295    -10.82076    3.288777
       _cons |   370.2442   192.5009     1.92   0.055    -7.166831    747.6553
-------------+----------------------------------------------------------------
     sigma_u |  1171.0391
     sigma_e |  3515.4949
         rho |  .09987828   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store emp0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,305
Group variable: cusip_n                         Number of groups  =      3,932

R-sq:                                           Obs per group:
     within  = 0.0104                                         min =          1
     between = 0.0008                                         avg =        5.4
     overall = 0.0085                                         max =         10

                                                F(10,3931)        =       5.89
corr(u_i, Xb)  = -0.0116                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,932 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   4.376255   5.219954     0.84   0.402    -5.857817    14.61033
             |
        year |
       2009  |   1540.408   328.5061     4.69   0.000     896.3497    2184.467
       2010  |   1473.809   303.9155     4.85   0.000     877.9618    2069.656
       2011  |   1036.834   224.3241     4.62   0.000     597.0318    1476.637
       2012  |   1013.576   229.6012     4.41   0.000     563.4271    1463.724
       2013  |   1089.396   222.8654     4.89   0.000     652.4534    1526.339
       2014  |    687.466   195.0205     3.53   0.000     305.1152    1069.817
       2015  |   912.6606   221.5041     4.12   0.000     478.3868    1346.934
       2016  |    1237.11   244.2304     5.07   0.000     758.2796     1715.94
       2017  |   1312.298   239.4885     5.48   0.000     842.7643    1781.831
             |
       _cons |  -1090.076   361.8135    -3.01   0.003    -1799.436   -380.7163
-------------+----------------------------------------------------------------
     sigma_u |  1174.8186
     sigma_e |  3498.1591
         rho |  .10135615   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store emp1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store emp`counter'
  4.         estadd local yearFE "Yes", replace
  5.         
.         *       Increment
.         local vars "`vars' `control'"
  6.         local counter = `counter' + 1
  7. }

Fixed-effects (within) regression               Number of obs     =     21,221
Group variable: cusip_n                         Number of groups  =      3,924

R-sq:                                           Obs per group:
     within  = 0.0514                                         min =          1
     between = 0.0174                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(11,3923)        =      18.39
corr(u_i, Xb)  = -0.7176                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,924 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   11.68024   4.146227     2.82   0.005     3.551281    19.80921
        dltt |  -.0249399   .0024226   -10.29   0.000    -.0296895   -.0201902
             |
        year |
       2009  |   1579.912   337.1266     4.69   0.000     918.9516    2240.872
       2010  |   1622.556    310.237     5.23   0.000     1014.315    2230.797
       2011  |   1192.332   232.2343     5.13   0.000     737.0204    1647.643
       2012  |    1184.62   238.8494     4.96   0.000     716.3393    1652.901
       2013  |    1209.76   232.5672     5.20   0.000     753.7961    1665.724
       2014  |    786.383   205.0185     3.84   0.000     384.4301    1188.336
       2015  |   1011.559   230.3784     4.39   0.000     559.8863    1463.232
       2016  |   1358.452   254.3108     5.34   0.000      859.858    1857.046
       2017  |   1449.962   250.7135     5.78   0.000     958.4206    1941.503
             |
       _cons |  -1489.751   340.9077    -4.37   0.000    -2158.124   -821.3783
-------------+----------------------------------------------------------------
     sigma_u |   1785.988
     sigma_e |  3432.4338
         rho |  .21305707   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     21,221
Group variable: cusip_n                         Number of groups  =      3,924

R-sq:                                           Obs per group:
     within  = 0.0514                                         min =          1
     between = 0.0173                                         avg =        5.4
     overall = 0.0013                                         max =         10

                                                F(12,3923)        =      17.79
corr(u_i, Xb)  = -0.7158                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,924 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   11.68103   4.142541     2.82   0.005     3.559295    19.80277
        dltt |  -.0251733   .0061477    -4.09   0.000    -.0372264   -.0131202
          at |   .0002613   .0065506     0.04   0.968    -.0125816    .0131042
             |
        year |
       2009  |   1579.598   339.5038     4.65   0.000     913.9772    2245.218
       2010  |   1621.575   317.8769     5.10   0.000     998.3554    2244.794
       2011  |   1190.968   243.2058     4.90   0.000     714.1463     1667.79
       2012  |   1182.973   253.2499     4.67   0.000     686.4591    1679.487
       2013  |   1207.912   248.7445     4.86   0.000     720.2315    1695.593
       2014  |   784.3466   224.7891     3.49   0.000      343.632    1225.061
       2015  |   1009.414   248.5394     4.06   0.000     522.1355    1496.693
       2016  |   1356.132   275.5369     4.92   0.000     815.9225    1896.341
       2017  |   1447.975   266.8999     5.43   0.000     924.6995    1971.251
             |
       _cons |  -1492.037   328.2381    -4.55   0.000    -2135.571    -848.504
-------------+----------------------------------------------------------------
     sigma_u |   1781.487
     sigma_e |  3432.5312
         rho |  .21220267   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,221
Group variable: cusip_n                         Number of groups  =      3,924

R-sq:                                           Obs per group:
     within  = 0.0514                                         min =          1
     between = 0.0038                                         avg =        5.4
     overall = 0.0002                                         max =         10

                                                F(12,3923)        =      17.79
corr(u_i, Xb)  = -0.8973                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,924 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   11.68103   4.142541     2.82   0.005     3.559295    19.80277
        dltt |  -.0251733   .0061477    -4.09   0.000    -.0372264   -.0131202
          at |   .0002613   .0065506     0.04   0.968    -.0125816    .0131042
         age |   160.8861   29.65554     5.43   0.000     102.7444    219.0279
             |
        year |
       2009  |   1418.712   313.5758     4.52   0.000     803.9247    2033.499
       2010  |   1299.803   266.1512     4.88   0.000      777.995     1821.61
       2011  |   708.3096   170.7905     4.15   0.000     373.4631    1043.156
       2012  |   539.4285   152.6705     3.53   0.000     240.1076    838.7495
       2013  |   403.4815   125.7698     3.21   0.001     156.9012    650.0619
       2014  |  -180.9702   104.0094    -1.74   0.082    -384.8879     22.9475
       2015  |  -116.7888   106.7049    -1.09   0.274     -325.991    92.41343
       2016  |   69.04264   107.4664     0.64   0.521    -141.6526    279.7379
       2017  |          0  (omitted)
             |
       _cons |  -4793.414   863.2193    -5.55   0.000    -6485.815   -3101.013
-------------+----------------------------------------------------------------
     sigma_u |  3133.8832
     sigma_e |  3432.5312
         rho |  .45461275   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,980
Group variable: cusip_n                         Number of groups  =      3,890

R-sq:                                           Obs per group:
     within  = 0.0521                                         min =          1
     between = 0.0004                                         avg =        5.4
     overall = 0.0013                                         max =         10

                                                F(13,3889)        =      16.98
corr(u_i, Xb)  = -0.9000                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,890 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |    12.3952   4.076787     3.04   0.002     4.402354    20.38804
        dltt |  -.0244239   .0060273    -4.05   0.000    -.0362409   -.0126069
          at |  -.0006752   .0063422    -0.11   0.915    -.0131096    .0117592
         age |   156.6706   30.58041     5.12   0.000     96.71541    216.6257
         emp |   .0117871   .0111433     1.06   0.290    -.0100602    .0336344
             |
        year |
       2009  |   1441.088   314.9961     4.57   0.000     823.5144    2058.661
       2010  |   1318.577   267.5976     4.93   0.000     793.9323    1843.222
       2011  |   725.0063   171.3993     4.23   0.000     388.9653    1061.047
       2012  |   555.0109   152.3404     3.64   0.000     256.3363    853.6855
       2013  |   413.7925    125.378     3.30   0.001     167.9795    659.6054
       2014  |  -177.6945   103.3644    -1.72   0.086    -380.3481    24.95909
       2015  |  -112.9038   106.1654    -1.06   0.288     -321.049    95.24142
       2016  |   80.92609   107.1993     0.75   0.450    -129.2462    291.0984
       2017  |          0  (omitted)
             |
       _cons |  -4916.797   865.3394    -5.68   0.000    -6613.359   -3220.235
-------------+----------------------------------------------------------------
     sigma_u |  3171.9006
     sigma_e |  3451.5576
         rho |  .45785293   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      8,642
Group variable: cusip_n                         Number of groups  =      1,711

R-sq:                                           Obs per group:
     within  = 0.0066                                         min =          1
     between = 0.0045                                         avg =        5.1
     overall = 0.0063                                         max =         10

                                                F(14,1710)        =       2.80
corr(u_i, Xb)  = -0.6675                        Prob > F          =     0.0004

                            (Std. Err. adjusted for 1,711 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   15.14521    6.35096     2.38   0.017     2.688738    27.60168
        dltt |   .0322222   .0797616     0.40   0.686    -.1242183    .1886627
          at |  -.0068901   .0089888    -0.77   0.443    -.0245203    .0107401
         age |   78.85962   42.68026     1.85   0.065    -4.851411    162.5706
         emp |   .0110043   .0114832     0.96   0.338    -.0115183     .033527
         xad |  -.3741701   1.810638    -0.21   0.836    -3.925469    3.177129
             |
        year |
       2009  |   636.1575   433.2855     1.47   0.142     -213.668    1485.983
       2010  |   771.8422   336.6849     2.29   0.022     111.4845      1432.2
       2011  |   201.4072   214.4683     0.94   0.348    -219.2407    622.0551
       2012  |   273.8775   166.9581     1.64   0.101    -53.58611    601.3411
       2013  |   86.56964   146.4384     0.59   0.554    -200.6476    373.7869
       2014  |  -123.5274   153.2212    -0.81   0.420    -424.0482    176.9934
       2015  |  -203.3439   157.5643    -1.29   0.197    -512.3831    105.6952
       2016  |   -56.8173    130.943    -0.43   0.664    -313.6427    200.0081
       2017  |          0  (omitted)
             |
       _cons |  -2793.455   1010.786    -2.76   0.006    -4775.962   -810.9474
-------------+----------------------------------------------------------------
     sigma_u |  2178.2366
     sigma_e |  3264.5438
         rho |  .30805913   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,980
Group variable: cusip_n                         Number of groups  =        999

R-sq:                                           Obs per group:
     within  = 0.0227                                         min =          1
     between = 0.0001                                         avg =        5.0
     overall = 0.0031                                         max =         10

                                                F(15,998)         =       3.72
corr(u_i, Xb)  = -0.8158                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 999 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   13.46267   6.752579     1.99   0.046     .2117845    26.71355
        dltt |  -.2120646   .1912977    -1.11   0.268    -.5874564    .1633272
          at |   .0525858   .0901609     0.58   0.560     -.124341    .2295125
         age |   175.5548    44.3755     3.96   0.000     88.47484    262.6348
         emp |   .0041979    .012159     0.35   0.730    -.0196621     .028058
         xad |  -1.792273   1.712451    -1.05   0.296    -5.152692    1.568145
         xrd |   .7369974   .8157278     0.90   0.366     -.863741    2.337736
             |
        year |
       2009  |   1481.453   529.5143     2.80   0.005     442.3638    2520.542
       2010  |   1369.632   428.7504     3.19   0.001     528.2765    2210.988
       2011  |   460.1939   204.7042     2.25   0.025     58.49389    861.8938
       2012  |   450.5279   182.2756     2.47   0.014     92.84055    808.2152
       2013  |   161.4796   136.4902     1.18   0.237    -106.3612    429.3204
       2014  |  -178.6263   184.9335    -0.97   0.334    -541.5295    184.2768
       2015  |  -334.6018   220.0841    -1.52   0.129    -766.4825    97.27887
       2016  |  -171.7113   179.4191    -0.96   0.339    -523.7933    180.3707
       2017  |          0  (omitted)
             |
       _cons |  -5079.539   1237.438    -4.10   0.000    -7507.818    -2651.26
-------------+----------------------------------------------------------------
     sigma_u |  3544.9889
     sigma_e |  3787.3172
         rho |  .46698665   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

. 
. esttab emp*, ///
>         keep(emp_rtg_lym dltt at age emp xad xrd) ///
>         order(emp_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
emp_rtg_lym        -3.766           4.376           11.68**         11.68**         11.68**         12.40**         15.15*          13.46*  
                  (-1.05)          (0.84)          (2.82)          (2.82)          (2.82)          (3.04)          (2.38)          (1.99)   

dltt                                              -0.0249***      -0.0252***      -0.0252***      -0.0244***       0.0322          -0.212   
                                                 (-10.29)         (-4.09)         (-4.09)         (-4.05)          (0.40)         (-1.11)   

at                                                               0.000261        0.000261       -0.000675        -0.00689          0.0526   
                                                                   (0.04)          (0.04)         (-0.11)         (-0.77)          (0.58)   

age                                                                                 160.9***        156.7***        78.86           175.6***
                                                                                   (5.43)          (5.12)          (1.85)          (3.96)   

emp                                                                                                0.0118          0.0110         0.00420   
                                                                                                   (1.06)          (0.96)          (0.35)   

xad                                                                                                                -0.374          -1.792   
                                                                                                                  (-0.21)         (-1.05)   

xrd                                                                                                                                 0.737   
                                                                                                                                   (0.90)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21305           21305           21221           21221           21221           20980            8642            4980   
Firms                3932            3932            3924            3924            3924            3890            1711             999   
R^2             0.0000745          0.0104          0.0514          0.0514          0.0514          0.0521         0.00664          0.0227   
AIC              404022.9        403819.2        401413.7        401415.6        401415.6        397076.7        162471.5         95093.4   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & `iv'!=.                                                                               /*      assumption      */
(61,189 real changes made)

. replace xrd=0 if xrd==. & `iv'!=.                                                                               /*      assumption      */
(58,658 real changes made)

. 
. xtreg F.`dv' `iv' `controls' i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,980
Group variable: cusip_n                         Number of groups  =      3,890

R-sq:                                           Obs per group:
     within  = 0.0523                                         min =          1
     between = 0.0005                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(15,3889)        =      15.06
corr(u_i, Xb)  = -0.8989                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,890 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 emp_rtg_lym |   12.43314   4.057742     3.06   0.002     4.477637    20.38865
        dltt |  -.0244294   .0061297    -3.99   0.000    -.0364471   -.0124117
          at |  -.0006876   .0064697    -0.11   0.915    -.0133719    .0119967
         age |   156.0338   30.68625     5.08   0.000     95.87116    216.1965
         emp |   .0119654   .0087507     1.37   0.172    -.0051911    .0291218
         xad |  -.5348918   .6410036    -0.83   0.404    -1.791627    .7218433
         xrd |   .1854759   .5978444     0.31   0.756    -.9866423    1.357594
             |
        year |
       2009  |   1439.319   314.3355     4.58   0.000     823.0414    2055.597
       2010  |   1318.671    267.558     4.93   0.000     794.1042    1843.239
       2011  |     726.44   171.5263     4.24   0.000       390.15     1062.73
       2012  |   556.6749    152.613     3.65   0.000     257.4658    855.8839
       2013  |   416.7018   125.8325     3.31   0.001     169.9978    663.4058
       2014  |  -174.5232   103.3133    -1.69   0.091    -377.0766    28.03025
       2015  |  -108.6435   106.2208    -1.02   0.306    -316.8973    99.61026
       2016  |   84.24228   106.1223     0.79   0.427    -123.8184    292.3029
       2017  |          0  (omitted)
             |
       _cons |  -4893.918   859.0168    -5.70   0.000    -6578.084   -3209.751
-------------+----------------------------------------------------------------
     sigma_u |  3159.0358
     sigma_e |  3451.3582
         rho |  .45586467   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store as1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. restore 

. 
. *       Table
. esttab emp* as1, ///
>         keep(emp_rtg_lym dltt at age emp xad xrd) ///
>         order(emp_rtg_lym  dltt at age emp xad xrd) ///
>         s(yearFE N N_g r2 aic, label("Year FEs" "Observations" "Firms" "R^2" "AIC"))

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
emp_rtg_lym        -3.766           4.376           11.68**         11.68**         11.68**         12.40**         15.15*          13.46*          12.43** 
                  (-1.05)          (0.84)          (2.82)          (2.82)          (2.82)          (3.04)          (2.38)          (1.99)          (3.06)   

dltt                                              -0.0249***      -0.0252***      -0.0252***      -0.0244***       0.0322          -0.212         -0.0244***
                                                 (-10.29)         (-4.09)         (-4.09)         (-4.05)          (0.40)         (-1.11)         (-3.99)   

at                                                               0.000261        0.000261       -0.000675        -0.00689          0.0526       -0.000688   
                                                                   (0.04)          (0.04)         (-0.11)         (-0.77)          (0.58)         (-0.11)   

age                                                                                 160.9***        156.7***        78.86           175.6***        156.0***
                                                                                   (5.43)          (5.12)          (1.85)          (3.96)          (5.08)   

emp                                                                                                0.0118          0.0110         0.00420          0.0120   
                                                                                                   (1.06)          (0.96)          (0.35)          (1.37)   

xad                                                                                                                -0.374          -1.792          -0.535   
                                                                                                                  (-0.21)         (-1.05)         (-0.83)   

xrd                                                                                                                                 0.737           0.185   
                                                                                                                                   (0.90)          (0.31)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21305           21305           21221           21221           21221           20980            8642            4980           20980   
Firms                3932            3932            3924            3924            3924            3890            1711             999            3890   
R^2             0.0000745          0.0104          0.0514          0.0514          0.0514          0.0521         0.00664          0.0227          0.0523   
AIC              404022.9        403819.2        401413.7        401415.6        401415.6        397076.7        162471.5         95093.4        397075.9   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. ///     ENVIRONMENT
> est clear

. local dv revt_yoy

. local iv enviro_rtg_lym

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,490
Group variable: cusip_n                         Number of groups  =      3,415

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0006                                         avg =        4.8
     overall = 0.0000                                         max =         10

                                                F(1,3414)         =       1.24
corr(u_i, Xb)  = -0.0036                        Prob > F          =     0.2653

                              (Std. Err. adjusted for 3,415 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |  -3.019088   2.709779    -1.11   0.265    -8.332042    2.293865
         _cons |   365.0245    136.507     2.67   0.008     97.38085    632.6681
---------------+----------------------------------------------------------------
       sigma_u |  1295.9882
       sigma_e |  3925.1881
           rho |  .09829789   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store enviro0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. estadd local firmFE "Yes", replace

added macro:
             e(firmFE) : "Yes"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,490
Group variable: cusip_n                         Number of groups  =      3,415

R-sq:                                           Obs per group:
     within  = 0.0158                                         min =          1
     between = 0.0018                                         avg =        4.8
     overall = 0.0132                                         max =         10

                                                F(10,3414)        =       5.52
corr(u_i, Xb)  = -0.0106                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,415 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   5.989879   3.493282     1.71   0.086     -.859256    12.83901
               |
          year |
         2009  |   3012.876   732.6556     4.11   0.000     1576.388    4449.364
         2010  |   2818.117   694.4382     4.06   0.000     1456.561    4179.674
         2011  |    2156.64   556.0401     3.88   0.000     1066.435    3246.845
         2012  |   2138.247   574.2518     3.72   0.000     1012.335    3264.159
         2013  |    2202.59   556.1719     3.96   0.000     1112.127    3293.054
         2014  |   1743.375   511.1792     3.41   0.001     741.1264    2745.623
         2015  |   2052.497   557.6647     3.68   0.000     959.1062    3145.887
         2016  |   2396.841   589.5849     4.07   0.000     1240.866    3552.816
         2017  |   2474.755   571.9321     4.33   0.000     1353.391    3596.119
               |
         _cons |  -2253.259   634.7966    -3.55   0.000    -3497.878   -1008.639
---------------+----------------------------------------------------------------
       sigma_u |  1301.7314
       sigma_e |  3895.5863
           rho |  .10044427   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store enviro1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store enviro`counter'
  4.         estadd local yearFE "Yes", replace
  5.         estadd local firmFE "Yes", replace
  6.         
.         *       Increment
.         local vars "`vars' `control'"
  7.         local counter = `counter' + 1
  8. }

Fixed-effects (within) regression               Number of obs     =     16,426
Group variable: cusip_n                         Number of groups  =      3,404

R-sq:                                           Obs per group:
     within  = 0.1016                                         min =          1
     between = 0.0235                                         avg =        4.8
     overall = 0.0012                                         max =         10

                                                F(11,3403)        =      15.38
corr(u_i, Xb)  = -0.8554                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,404 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   9.406453    2.85474     3.30   0.001     3.809274    15.00363
          dltt |  -.0429904   .0041758   -10.30   0.000    -.0511777    -.034803
               |
          year |
         2009  |   2974.285   722.5474     4.12   0.000     1557.614    4390.956
         2010  |   3026.123   692.7331     4.37   0.000     1667.908    4384.338
         2011  |   2364.423    554.181     4.27   0.000     1277.862    3450.985
         2012  |   2371.442    572.068     4.15   0.000     1249.811    3493.074
         2013  |   2399.314   555.7884     4.32   0.000     1309.601    3489.027
         2014  |   1944.055   512.3402     3.79   0.000     939.5297    2948.581
         2015  |   2297.558   557.6099     4.12   0.000     1204.274    3390.842
         2016  |   2651.426   590.2174     4.49   0.000      1494.21    3808.642
         2017  |    2735.69   573.3073     4.77   0.000     1611.629    3859.751
               |
         _cons |  -2402.416   622.6739    -3.86   0.000    -3623.269   -1181.563
---------------+----------------------------------------------------------------
       sigma_u |  2879.7285
       sigma_e |  3729.4147
           rho |  .37352812   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     16,426
Group variable: cusip_n                         Number of groups  =      3,404

R-sq:                                           Obs per group:
     within  = 0.1025                                         min =          1
     between = 0.0239                                         avg =        4.8
     overall = 0.0007                                         max =         10

                                                F(12,3403)        =      14.09
corr(u_i, Xb)  = -0.8768                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,404 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   9.888409   2.897949     3.41   0.001     4.206513    15.57031
          dltt |  -.0358274   .0064919    -5.52   0.000    -.0485557   -.0230991
            at |  -.0079526   .0056148    -1.42   0.157    -.0189615    .0030562
               |
          year |
         2009  |   3002.584   724.4913     4.14   0.000     1582.102    4423.066
         2010  |   3088.811   699.5856     4.42   0.000      1717.16    4460.461
         2011  |   2444.959   559.9406     4.37   0.000     1347.105    3542.813
         2012  |   2467.367   580.1327     4.25   0.000     1329.923     3604.81
         2013  |   2495.536   563.6796     4.43   0.000     1390.351    3600.721
         2014  |   2045.929    521.324     3.92   0.000     1023.789    3068.069
         2015  |   2407.373   566.5359     4.25   0.000     1296.588    3518.158
         2016  |   2766.813   601.2536     4.60   0.000     1587.958    3945.667
         2017  |    2841.99   582.8472     4.88   0.000     1699.225    3984.756
               |
         _cons |  -2372.765   618.3658    -3.84   0.000    -3585.171   -1160.359
---------------+----------------------------------------------------------------
       sigma_u |  3095.7548
       sigma_e |  3727.6249
           rho |  .40818368   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,426
Group variable: cusip_n                         Number of groups  =      3,404

R-sq:                                           Obs per group:
     within  = 0.1025                                         min =          1
     between = 0.0051                                         avg =        4.8
     overall = 0.0001                                         max =         10

                                                F(12,3403)        =      14.09
corr(u_i, Xb)  = -0.9575                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,404 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   9.888409   2.897949     3.41   0.001     4.206513    15.57031
          dltt |  -.0358274   .0064919    -5.52   0.000    -.0485557   -.0230991
            at |  -.0079526   .0056148    -1.42   0.157    -.0189615    .0030562
           age |   315.7767    64.7608     4.88   0.000     188.8027    442.7507
               |
          year |
         2009  |   2686.807   662.1792     4.06   0.000     1388.498    3985.116
         2010  |   2457.257   574.3326     4.28   0.000     1331.186    3583.329
         2011  |   1497.629   377.6712     3.97   0.000     757.1435    2238.114
         2012  |    1204.26   330.3843     3.65   0.000      556.488    1852.031
         2013  |   916.6523    255.286     3.59   0.000     416.1229    1417.182
         2014  |   151.2688   168.1295     0.90   0.368    -178.3762    480.9139
         2015  |   196.9359   153.9367     1.28   0.201    -104.8819    498.7537
         2016  |   240.5989   135.6772     1.77   0.076    -25.41807     506.616
         2017  |          0  (omitted)
               |
         _cons |  -9220.002    2003.46    -4.60   0.000    -13148.11   -5291.895
---------------+----------------------------------------------------------------
       sigma_u |  5946.6213
       sigma_e |  3727.6249
           rho |  .71790713   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,291
Group variable: cusip_n                         Number of groups  =      3,383

R-sq:                                           Obs per group:
     within  = 0.1030                                         min =          1
     between = 0.0029                                         avg =        4.8
     overall = 0.0004                                         max =         10

                                                F(13,3382)        =      13.30
corr(u_i, Xb)  = -0.9576                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,383 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   10.09239   2.896385     3.48   0.000     4.413547    15.77123
          dltt |  -.0352624   .0064542    -5.46   0.000    -.0479169   -.0226079
            at |  -.0086694   .0055929    -1.55   0.121    -.0196352    .0022964
           age |   311.2467   65.00929     4.79   0.000     183.7852    438.7082
           emp |   .0095292   .0104241     0.91   0.361    -.0109089    .0299674
               |
          year |
         2009  |   2705.831   665.2004     4.07   0.000     1401.595    4010.066
         2010  |   2471.114   577.0871     4.28   0.000     1339.639    3602.588
         2011  |   1506.263   379.3005     3.97   0.000     762.5818    2249.945
         2012  |   1210.122   331.6273     3.65   0.000     559.9113    1860.332
         2013  |    921.138   255.9883     3.60   0.000     419.2305    1423.046
         2014  |   152.6957   168.2914     0.91   0.364    -177.2675    482.6588
         2015  |   201.0281   154.1813     1.30   0.192    -101.2698     503.326
         2016  |   250.7864     136.14     1.84   0.066    -16.13864    517.7115
         2017  |          0  (omitted)
               |
         _cons |  -9297.435   2016.552    -4.61   0.000    -13251.22   -5343.651
---------------+----------------------------------------------------------------
       sigma_u |   5959.177
       sigma_e |  3742.7672
           rho |  .71711877   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      6,718
Group variable: cusip_n                         Number of groups  =      1,457

R-sq:                                           Obs per group:
     within  = 0.0119                                         min =          1
     between = 0.0011                                         avg =        4.6
     overall = 0.0017                                         max =         10

                                                F(14,1456)        =       2.22
corr(u_i, Xb)  = -0.8340                        Prob > F          =     0.0057

                              (Std. Err. adjusted for 1,457 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   12.97547   5.752697     2.26   0.024     1.691013    24.25993
          dltt |  -.0035888   .0621741    -0.06   0.954    -.1255492    .1183717
            at |  -.0143545   .0069387    -2.07   0.039    -.0279654   -.0007435
           age |   136.5046   66.95014     2.04   0.042     5.175568    267.8336
           emp |   .0100561   .0114953     0.87   0.382     -.012493    .0326053
           xad |  -.2497328   1.622399    -0.15   0.878    -3.432222    2.932757
               |
          year |
         2009  |   1138.052   777.7406     1.46   0.144    -387.5593    2663.664
         2010  |   1219.894   616.0433     1.98   0.048     11.46711    2428.322
         2011  |   286.4897   351.3031     0.82   0.415    -402.6245    975.6038
         2012  |   367.1385   320.0177     1.15   0.251    -260.6065    994.8836
         2013  |   80.61631   250.0085     0.32   0.747    -409.7991    571.0317
         2014  |  -146.6011   227.4498    -0.64   0.519    -592.7654    299.5633
         2015  |  -112.9266   187.1005    -0.60   0.546     -479.942    254.0887
         2016  |  -19.60372   150.4856    -0.13   0.896    -314.7955     275.588
         2017  |          0  (omitted)
               |
         _cons |   -4009.06   2065.029    -1.94   0.052    -8059.811    41.69071
---------------+----------------------------------------------------------------
       sigma_u |  3131.7735
       sigma_e |   3467.123
           rho |  .44931189   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      3,954
Group variable: cusip_n                         Number of groups  =        873

R-sq:                                           Obs per group:
     within  = 0.0237                                         min =          1
     between = 0.0007                                         avg =        4.5
     overall = 0.0014                                         max =         10

                                                F(15,872)         =       2.98
corr(u_i, Xb)  = -0.8975                        Prob > F          =     0.0001

                                (Std. Err. adjusted for 873 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   23.79845   9.266787     2.57   0.010     5.610638    41.98627
          dltt |   -.071467   .1124124    -0.64   0.525    -.2920974    .1491634
            at |  -.0239667   .0447994    -0.53   0.593    -.1118939    .0639604
           age |   278.6588   84.93216     3.28   0.001     111.9635    445.3542
           emp |   .0078421   .0114456     0.69   0.493    -.0146221    .0303063
           xad |  -1.030021   1.323608    -0.78   0.437    -3.627851     1.56781
           xrd |   1.017583   .6909472     1.47   0.141    -.3385308    2.373697
               |
          year |
         2009  |   2734.427   1093.367     2.50   0.013      588.488    4880.366
         2010  |   2404.747   884.9726     2.72   0.007     667.8215    4141.672
         2011  |   930.6732   351.9845     2.64   0.008     239.8375    1621.509
         2012  |   951.6887   416.1681     2.29   0.022     134.8804    1768.497
         2013  |   338.8165   273.7389     1.24   0.216    -198.4476    876.0807
         2014  |  -136.9229    282.905    -0.48   0.629    -692.1772    418.3314
         2015  |  -151.9151   256.4951    -0.59   0.554    -655.3349    351.5047
         2016  |  -108.8505   200.7404    -0.54   0.588    -502.8413    285.1403
         2017  |          0  (omitted)
               |
         _cons |  -8615.891   2695.358    -3.20   0.001    -13906.04   -3325.743
---------------+----------------------------------------------------------------
       sigma_u |  5074.8387
       sigma_e |  4204.3184
           rho |  .59299611   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

. 
. esttab enviro*, ///
>         keep(enviro_rtg_lym dltt at age emp xad xrd) ///
>         order(enviro_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE firmFE N N_g r2 aic, label("Year FEs" "Firm FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
enviro_rtg~m       -3.019           5.990           9.406***        9.888***        9.888***        10.09***        12.98*          23.80*  
                  (-1.11)          (1.71)          (3.30)          (3.41)          (3.41)          (3.48)          (2.26)          (2.57)   

dltt                                              -0.0430***      -0.0358***      -0.0358***      -0.0353***     -0.00359         -0.0715   
                                                 (-10.30)         (-5.52)         (-5.52)         (-5.46)         (-0.06)         (-0.64)   

at                                                               -0.00795        -0.00795        -0.00867         -0.0144*        -0.0240   
                                                                  (-1.42)         (-1.42)         (-1.55)         (-2.07)         (-0.53)   

age                                                                                 315.8***        311.2***        136.5*          278.7** 
                                                                                   (4.88)          (4.79)          (2.04)          (3.28)   

emp                                                                                               0.00953          0.0101         0.00784   
                                                                                                   (0.91)          (0.87)          (0.69)   

xad                                                                                                                -0.250          -1.030   
                                                                                                                  (-0.15)         (-0.78)   

xrd                                                                                                                                 1.018   
                                                                                                                                   (1.47)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes                             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16490           16490           16426           16426           16426           16291            6718            3954   
Firms                3415            3415            3404            3404            3404            3383            1457             873   
R^2             0.0000526          0.0158           0.102           0.103           0.103           0.103          0.0119          0.0237   
AIC              315885.9        315642.9        312983.6        312968.6        312968.6        310520.5        126950.5         76228.6   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & `iv'!=.                                                                               /*      assumption      */
(45,729 real changes made)

. replace xrd=0 if xrd==. & `iv'!=.                                                                               /*      assumption      */
(43,614 real changes made)

. 
. xtreg F.`dv' `iv' `controls' i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,291
Group variable: cusip_n                         Number of groups  =      3,383

R-sq:                                           Obs per group:
     within  = 0.1034                                         min =          1
     between = 0.0031                                         avg =        4.8
     overall = 0.0004                                         max =         10

                                                F(15,3382)        =      12.07
corr(u_i, Xb)  = -0.9572                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,383 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
enviro_rtg_lym |   9.948012   2.887336     3.45   0.001     4.286912    15.60911
          dltt |  -.0352323   .0065152    -5.41   0.000    -.0480065   -.0224582
            at |  -.0087449   .0056955    -1.54   0.125    -.0199119    .0024222
           age |   309.6526    65.2437     4.75   0.000     181.7315    437.5737
           emp |   .0094165   .0082286     1.14   0.253    -.0067171      .02555
           xad |  -.6757609   .5582159    -1.21   0.226    -1.770236    .4187139
           xrd |   .2747822    .580065     0.47   0.636    -.8625313    1.412096
               |
          year |
         2009  |   2697.985   664.4893     4.06   0.000     1395.143    4000.826
         2010  |   2466.647   576.9292     4.28   0.000     1335.482    3597.812
         2011  |    1504.15   379.2923     3.97   0.000     760.4848    2247.816
         2012  |   1208.171   331.5139     3.64   0.000     558.1831    1858.159
         2013  |   924.4924   255.5256     3.62   0.000     423.4921    1425.493
         2014  |   157.4024   167.4949     0.94   0.347    -170.9991    485.8038
         2015  |   206.4256    153.399     1.35   0.178     -94.3385    507.1897
         2016  |   255.2747    134.617     1.90   0.058    -8.664336    519.2137
         2017  |          0  (omitted)
               |
         _cons |   -9229.36   2016.243    -4.58   0.000    -13182.54   -5276.182
---------------+----------------------------------------------------------------
       sigma_u |  5934.4132
       sigma_e |   3742.217
           rho |  .71548606   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store as1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. estadd local firmFE "Yes", replace

added macro:
             e(firmFE) : "Yes"

. restore 

. 
. *       Table
. esttab enviro* as1, ///
>         keep(enviro_rtg_lym dltt at age emp xad xrd) ///
>         order(enviro_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE firmFE N N_g r2 aic, label("Year FEs" "Firm FEs" "Observations" "Firms" "R^2" "AIC"))

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
enviro_rtg~m       -3.019           5.990           9.406***        9.888***        9.888***        10.09***        12.98*          23.80*          9.948***
                  (-1.11)          (1.71)          (3.30)          (3.41)          (3.41)          (3.48)          (2.26)          (2.57)          (3.45)   

dltt                                              -0.0430***      -0.0358***      -0.0358***      -0.0353***     -0.00359         -0.0715         -0.0352***
                                                 (-10.30)         (-5.52)         (-5.52)         (-5.46)         (-0.06)         (-0.64)         (-5.41)   

at                                                               -0.00795        -0.00795        -0.00867         -0.0144*        -0.0240        -0.00874   
                                                                  (-1.42)         (-1.42)         (-1.55)         (-2.07)         (-0.53)         (-1.54)   

age                                                                                 315.8***        311.2***        136.5*          278.7**         309.7***
                                                                                   (4.88)          (4.79)          (2.04)          (3.28)          (4.75)   

emp                                                                                               0.00953          0.0101         0.00784         0.00942   
                                                                                                   (0.91)          (0.87)          (0.69)          (1.14)   

xad                                                                                                                -0.250          -1.030          -0.676   
                                                                                                                  (-0.15)         (-0.78)         (-1.21)   

xrd                                                                                                                                 1.018           0.275   
                                                                                                                                   (1.47)          (0.47)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes                             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16490           16490           16426           16426           16426           16291            6718            3954           16291   
Firms                3415            3415            3404            3404            3404            3383            1457             873            3383   
R^2             0.0000526          0.0158           0.102           0.103           0.103           0.103          0.0119          0.0237           0.103   
AIC              315885.9        315642.9        312983.6        312968.6        312968.6        310520.5        126950.5         76228.6        310517.2   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.         
. ///     GOVERNANCE
> est clear

. local dv revt_yoy

. local iv gov_rtg_lym

. local controls "dltt at age emp xad xrd"

. 
. xtreg F.`dv' `iv', fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,291
Group variable: cusip_n                         Number of groups  =      3,956

R-sq:                                           Obs per group:
     within  = 0.0001                                         min =          1
     between = 0.0000                                         avg =        5.4
     overall = 0.0000                                         max =         10

                                                F(1,3955)         =       1.99
corr(u_i, Xb)  = -0.0136                        Prob > F          =     0.1584

                            (Std. Err. adjusted for 3,956 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |   -3.20334    2.27067    -1.41   0.158    -7.655133    1.248452
       _cons |   333.3192   116.3985     2.86   0.004     105.1124    561.5259
-------------+----------------------------------------------------------------
     sigma_u |  1148.3694
     sigma_e |  3520.8831
         rho |  .09615142   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store govmod0

. estadd local yearFE "No", replace

added macro:
             e(yearFE) : "No"

. estadd local firmFE "Yes", replace

added macro:
             e(firmFE) : "Yes"

. 
. xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     21,291
Group variable: cusip_n                         Number of groups  =      3,956

R-sq:                                           Obs per group:
     within  = 0.0104                                         min =          1
     between = 0.0003                                         avg =        5.4
     overall = 0.0083                                         max =         10

                                                F(10,3955)        =       6.56
corr(u_i, Xb)  = -0.0131                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,956 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |   2.182796    2.61895     0.83   0.405    -2.951824    7.317415
             |
        year |
       2009  |   1511.478   322.5618     4.69   0.000     879.0745    2143.881
       2010  |   1447.416   294.9345     4.91   0.000     869.1777    2025.653
       2011  |    1006.52   213.5448     4.71   0.000     587.8517    1425.188
       2012  |   978.3519   217.4057     4.50   0.000      552.114     1404.59
       2013  |    1097.68   216.9279     5.06   0.000     672.3788    1522.981
       2014  |   698.1157   187.4465     3.72   0.000     330.6148    1065.617
       2015  |   940.0244   215.3002     4.37   0.000     517.9146    1362.134
       2016  |   1263.264   238.5878     5.29   0.000      795.497     1731.03
       2017  |   1324.776   232.6761     5.69   0.000     868.5993    1780.952
             |
       _cons |  -966.5955   242.6711    -3.98   0.000    -1442.368   -490.8233
-------------+----------------------------------------------------------------
     sigma_u |  1153.8391
     sigma_e |  3503.5267
         rho |  .09784951   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store govmod1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. 
. local vars ""

. local counter 2

. foreach control of local controls {
  2.         *       Regression
.         xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
  3.                 
.         *       Store results
.         est store govmod`counter'
  4.         estadd local yearFE "Yes", replace
  5.         estadd local firmFE "Yes", replace
  6.         
.         *       Increment
.         local vars "`vars' `control'"
  7.         local counter = `counter' + 1
  8. }

Fixed-effects (within) regression               Number of obs     =     21,207
Group variable: cusip_n                         Number of groups  =      3,948

R-sq:                                           Obs per group:
     within  = 0.0510                                         min =          1
     between = 0.0184                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(11,3947)        =      17.95
corr(u_i, Xb)  = -0.7170                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,948 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |    5.20441   2.464725     2.11   0.035     .3721564    10.03666
        dltt |  -.0247943   .0024173   -10.26   0.000    -.0295336    -.020055
             |
        year |
       2009  |   1537.872   328.0434     4.69   0.000     894.7216    2181.023
       2010  |   1563.346   301.4916     5.19   0.000     972.2516     2154.44
       2011  |   1121.269   221.9336     5.05   0.000     686.1543    1556.385
       2012  |   1102.276   227.2863     4.85   0.000     656.6666    1547.886
       2013  |   1234.513   227.8009     5.42   0.000      787.894    1681.131
       2014  |    837.267   199.9281     4.19   0.000     445.2948    1229.239
       2015  |   1102.071   227.7866     4.84   0.000     655.4807    1548.662
       2016  |   1431.917   251.4952     5.69   0.000     938.8442     1924.99
       2017  |   1491.835   245.9521     6.07   0.000      1009.63     1974.04
             |
       _cons |  -1140.302    258.468    -4.41   0.000    -1647.045   -633.5587
-------------+----------------------------------------------------------------
     sigma_u |   1766.883
     sigma_e |   3438.355
         rho |  .20890269   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

Fixed-effects (within) regression               Number of obs     =     21,207
Group variable: cusip_n                         Number of groups  =      3,948

R-sq:                                           Obs per group:
     within  = 0.0511                                         min =          1
     between = 0.0183                                         avg =        5.4
     overall = 0.0012                                         max =         10

                                                F(12,3947)        =      16.86
corr(u_i, Xb)  = -0.7156                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,948 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |    5.19938    2.46991     2.11   0.035     .3569608     10.0418
        dltt |   -.024968   .0061696    -4.05   0.000     -.037064   -.0128721
          at |   .0001946   .0065662     0.03   0.976    -.0126789     .013068
             |
        year |
       2009  |   1537.629   330.4807     4.65   0.000     889.6999    2185.558
       2010  |   1562.615   308.8741     5.06   0.000     957.0467    2168.182
       2011  |   1120.252   232.3876     4.82   0.000     664.6414    1575.864
       2012  |   1101.039   241.1553     4.57   0.000     628.2388     1573.84
       2013  |   1233.119   244.1261     5.05   0.000     754.4941    1711.744
       2014  |   835.7384   220.5143     3.79   0.000     403.4057    1268.071
       2015  |   1100.434   247.0152     4.45   0.000      616.145    1584.724
       2016  |   1430.152   273.4662     5.23   0.000     894.0039      1966.3
       2017  |   1490.309   262.6281     5.67   0.000     975.4092    2005.208
             |
       _cons |  -1141.705   252.0783    -4.53   0.000    -1635.921   -647.4895
-------------+----------------------------------------------------------------
     sigma_u |   1763.445
     sigma_e |  3438.4537
         rho |  .20825022   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,207
Group variable: cusip_n                         Number of groups  =      3,948

R-sq:                                           Obs per group:
     within  = 0.0511                                         min =          1
     between = 0.0038                                         avg =        5.4
     overall = 0.0002                                         max =         10

                                                F(12,3947)        =      16.86
corr(u_i, Xb)  = -0.9008                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,948 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |    5.19938    2.46991     2.11   0.035     .3569608     10.0418
        dltt |   -.024968   .0061696    -4.05   0.000     -.037064   -.0128721
          at |   .0001946   .0065662     0.03   0.976    -.0126789     .013068
         age |   165.5899    29.1809     5.67   0.000     108.3788    222.8009
             |
        year |
       2009  |   1372.039   304.8632     4.50   0.000     774.3348    1969.743
       2010  |   1231.435   258.1774     4.77   0.000     725.2613    1737.608
       2011  |   623.4829   164.3824     3.79   0.000     301.2004    945.7654
       2012  |     438.68   142.0887     3.09   0.002     160.1059    717.2541
       2013  |     405.17   123.9478     3.27   0.001     162.1621    648.1778
       2014  |  -157.8007   101.2195    -1.56   0.119    -356.2482    40.64679
       2015  |  -58.69453   104.4244    -0.56   0.574    -263.4254    146.0364
       2016  |   105.4334   106.9246     0.99   0.324    -104.1994    315.0661
       2017  |          0  (omitted)
             |
       _cons |  -4543.094   807.3232    -5.63   0.000    -6125.904   -2960.285
-------------+----------------------------------------------------------------
     sigma_u |  3177.1988
     sigma_e |  3438.4537
         rho |  .46057108   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,963
Group variable: cusip_n                         Number of groups  =      3,911

R-sq:                                           Obs per group:
     within  = 0.0517                                         min =          1
     between = 0.0005                                         avg =        5.4
     overall = 0.0011                                         max =         10

                                                F(13,3910)        =      15.91
corr(u_i, Xb)  = -0.9033                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,911 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |   5.522805   2.515294     2.20   0.028     .5913927    10.45422
        dltt |  -.0242374   .0060468    -4.01   0.000    -.0360926   -.0123821
          at |  -.0007079     .00636    -0.11   0.911    -.0131772    .0117613
         age |   161.9308   30.07008     5.39   0.000     102.9763    220.8853
         emp |   .0113303   .0111152     1.02   0.308    -.0104619    .0331225
             |
        year |
       2009  |   1392.181   306.3711     4.54   0.000     791.5187    1992.843
       2010  |   1246.349   259.8098     4.80   0.000     736.9737    1755.725
       2011  |   635.2076   165.1825     3.85   0.000     311.3556    959.0596
       2012  |   448.3005   142.2501     3.15   0.002     169.4092    727.1919
       2013  |   415.6294    123.496     3.37   0.001     173.5066    657.7521
       2014  |  -151.9031   100.3504    -1.51   0.130    -348.6472    44.84104
       2015  |  -52.16152   103.9309    -0.50   0.616    -255.9254    151.6023
       2016  |   119.2194   106.7148     1.12   0.264    -90.00248    328.4413
       2017  |          0  (omitted)
             |
       _cons |  -4651.672   812.8323    -5.72   0.000    -6245.287   -3058.057
-------------+----------------------------------------------------------------
     sigma_u |  3218.1955
     sigma_e |  3457.5336
         rho |  .46419404   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      8,603
Group variable: cusip_n                         Number of groups  =      1,724

R-sq:                                           Obs per group:
     within  = 0.0061                                         min =          1
     between = 0.0033                                         avg =        5.0
     overall = 0.0049                                         max =         10

                                                F(14,1723)        =       2.65
corr(u_i, Xb)  = -0.6990                        Prob > F          =     0.0008

                            (Std. Err. adjusted for 1,724 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |   9.154849    4.58042     2.00   0.046     .1710802    18.13862
        dltt |   .0313408   .0795512     0.39   0.694    -.1246863     .187368
          at |  -.0070915   .0090485    -0.78   0.433    -.0248387    .0106557
         age |   89.33605   41.76597     2.14   0.033      7.41871    171.2534
         emp |   .0106118   .0115034     0.92   0.356    -.0119503    .0331739
         xad |  -.3625066   1.806703    -0.20   0.841    -3.906069    3.181056
             |
        year |
       2009  |   596.1038    427.106     1.40   0.163    -241.5971    1433.805
       2010  |   695.1085   336.3674     2.07   0.039     35.37696     1354.84
       2011  |   89.81588    226.868     0.40   0.692    -355.1498    534.7816
       2012  |   135.7184   165.8899     0.82   0.413    -189.6484    461.0853
       2013  |    86.9989   143.9077     0.60   0.546    -195.2532     369.251
       2014  |  -100.5705   146.5312    -0.69   0.493    -387.9682    186.8272
       2015  |  -128.8919   151.5377    -0.85   0.395    -426.1091    168.3253
       2016  |  -4.936566   128.3497    -0.04   0.969    -256.6743    246.8012
       2017  |          0  (omitted)
             |
       _cons |  -2678.716   1059.518    -2.53   0.012    -4756.792   -600.6395
-------------+----------------------------------------------------------------
     sigma_u |  2251.6314
     sigma_e |   3277.965
         rho |  .32057392   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,948
Group variable: cusip_n                         Number of groups  =      1,003

R-sq:                                           Obs per group:
     within  = 0.0219                                         min =          1
     between = 0.0000                                         avg =        4.9
     overall = 0.0026                                         max =         10

                                                F(15,1002)        =       3.96
corr(u_i, Xb)  = -0.8232                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 1,003 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |   7.422119   5.876568     1.26   0.207    -4.109672    18.95391
        dltt |  -.2146986   .1932482    -1.11   0.267    -.5939163     .164519
          at |   .0531667   .0908504     0.59   0.559    -.1251122    .2314456
         age |   181.6015    46.9406     3.87   0.000     89.48832    273.7146
         emp |   .0038481   .0122457     0.31   0.753     -.020182    .0278782
         xad |  -1.745792   1.725734    -1.01   0.312    -5.132259    1.640674
         xrd |   .7111765   .8206394     0.87   0.386    -.8991923    2.321545
             |
        year |
       2009  |   1421.072   514.9704     2.76   0.006     410.5274    2431.616
       2010  |    1283.42   417.3546     3.08   0.002     464.4305    2102.409
       2011  |   349.9273   210.5368     1.66   0.097    -63.21635    763.0709
       2012  |   314.4322   153.5775     2.05   0.041     13.06181    615.8026
       2013  |   142.4561   135.8056     1.05   0.294    -124.0398     408.952
       2014  |  -170.3866    178.419    -0.95   0.340    -520.5042    179.7311
       2015  |  -275.5608   220.8516    -1.25   0.212    -708.9454    157.8239
       2016  |  -138.1809   179.0173    -0.77   0.440    -489.4728     213.111
       2017  |          0  (omitted)
             |
       _cons |  -4865.829   1372.261    -3.55   0.000    -7558.664   -2172.993
-------------+----------------------------------------------------------------
     sigma_u |  3619.5123
     sigma_e |   3805.315
         rho |  .47499115   (fraction of variance due to u_i)
------------------------------------------------------------------------------

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

. 
. esttab govmod*, ///
>         keep(gov_rtg_lym dltt at age emp xad xrd) ///
>         order(gov_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE firmFE N N_g r2 aic, label("Year FEs" "Firm FEs" "Observations" "Firms" "R^2" "AIC"))

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
gov_rtg_lym        -3.203           2.183           5.204*          5.199*          5.199*          5.523*          9.155*          7.422   
                  (-1.41)          (0.83)          (2.11)          (2.11)          (2.11)          (2.20)          (2.00)          (1.26)   

dltt                                              -0.0248***      -0.0250***      -0.0250***      -0.0242***       0.0313          -0.215   
                                                 (-10.26)         (-4.05)         (-4.05)         (-4.01)          (0.39)         (-1.11)   

at                                                               0.000195        0.000195       -0.000708        -0.00709          0.0532   
                                                                   (0.03)          (0.03)         (-0.11)         (-0.78)          (0.59)   

age                                                                                 165.6***        161.9***        89.34*          181.6***
                                                                                   (5.67)          (5.39)          (2.14)          (3.87)   

emp                                                                                                0.0113          0.0106         0.00385   
                                                                                                   (1.02)          (0.92)          (0.31)   

xad                                                                                                                -0.363          -1.746   
                                                                                                                  (-0.20)         (-1.01)   

xrd                                                                                                                                 0.711   
                                                                                                                                   (0.87)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes                             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21291           21291           21207           21207           21207           20963            8603            4948   
Firms                3956            3956            3948            3948            3948            3911            1724            1003   
R^2             0.0000504          0.0104          0.0510          0.0511          0.0511          0.0517         0.00613          0.0219   
AIC              403790.0        403586.5        401189.3        401191.3        401191.3        396797.8        161783.0         94516.2   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==. & `iv'!=.                                                                               /*      assumption      */
(63,748 real changes made)

. replace xrd=0 if xrd==. & `iv'!=.                                                                               /*      assumption      */
(61,239 real changes made)

. 
. xtreg F.`dv' `iv' `controls' i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     20,963
Group variable: cusip_n                         Number of groups  =      3,911

R-sq:                                           Obs per group:
     within  = 0.0519                                         min =          1
     between = 0.0006                                         avg =        5.4
     overall = 0.0011                                         max =         10

                                                F(15,3910)        =      14.07
corr(u_i, Xb)  = -0.9024                        Prob > F          =     0.0000

                            (Std. Err. adjusted for 3,911 clusters in cusip_n)
------------------------------------------------------------------------------
             |               Robust
  F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 gov_rtg_lym |   5.493246   2.514413     2.18   0.029     .5635603    10.42293
        dltt |  -.0242654   .0061453    -3.95   0.000    -.0363136   -.0122171
          at |  -.0006921   .0064828    -0.11   0.915    -.0134021    .0120178
         age |   161.3432   30.18759     5.34   0.000     102.1583    220.5281
         emp |   .0116549   .0087518     1.33   0.183    -.0055035    .0288133
         xad |  -.5178282   .6410893    -0.81   0.419    -1.774729    .7390727
         xrd |   .1596825   .6040632     0.26   0.792    -1.024626    1.343991
             |
        year |
       2009  |   1390.217   305.7135     4.55   0.000     790.8442     1989.59
       2010  |   1246.071    259.748     4.80   0.000     736.8168    1755.325
       2011  |    636.138   165.3255     3.85   0.000     312.0056    960.2703
       2012  |   449.5527   142.5032     3.15   0.002     170.1651    728.9404
       2013  |   418.2962    123.975     3.37   0.001     175.2345    661.3579
       2014  |  -148.7271   100.3673    -1.48   0.138    -345.5042    48.05013
       2015  |  -47.99633   104.3607    -0.46   0.646     -252.603    156.6103
       2016  |   122.5313   105.9417     1.16   0.248    -85.17484    330.2375
       2017  |          0  (omitted)
             |
       _cons |   -4627.29   804.1398    -5.75   0.000    -6203.863   -3050.717
-------------+----------------------------------------------------------------
     sigma_u |  3206.2552
     sigma_e |  3457.3818
         rho |  .46236734   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store as1

. estadd local yearFE "Yes", replace

added macro:
             e(yearFE) : "Yes"

. estadd local firmFE "Yes", replace

added macro:
             e(firmFE) : "Yes"

. restore 

. 
. *       Table
. esttab govmod* as1, ///
>         keep(gov_rtg_lym dltt at age emp xad xrd) ///
>         order(gov_rtg_lym dltt at age emp xad xrd) ///
>         s(yearFE firmFE N N_g r2 aic, label("Year FEs" "Firm FEs" "Observations" "Firms" "R^2" "AIC"))

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
gov_rtg_lym        -3.203           2.183           5.204*          5.199*          5.199*          5.523*          9.155*          7.422           5.493*  
                  (-1.41)          (0.83)          (2.11)          (2.11)          (2.11)          (2.20)          (2.00)          (1.26)          (2.18)   

dltt                                              -0.0248***      -0.0250***      -0.0250***      -0.0242***       0.0313          -0.215         -0.0243***
                                                 (-10.26)         (-4.05)         (-4.05)         (-4.01)          (0.39)         (-1.11)         (-3.95)   

at                                                               0.000195        0.000195       -0.000708        -0.00709          0.0532       -0.000692   
                                                                   (0.03)          (0.03)         (-0.11)         (-0.78)          (0.59)         (-0.11)   

age                                                                                 165.6***        161.9***        89.34*          181.6***        161.3***
                                                                                   (5.67)          (5.39)          (2.14)          (3.87)          (5.34)   

emp                                                                                                0.0113          0.0106         0.00385          0.0117   
                                                                                                   (1.02)          (0.92)          (0.31)          (1.33)   

xad                                                                                                                -0.363          -1.746          -0.518   
                                                                                                                  (-0.20)         (-1.01)         (-0.81)   

xrd                                                                                                                                 0.711           0.160   
                                                                                                                                   (0.87)          (0.26)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes                             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21291           21291           21207           21207           21207           20963            8603            4948           20963   
Firms                3956            3956            3948            3948            3948            3911            1724            1003            3911   
R^2             0.0000504          0.0104          0.0510          0.0511          0.0511          0.0517         0.00613          0.0219          0.0519   
AIC              403790.0        403586.5        401189.3        401191.3        401191.3        396797.8        161783.0         94516.2        396797.5   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
.         
.         
.         
.         
. ///     ALL CATEGORIES
> xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym , fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,372
Group variable: cusip_n                         Number of groups  =      3,385

R-sq:                                           Obs per group:
     within  = 0.0006                                         min =          1
     between = 0.0000                                         avg =        4.8
     overall = 0.0002                                         max =         10

                                                F(4,3384)         =       1.89
corr(u_i, Xb)  = -0.0509                        Prob > F          =     0.1091

                              (Std. Err. adjusted for 3,385 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |   15.63202   6.832964     2.29   0.022     2.234866    29.02918
   emp_rtg_lym |  -16.19328    9.19506    -1.76   0.078    -34.22172    1.835151
enviro_rtg_lym |  -2.531182   2.870038    -0.88   0.378    -8.158366    3.096003
   gov_rtg_lym |  -3.876919   4.167348    -0.93   0.352    -12.04769    4.293855
         _cons |   597.4666    567.138     1.05   0.292    -514.5011    1709.434
---------------+----------------------------------------------------------------
       sigma_u |   1306.286
       sigma_e |  3936.7104
           rho |  .09918484   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m1

. xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,372
Group variable: cusip_n                         Number of groups  =      3,385

R-sq:                                           Obs per group:
     within  = 0.0160                                         min =          1
     between = 0.0014                                         avg =        4.8
     overall = 0.0131                                         max =         10

                                                F(13,3384)        =       4.49
corr(u_i, Xb)  = -0.0158                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,385 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |   9.353871   6.873634     1.36   0.174    -4.123024    22.83077
   emp_rtg_lym |   1.717994   11.40074     0.15   0.880    -20.63504    24.07102
enviro_rtg_lym |   2.540977   3.160439     0.80   0.421    -3.655586    8.737539
   gov_rtg_lym |    1.70051   4.024602     0.42   0.673    -6.190388    9.591408
               |
          year |
         2009  |   3024.261   725.4995     4.17   0.000       1601.8    4446.723
         2010  |   2827.833   701.1182     4.03   0.000     1453.175    4202.491
         2011  |   2160.265   564.5431     3.83   0.000     1053.385    3267.145
         2012  |   2132.861   584.7265     3.65   0.000     986.4076    3279.314
         2013  |   2199.106   553.7129     3.97   0.000      1113.46    3284.751
         2014  |   1711.814    500.931     3.42   0.001     729.6562    2693.972
         2015  |   1991.494   541.2542     3.68   0.000      930.276    3052.713
         2016  |   2353.597   576.0641     4.09   0.000     1224.128    3483.066
         2017  |   2430.601   560.7368     4.33   0.000     1331.183    3530.018
               |
         _cons |  -2732.365   971.7243    -2.81   0.005    -4637.591   -827.1391
---------------+----------------------------------------------------------------
       sigma_u |  1309.4513
       sigma_e |  3907.7022
           rho |  .10095278   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m2

. xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,308
Group variable: cusip_n                         Number of groups  =      3,374

R-sq:                                           Obs per group:
     within  = 0.1025                                         min =          1
     between = 0.0237                                         avg =        4.8
     overall = 0.0012                                         max =         10

                                                F(14,3373)        =      13.83
corr(u_i, Xb)  = -0.8562                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,374 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |   5.288707   6.785901     0.78   0.436    -8.016189     18.5936
   emp_rtg_lym |   17.17141   7.308532     2.35   0.019     2.841812    31.50102
enviro_rtg_lym |   3.192737   3.110378     1.03   0.305    -2.905681    9.291156
   gov_rtg_lym |    4.87515   3.871537     1.26   0.208    -2.715648    12.46595
          dltt |  -.0432322   .0041052   -10.53   0.000    -.0512812   -.0351833
               |
          year |
         2009  |   3069.249   723.4202     4.24   0.000     1650.862    4487.635
         2010  |   3136.498    692.398     4.53   0.000     1778.936     4494.06
         2011  |   2482.172   552.2749     4.49   0.000     1399.344    3564.999
         2012  |   2501.649   569.0968     4.40   0.000     1385.839    3617.458
         2013  |   2494.662    549.158     4.54   0.000     1417.945    3571.378
         2014  |   1962.314   502.1975     3.91   0.000     977.6717    2946.956
         2015  |   2272.988   543.0499     4.19   0.000     1208.247    3337.728
         2016  |    2677.02   576.7154     4.64   0.000     1546.273    3807.767
         2017  |   2795.205   559.6698     4.99   0.000     1697.879    3892.532
               |
         _cons |  -3611.826   798.4096    -4.52   0.000    -5177.242    -2046.41
---------------+----------------------------------------------------------------
       sigma_u |  2904.9298
       sigma_e |  3739.7068
           rho |  .37632037   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m3

. xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt at i.year, fe cluster(cusip_n)

Fixed-effects (within) regression               Number of obs     =     16,308
Group variable: cusip_n                         Number of groups  =      3,374

R-sq:                                           Obs per group:
     within  = 0.1034                                         min =          1
     between = 0.0241                                         avg =        4.8
     overall = 0.0007                                         max =         10

                                                F(15,3373)        =      12.74
corr(u_i, Xb)  = -0.8767                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,374 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |   4.617359   6.745819     0.68   0.494     -8.60895    17.84367
   emp_rtg_lym |    17.0137   7.249698     2.35   0.019     2.799451    31.22795
enviro_rtg_lym |   3.906734   3.074905     1.27   0.204    -2.122133    9.935601
   gov_rtg_lym |    4.84826    3.88095     1.25   0.212    -2.760992    12.45751
          dltt |  -.0362168   .0063924    -5.67   0.000    -.0487502   -.0236834
            at |  -.0077849   .0055694    -1.40   0.162    -.0187046    .0031348
               |
          year |
         2009  |   3096.272   725.6721     4.27   0.000      1673.47    4519.074
         2010  |   3197.358   699.9827     4.57   0.000     1824.924    4569.791
         2011  |   2560.944   559.5752     4.58   0.000     1463.803    3658.085
         2012  |   2596.102   579.2195     4.48   0.000     1460.445    3731.759
         2013  |   2589.828   558.3219     4.64   0.000     1495.144    3684.511
         2014  |   2064.705   511.8562     4.03   0.000     1061.125    3068.285
         2015  |   2385.964   552.2828     4.32   0.000     1303.121    3468.807
         2016  |   2794.357   588.6508     4.75   0.000     1640.209    3948.506
         2017  |   2903.675     570.62     5.09   0.000     1784.879    4022.471
               |
         _cons |  -3551.015   790.5269    -4.49   0.000    -5100.975   -2001.054
---------------+----------------------------------------------------------------
       sigma_u |  3113.5894
       sigma_e |  3737.9934
           rho |  .40961783   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m4

. xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt at age i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,308
Group variable: cusip_n                         Number of groups  =      3,374

R-sq:                                           Obs per group:
     within  = 0.1034                                         min =          1
     between = 0.0050                                         avg =        4.8
     overall = 0.0001                                         max =         10

                                                F(15,3373)        =      12.74
corr(u_i, Xb)  = -0.9587                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,374 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |   4.617359   6.745819     0.68   0.494     -8.60895    17.84367
   emp_rtg_lym |    17.0137   7.249698     2.35   0.019     2.799451    31.22795
enviro_rtg_lym |   3.906734   3.074905     1.27   0.204    -2.122133    9.935601
   gov_rtg_lym |    4.84826    3.88095     1.25   0.212    -2.760992    12.45751
          dltt |  -.0362168   .0063924    -5.67   0.000    -.0487502   -.0236834
            at |  -.0077849   .0055694    -1.40   0.162    -.0187046    .0031348
           age |   322.6306   63.40222     5.09   0.000     198.3199    446.9413
               |
          year |
         2009  |   2773.641   665.3719     4.17   0.000     1469.068    4078.215
         2010  |   2552.096   578.8151     4.41   0.000     1417.232    3686.961
         2011  |   1593.052   382.8843     4.16   0.000      842.343    2343.761
         2012  |    1305.58   336.7044     3.88   0.000     645.4143    1965.745
         2013  |   976.6746   258.1522     3.78   0.000      470.524    1482.825
         2014  |   128.9213   170.0701     0.76   0.448    -204.5296    462.3723
         2015  |   127.5502   155.4969     0.82   0.412    -177.3276    432.4279
         2016  |   213.3124   137.0528     1.56   0.120    -55.40263    482.0275
         2017  |          0  (omitted)
               |
         _cons |  -10555.09   2077.188    -5.08   0.000    -14627.77    -6482.42
---------------+----------------------------------------------------------------
       sigma_u |  6065.2516
       sigma_e |  3737.9934
           rho |  .72473148   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m5

. xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt at age emp i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,173
Group variable: cusip_n                         Number of groups  =      3,353

R-sq:                                           Obs per group:
     within  = 0.1039                                         min =          1
     between = 0.0027                                         avg =        4.8
     overall = 0.0004                                         max =         10

                                                F(16,3352)        =      12.36
corr(u_i, Xb)  = -0.9589                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,353 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |   4.928804    6.77819     0.73   0.467    -8.361002    18.21861
   emp_rtg_lym |   17.85059   7.262521     2.46   0.014     3.611168    32.09001
enviro_rtg_lym |   3.787872   3.100506     1.22   0.222    -2.291204    9.866949
   gov_rtg_lym |   5.111478   3.952578     1.29   0.196    -2.638231    12.86119
          dltt |  -.0356231    .006355    -5.61   0.000    -.0480832   -.0231631
            at |  -.0085539   .0055518    -1.54   0.123    -.0194392    .0023315
           age |   318.0183   63.56373     5.00   0.000     193.3906    442.6459
           emp |   .0103407   .0104852     0.99   0.324    -.0102174    .0308987
               |
          year |
         2009  |   2797.855   668.4043     4.19   0.000     1487.334    4108.377
         2010  |   2571.623   581.6949     4.42   0.000      1431.11    3712.136
         2011  |   1606.865   384.7416     4.18   0.000     852.5128    2361.217
         2012  |   1316.611   337.9627     3.90   0.000      653.977    1979.245
         2013  |   984.8697   258.9742     3.80   0.000     477.1062    1492.633
         2014  |   130.4051    170.149     0.77   0.443    -203.2012    464.0113
         2015  |   129.0067   155.4972     0.83   0.407    -175.8723    433.8858
         2016  |   223.5621   137.4146     1.63   0.104    -45.86294     492.987
         2017  |          0  (omitted)
               |
         _cons |  -10707.55   2093.931    -5.11   0.000    -14813.06   -6602.038
---------------+----------------------------------------------------------------
       sigma_u |  6086.1028
       sigma_e |  3753.1217
           rho |  .72448919   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m6

. xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt at age emp xad i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      6,663
Group variable: cusip_n                         Number of groups  =      1,442

R-sq:                                           Obs per group:
     within  = 0.0135                                         min =          1
     between = 0.0013                                         avg =        4.6
     overall = 0.0021                                         max =         10

                                                F(17,1441)        =       2.19
corr(u_i, Xb)  = -0.8300                        Prob > F          =     0.0034

                              (Std. Err. adjusted for 1,442 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |   16.06883   11.94327     1.35   0.179    -7.359231     39.4969
   emp_rtg_lym |   14.38671   9.500267     1.51   0.130    -4.249125    33.02254
enviro_rtg_lym |   3.475367   4.824581     0.72   0.471    -5.988587    12.93932
   gov_rtg_lym |   7.765862   6.490188     1.20   0.232    -4.965365    20.49709
          dltt |  -.0028647   .0620667    -0.05   0.963    -.1246155    .1188861
            at |  -.0140085   .0068567    -2.04   0.041    -.0274586   -.0005584
           age |    134.081   66.12188     2.03   0.043     4.375507    263.7864
           emp |   .0108706   .0114798     0.95   0.344    -.0116483    .0333896
           xad |  -.2777123   1.621964    -0.17   0.864    -3.459375     2.90395
               |
          year |
         2009  |    1186.25   762.6897     1.56   0.120    -309.8509    2682.351
         2010  |   1287.197   600.7765     2.14   0.032     108.7068    2465.687
         2011  |   353.8048   343.7633     1.03   0.304    -320.5254    1028.135
         2012  |   443.0578   304.6738     1.45   0.146    -154.5938    1040.709
         2013  |   157.1555   240.3312     0.65   0.513    -314.2809     628.592
         2014  |  -147.5314   230.1616    -0.64   0.522     -599.019    303.9562
         2015  |  -192.7281   201.9764    -0.95   0.340    -588.9274    203.4712
         2016  |  -42.33721   157.1231    -0.27   0.788    -350.5516    265.8772
         2017  |          0  (omitted)
               |
         _cons |  -5553.249   2082.066    -2.67   0.008    -9637.454   -1469.043
---------------+----------------------------------------------------------------
       sigma_u |  3114.3627
       sigma_e |  3478.4181
           rho |  .44494757   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m7

. xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt at age emp xad xrd i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      3,914
Group variable: cusip_n                         Number of groups  =        862

R-sq:                                           Obs per group:
     within  = 0.0251                                         min =          1
     between = 0.0009                                         avg =        4.5
     overall = 0.0019                                         max =         10

                                                F(18,861)         =       2.60
corr(u_i, Xb)  = -0.8759                        Prob > F          =     0.0003

                                (Std. Err. adjusted for 862 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |    27.9992   15.81007     1.77   0.077    -3.031581    59.02998
   emp_rtg_lym |   6.789501   12.29473     0.55   0.581    -17.34164    30.92064
enviro_rtg_lym |    14.0098   5.821644     2.41   0.016     2.583529    25.43608
   gov_rtg_lym |  -.3759052   8.120355    -0.05   0.963    -16.31391     15.5621
          dltt |  -.0636973   .1122537    -0.57   0.571    -.2840203    .1566258
            at |  -.0253605   .0442828    -0.57   0.567    -.1122754    .0615544
           age |   250.4675   81.28864     3.08   0.002      90.9204    410.0146
           emp |   .0083211   .0113406     0.73   0.463    -.0139374    .0305795
           xad |  -1.094551   1.321569    -0.83   0.408    -3.688425    1.499324
           xrd |   1.039827   .6928442     1.50   0.134    -.3200348    2.399688
               |
          year |
         2009  |   2731.169   1077.599     2.53   0.011     616.1397    4846.198
         2010  |   2439.416   874.1703     2.79   0.005      723.662     4155.17
         2011  |   985.7226    370.248     2.66   0.008     259.0284    1712.417
         2012  |   1016.057   412.8036     2.46   0.014     205.8378    1826.276
         2013  |    388.565   283.4086     1.37   0.171    -167.6877    944.8177
         2014  |  -145.5188    284.305    -0.51   0.609    -703.5306    412.4931
         2015  |  -267.9745   273.7134    -0.98   0.328    -805.1981    269.2492
         2016  |  -136.5963    208.684    -0.65   0.513    -546.1852    272.9926
         2017  |          0  (omitted)
               |
         _cons |  -9241.338   3009.371    -3.07   0.002     -15147.9   -3334.775
---------------+----------------------------------------------------------------
       sigma_u |  4659.3531
       sigma_e |  4223.2335
           rho |  .54898019   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m8

. 
. 
. *       Many xad and xrd observations are missing. Assume missing = 0.
. preserve

. replace xad=0 if xad==.                                                                                                                 /*      assumption      */
(138,388 real changes made)

. replace xrd=0 if xrd==.                                                                                                                 /*      assumption      */
(123,301 real changes made)

. 
. xtreg F.revt_yoy cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt at age emp xad xrd i.year, fe cluster(cusip_n)
note: 2017.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     16,173
Group variable: cusip_n                         Number of groups  =      3,353

R-sq:                                           Obs per group:
     within  = 0.1043                                         min =          1
     between = 0.0029                                         avg =        4.8
     overall = 0.0004                                         max =         10

                                                F(18,3352)        =      11.43
corr(u_i, Xb)  = -0.9584                        Prob > F          =     0.0000

                              (Std. Err. adjusted for 3,353 clusters in cusip_n)
--------------------------------------------------------------------------------
               |               Robust
    F.revt_yoy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  cmty_rtg_lym |   5.030569   6.781174     0.74   0.458    -8.265088    18.32623
   emp_rtg_lym |    17.9437   7.293745     2.46   0.014     3.643061    32.24435
enviro_rtg_lym |   3.614243   3.108619     1.16   0.245    -2.480739    9.709225
   gov_rtg_lym |   5.002691   3.913806     1.28   0.201    -2.670998    12.67638
          dltt |  -.0355928   .0064175    -5.55   0.000    -.0481754   -.0230102
            at |   -.008631   .0056584    -1.53   0.127    -.0197253    .0024632
           age |   316.1795   63.73721     4.96   0.000     191.2117    441.1473
           emp |   .0102146   .0082717     1.23   0.217    -.0060036    .0264327
           xad |  -.6793698   .5540695    -1.23   0.220    -1.765718    .4069787
           xrd |     .27835   .5783518     0.48   0.630    -.8556082    1.412308
               |
          year |
         2009  |   2790.336   667.6706     4.18   0.000     1481.253    4099.419
         2010  |   2567.552    581.491     4.42   0.000     1427.439    3707.665
         2011  |   1605.405   384.6155     4.17   0.000        851.3    2359.509
         2012  |   1315.608   337.7128     3.90   0.000     653.4645    1977.752
         2013  |   988.3753   258.5508     3.82   0.000     481.4421    1495.309
         2014  |   135.0607   169.4136     0.80   0.425    -197.1038    467.2252
         2015  |   133.6103   154.6432     0.86   0.388    -169.5944    436.8149
         2016  |    227.733   135.8087     1.68   0.094    -38.54332    494.0094
         2017  |          0  (omitted)
               |
         _cons |  -10636.21   2088.448    -5.09   0.000    -14730.98   -6541.453
---------------+----------------------------------------------------------------
       sigma_u |  6057.1388
       sigma_e |   3752.557
           rho |  .72264105   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store m9

. restore 

. 
. *       Table
. esttab m1 m2 m3 m4 m5 m6 m7 m8 m9, ///
>         keep(cmty_rtg_lym emp_rtg_lym enviro_rtg_lym gov_rtg_lym dltt at age emp xad xrd) ///
>         r2 ar2 aic

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
cmty_rtg_lym        15.63*          9.354           5.289           4.617           4.617           4.929           16.07           28.00           5.031   
                   (2.29)          (1.36)          (0.78)          (0.68)          (0.68)          (0.73)          (1.35)          (1.77)          (0.74)   

emp_rtg_lym        -16.19           1.718           17.17*          17.01*          17.01*          17.85*          14.39           6.790           17.94*  
                  (-1.76)          (0.15)          (2.35)          (2.35)          (2.35)          (2.46)          (1.51)          (0.55)          (2.46)   

enviro_rtg~m       -2.531           2.541           3.193           3.907           3.907           3.788           3.475           14.01*          3.614   
                  (-0.88)          (0.80)          (1.03)          (1.27)          (1.27)          (1.22)          (0.72)          (2.41)          (1.16)   

gov_rtg_lym        -3.877           1.701           4.875           4.848           4.848           5.111           7.766          -0.376           5.003   
                  (-0.93)          (0.42)          (1.26)          (1.25)          (1.25)          (1.29)          (1.20)         (-0.05)          (1.28)   

dltt                                              -0.0432***      -0.0362***      -0.0362***      -0.0356***     -0.00286         -0.0637         -0.0356***
                                                 (-10.53)         (-5.67)         (-5.67)         (-5.61)         (-0.05)         (-0.57)         (-5.55)   

at                                                               -0.00778        -0.00778        -0.00855         -0.0140*        -0.0254        -0.00863   
                                                                  (-1.40)         (-1.40)         (-1.54)         (-2.04)         (-0.57)         (-1.53)   

age                                                                                 322.6***        318.0***        134.1*          250.5**         316.2***
                                                                                   (5.09)          (5.00)          (2.03)          (3.08)          (4.96)   

emp                                                                                                0.0103          0.0109         0.00832          0.0102   
                                                                                                   (0.99)          (0.95)          (0.73)          (1.23)   

xad                                                                                                                -0.278          -1.095          -0.679   
                                                                                                                  (-0.17)         (-0.83)         (-1.23)   

xrd                                                                                                                                 1.040           0.278   
                                                                                                                                   (1.50)          (0.48)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
N                   16372           16372           16308           16308           16308           16173            6663            3914           16173   
R-sq                0.001           0.016           0.102           0.103           0.103           0.104           0.013           0.025           0.104   
adj. R-sq           0.000           0.015           0.102           0.103           0.103           0.103           0.011           0.021           0.103   
AIC              313730.7        313495.1        310834.4        310820.2        310820.2        308369.9        125960.7         75497.6        308366.5   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

.         
.         
.         
. /*      
> ///     REVENUE = F (CSRHUB subcategories)
>                 CSRHub CATEGORIES and subcategories:
>                         -       COMMUNITY
>                                 *       Community development and philanthropy
>                                 *       Product
>                                 *       Human rights and supply chain
>                         -       EMPLOYEES
>                                 *       Compensation and benefits
>                                 *       Diversity and labor rights
>                                 *       Training health and safety
>                         -       ENVIRONMENT
>                                 *       Energy and climate change
>                                 *       Environmental policy and reporting
>                                 *       Resource management
>                         -       GOVERNANCE
>                                 *       Board
>                                 *       Leadership ethics
>                                 *       Transparency and reporting
> 
>  ///
>                                         
>                                 */
. est clear

. local dv revt_yoy

. local ivs "com_dev_phl_rtg_lym prod_rtg_lym humrts_supchain_rtg_lym comp_ben_rtg_lym div_lab_rtg_lym train_hlth_safe_rtg_lym enrgy_climchge_rtg_lym enviro_pol_rpt_rtg_lym resource_mg
> mt_rtg_lym board_rtg_lym ldrship_ethics_rtg_lym trans_report_rtg_lym"

. local controls "dltt at age emp xad xrd"

. 
. foreach iv of local ivs {
  2.         local vars ""
  3.         display "`iv'"
  4.         qui xtreg F.`dv' `iv', fe cluster(cusip_n)
  5.         est store `iv'0
  6.         qui estadd local yearFE "No", replace
  7.         qui estadd local firmFE "Yes", replace
  8. 
.         qui xtreg F.`dv' `iv' i.year, fe cluster(cusip_n)
  9.         est store `iv'1
 10.         qui estadd local yearFE "Yes", replace
 11.         qui estadd local firmFE "Yes", replace
 12.         
.         local vars ""
 13.         local counter 2
 14.         foreach control of local controls {
 15.                 *       Regression
.                 qui xtreg F.`dv' `iv' `vars' `control' i.year, fe cluster(cusip_n)
 16.                         
.                 *       Store results
.                 est store `iv'`counter'
 17.                 estadd local yearFE "Yes", replace
 18.                 estadd local firmFE "Yes", replace
 19.                 
.                 *       Increment
.                 local vars "`vars' `control'"
 20.                 local counter = `counter' + 1
 21.         }
 22. 
.         esttab `iv'*, ///
>                 keep(`iv' dltt at age emp xad xrd) ///
>                 order(`iv' dltt at age emp xad xrd) ///
>                 s(yearFE firmFE N N_g r2 aic, label("Year FEs" "Firm FEs" "Observations" "Firms" "R^2" "AIC"))
 23. 
.         *       Many xad and xrd observations are missing. Assume missing = 0.
.         preserve
 24.         replace xad=0 if xad==. & `iv'!=.                                                                               /*      assumption      */
 25.         replace xrd=0 if xrd==. & `iv'!=.                                                                               /*      assumption      */
 26. 
.         qui xtreg F.`dv' `iv' `controls' i.year, fe cluster(cusip_n)
 27.         est store as1
 28.         qui estadd local yearFE "Yes", replace
 29.         qui estadd local firmFE "Yes", replace
 30.         restore 
 31. 
.         *       Table
.         esttab `iv'* as1, ///
>                 keep(`iv' dltt at age emp xad xrd) ///
>                 order(`iv' dltt at age emp xad xrd) ///
>                 s(yearFE firmFE N N_g r2 aic, label("Year FEs" "Firm FEs" "Observations" "Firms" "R^2" "AIC"))
 32. }
com_dev_phl_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
com_dev_ph~m        2.141           7.478*          9.850**         9.851**         9.851**         10.25**         9.366           18.32   
                   (0.70)          (2.12)          (2.63)          (2.62)          (2.62)          (2.75)          (1.37)          (1.80)   

dltt                                              -0.0249***      -0.0245***      -0.0245***      -0.0239***       0.0313          -0.213   
                                                 (-10.27)         (-3.95)         (-3.95)         (-3.91)          (0.39)         (-1.10)   

at                                                              -0.000381       -0.000381        -0.00120        -0.00707          0.0528   
                                                                  (-0.06)         (-0.06)         (-0.19)         (-0.78)          (0.58)   

age                                                                                 176.4***        172.7***        90.47           207.8***
                                                                                   (5.14)          (4.88)          (1.82)          (3.88)   

emp                                                                                                0.0108          0.0108         0.00419   
                                                                                                   (0.95)          (0.93)          (0.34)   

xad                                                                                                                -0.374          -1.752   
                                                                                                                  (-0.21)         (-1.02)   

xrd                                                                                                                                 0.715   
                                                                                                                                   (0.87)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        18863           18863           18787           18787           18787           18596            7563            4411   
Firms                3717            3717            3707            3707            3707            3670            1589             936   
R^2             0.0000271          0.0109          0.0520          0.0520          0.0520          0.0526         0.00650          0.0242   
AIC              359940.4        359752.4        357582.7        357584.7        357584.7        354124.2        143186.6         84755.5   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(58,157 real changes made)
(55,786 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
com_dev_ph~m        2.141           7.478*          9.850**         9.851**         9.851**         10.25**         9.366           18.32           10.26** 
                   (0.70)          (2.12)          (2.63)          (2.62)          (2.62)          (2.75)          (1.37)          (1.80)          (2.75)   

dltt                                              -0.0249***      -0.0245***      -0.0245***      -0.0239***       0.0313          -0.213         -0.0239***
                                                 (-10.27)         (-3.95)         (-3.95)         (-3.91)          (0.39)         (-1.10)         (-3.85)   

at                                                              -0.000381       -0.000381        -0.00120        -0.00707          0.0528        -0.00120   
                                                                  (-0.06)         (-0.06)         (-0.19)         (-0.78)          (0.58)         (-0.18)   

age                                                                                 176.4***        172.7***        90.47           207.8***        172.0***
                                                                                   (5.14)          (4.88)          (1.82)          (3.88)          (4.85)   

emp                                                                                                0.0108          0.0108         0.00419          0.0111   
                                                                                                   (0.95)          (0.93)          (0.34)          (1.24)   

xad                                                                                                                -0.374          -1.752          -0.502   
                                                                                                                  (-0.21)         (-1.02)         (-0.78)   

xrd                                                                                                                                 0.715           0.172   
                                                                                                                                   (0.87)          (0.28)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        18863           18863           18787           18787           18787           18596            7563            4411           18596   
Firms                3717            3717            3707            3707            3707            3670            1589             936            3670   
R^2             0.0000271          0.0109          0.0520          0.0520          0.0520          0.0526         0.00650          0.0242          0.0528   
AIC              359940.4        359752.4        357582.7        357584.7        357584.7        354124.2        143186.6         84755.5        354124.4   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
prod_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
prod_rtg_lym       0.0600           5.451           6.318           5.804           5.804           6.159           12.04           19.40   
                   (0.02)          (1.46)          (1.72)          (1.61)          (1.61)          (1.75)          (1.62)          (1.58)   

dltt                                              -0.0256***      -0.0196***      -0.0196***      -0.0192**       -0.0127          -0.206   
                                                  (-9.90)         (-3.33)         (-3.33)         (-3.26)         (-0.20)         (-1.07)   

at                                                               -0.00679        -0.00679        -0.00725         -0.0103          0.0495   
                                                                  (-1.21)         (-1.21)         (-1.29)         (-1.16)          (0.55)   

age                                                                                 300.7***        298.4***        156.0*          278.1** 
                                                                                   (4.57)          (4.52)          (2.31)          (3.15)   

emp                                                                                               0.00636         0.00914         0.00398   
                                                                                                   (0.59)          (0.80)          (0.32)   

xad                                                                                                                -0.654          -1.958   
                                                                                                                  (-0.37)         (-1.16)   

xrd                                                                                                                                 0.699   
                                                                                                                                   (0.84)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16226           16226           16165           16165           16165           16013            6535            3853   
Firms                3328            3328            3318            3318            3318            3297            1427             856   
R^2              2.17e-08          0.0158          0.0615          0.0622          0.0622          0.0625          0.0125          0.0298   
AIC              311297.1        311056.8        309180.7        309170.6        309170.6        306408.4        123932.3         74539.9   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(47,029 real changes made)
(44,929 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
prod_rtg_lym       0.0600           5.451           6.318           5.804           5.804           6.159           12.04           19.40           6.154   
                   (0.02)          (1.46)          (1.72)          (1.61)          (1.61)          (1.75)          (1.62)          (1.58)          (1.77)   

dltt                                              -0.0256***      -0.0196***      -0.0196***      -0.0192**       -0.0127          -0.206         -0.0193** 
                                                  (-9.90)         (-3.33)         (-3.33)         (-3.26)         (-0.20)         (-1.07)         (-3.21)   

at                                                               -0.00679        -0.00679        -0.00725         -0.0103          0.0495        -0.00720   
                                                                  (-1.21)         (-1.21)         (-1.29)         (-1.16)          (0.55)         (-1.25)   

age                                                                                 300.7***        298.4***        156.0*          278.1**         297.6***
                                                                                   (4.57)          (4.52)          (2.31)          (3.15)          (4.47)   

emp                                                                                               0.00636         0.00914         0.00398         0.00717   
                                                                                                   (0.59)          (0.80)          (0.32)          (0.86)   

xad                                                                                                                -0.654          -1.958          -0.820   
                                                                                                                  (-0.37)         (-1.16)         (-1.29)   

xrd                                                                                                                                 0.699           0.210   
                                                                                                                                   (0.84)          (0.35)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16226           16226           16165           16165           16165           16013            6535            3853           16013   
Firms                3328            3328            3318            3318            3318            3297            1427             856            3297   
R^2              2.17e-08          0.0158          0.0615          0.0622          0.0622          0.0625          0.0125          0.0298          0.0629   
AIC              311297.1        311056.8        309180.7        309170.6        309170.6        306408.4        123932.3         74539.9        306404.3   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
humrts_supchain_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
humrts_sup~m        3.280           2.083           6.599*          6.702*          6.702*          6.945*          8.381           9.728   
                   (1.05)          (0.60)          (2.07)          (2.10)          (2.10)          (2.15)          (1.89)          (1.89)   

dltt                                              -0.0255***      -0.0196***      -0.0196***      -0.0190***     -0.00185         -0.0698   
                                                 (-10.04)         (-3.46)         (-3.46)         (-3.36)         (-0.03)         (-0.63)   

at                                                               -0.00658        -0.00658        -0.00734         -0.0142*        -0.0213   
                                                                  (-1.22)         (-1.22)         (-1.37)         (-2.07)         (-0.47)   

age                                                                                 207.7***        204.9***        113.4**         181.3***
                                                                                   (5.86)          (5.72)          (3.00)          (3.91)   

emp                                                                                               0.00959          0.0106         0.00775   
                                                                                                   (0.89)          (0.91)          (0.68)   

xad                                                                                                                -0.127          -1.129   
                                                                                                                  (-0.08)         (-0.84)   

xrd                                                                                                                                 1.065   
                                                                                                                                   (1.53)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        20719           20719           20635           20635           20635           20399            8408            4844   
Firms                3910            3910            3902            3902            3902            3867            1698             994   
R^2             0.0000531          0.0122          0.0574          0.0581          0.0581          0.0586          0.0106          0.0188   
AIC              392425.9        392190.6        389718.3        389705.4        389705.4        385467.0        157088.2         92460.9   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(59,789 real changes made)
(57,335 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
humrts_sup~m        3.280           2.083           6.599*          6.702*          6.702*          6.945*          8.381           9.728           6.900*  
                   (1.05)          (0.60)          (2.07)          (2.10)          (2.10)          (2.15)          (1.89)          (1.89)          (2.14)   

dltt                                              -0.0255***      -0.0196***      -0.0196***      -0.0190***     -0.00185         -0.0698         -0.0190***
                                                 (-10.04)         (-3.46)         (-3.46)         (-3.36)         (-0.03)         (-0.63)         (-3.30)   

at                                                               -0.00658        -0.00658        -0.00734         -0.0142*        -0.0213        -0.00745   
                                                                  (-1.22)         (-1.22)         (-1.37)         (-2.07)         (-0.47)         (-1.36)   

age                                                                                 207.7***        204.9***        113.4**         181.3***        203.8***
                                                                                   (5.86)          (5.72)          (3.00)          (3.91)          (5.66)   

emp                                                                                               0.00959          0.0106         0.00775         0.00928   
                                                                                                   (0.89)          (0.91)          (0.68)          (1.14)   

xad                                                                                                                -0.127          -1.129          -0.631   
                                                                                                                  (-0.08)         (-0.84)         (-1.11)   

xrd                                                                                                                                 1.065           0.285   
                                                                                                                                   (1.53)          (0.48)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        20719           20719           20635           20635           20635           20399            8408            4844           20399   
Firms                3910            3910            3902            3902            3902            3867            1698             994            3867   
R^2             0.0000531          0.0122          0.0574          0.0581          0.0581          0.0586          0.0106          0.0188          0.0590   
AIC              392425.9        392190.6        389718.3        389705.4        389705.4        385467.0        157088.2         92460.9        385462.5   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
comp_ben_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
comp_ben_r~m       -3.685           3.646           7.018*          7.018*          7.018*          7.484*          9.222           6.822   
                  (-1.39)          (1.03)          (2.40)          (2.39)          (2.39)          (2.53)          (1.69)          (1.65)   

dltt                                              -0.0249***      -0.0247***      -0.0247***      -0.0240***       0.0321          -0.212   
                                                 (-10.27)         (-3.98)         (-3.98)         (-3.95)          (0.40)         (-1.10)   

at                                                              -0.000135       -0.000135        -0.00101        -0.00694          0.0521   
                                                                  (-0.02)         (-0.02)         (-0.16)         (-0.77)          (0.57)   

age                                                                                 162.8***        158.5***        75.29           179.9***
                                                                                   (5.18)          (4.89)          (1.67)          (3.81)   

emp                                                                                                0.0114          0.0108         0.00407   
                                                                                                   (1.01)          (0.94)          (0.33)   

xad                                                                                                                -0.323          -1.770   
                                                                                                                  (-0.18)         (-1.03)   

xrd                                                                                                                                 0.758   
                                                                                                                                   (0.93)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        19895           19895           19815           19815           19815           19614            8070            4691   
Firms                3688            3688            3679            3679            3679            3652            1610             960   
R^2              0.000117          0.0105          0.0515          0.0515          0.0515          0.0521         0.00632          0.0229   
AIC              378585.8        378396.0        376116.9        376118.9        376118.9        372486.4        152264.8         89852.3   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(53,417 real changes made)
(51,013 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
comp_ben_r~m       -3.685           3.646           7.018*          7.018*          7.018*          7.484*          9.222           6.822           7.513*  
                  (-1.39)          (1.03)          (2.40)          (2.39)          (2.39)          (2.53)          (1.69)          (1.65)          (2.55)   

dltt                                              -0.0249***      -0.0247***      -0.0247***      -0.0240***       0.0321          -0.212         -0.0240***
                                                 (-10.27)         (-3.98)         (-3.98)         (-3.95)          (0.40)         (-1.10)         (-3.88)   

at                                                              -0.000135       -0.000135        -0.00101        -0.00694          0.0521        -0.00106   
                                                                  (-0.02)         (-0.02)         (-0.16)         (-0.77)          (0.57)         (-0.16)   

age                                                                                 162.8***        158.5***        75.29           179.9***        157.7***
                                                                                   (5.18)          (4.89)          (1.67)          (3.81)          (4.85)   

emp                                                                                                0.0114          0.0108         0.00407          0.0114   
                                                                                                   (1.01)          (0.94)          (0.33)          (1.29)   

xad                                                                                                                -0.323          -1.770          -0.516   
                                                                                                                  (-0.18)         (-1.03)         (-0.80)   

xrd                                                                                                                                 0.758           0.208   
                                                                                                                                   (0.93)          (0.35)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        19895           19895           19815           19815           19815           19614            8070            4691           19614   
Firms                3688            3688            3679            3679            3679            3652            1610             960            3652   
R^2              0.000117          0.0105          0.0515          0.0515          0.0515          0.0521         0.00632          0.0229          0.0524   
AIC              378585.8        378396.0        376116.9        376118.9        376118.9        372486.4        152264.8         89852.3        372485.7   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
div_lab_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
div_lab_rt~m        0.338           4.158           12.28**         12.26**         12.26**         13.06**         13.34*          17.01*  
                   (0.09)          (0.78)          (2.80)          (2.83)          (2.83)          (3.09)          (2.29)          (1.99)   

dltt                                              -0.0249***      -0.0243***      -0.0243***      -0.0234***       0.0412         -0.0683   
                                                 (-10.31)         (-3.99)         (-3.99)         (-3.94)          (0.52)         (-0.62)   

at                                                              -0.000748       -0.000748        -0.00180         -0.0107         -0.0210   
                                                                  (-0.11)         (-0.11)         (-0.29)         (-1.62)         (-0.46)   

age                                                                                 156.1***        150.9***        60.99           155.9***
                                                                                   (5.14)          (4.83)          (1.42)          (4.00)   

emp                                                                                                0.0132          0.0121         0.00805   
                                                                                                   (1.19)          (1.03)          (0.71)   

xad                                                                                                                -0.115          -1.149   
                                                                                                                  (-0.07)         (-0.86)   

xrd                                                                                                                                 1.075   
                                                                                                                                   (1.53)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21083           21083           20999           20999           20999           20763            8567            4937   
Firms                3869            3869            3861            3861            3861            3832            1694             989   
R^2           0.000000543          0.0102          0.0516          0.0516          0.0516          0.0524         0.00752          0.0186   
AIC              399788.3        399590.5        397186.2        397188.0        397188.0        392935.5        160867.2         94143.8   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(57,138 real changes made)
(54,626 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
div_lab_rt~m        0.338           4.158           12.28**         12.26**         12.26**         13.06**         13.34*          17.01*          13.09** 
                   (0.09)          (0.78)          (2.80)          (2.83)          (2.83)          (3.09)          (2.29)          (1.99)          (3.10)   

dltt                                              -0.0249***      -0.0243***      -0.0243***      -0.0234***       0.0412         -0.0683         -0.0234***
                                                 (-10.31)         (-3.99)         (-3.99)         (-3.94)          (0.52)         (-0.62)         (-3.89)   

at                                                              -0.000748       -0.000748        -0.00180         -0.0107         -0.0210        -0.00185   
                                                                  (-0.11)         (-0.11)         (-0.29)         (-1.62)         (-0.46)         (-0.29)   

age                                                                                 156.1***        150.9***        60.99           155.9***        150.2***
                                                                                   (5.14)          (4.83)          (1.42)          (4.00)          (4.80)   

emp                                                                                                0.0132          0.0121         0.00805          0.0130   
                                                                                                   (1.19)          (1.03)          (0.71)          (1.47)   

xad                                                                                                                -0.115          -1.149          -0.425   
                                                                                                                  (-0.07)         (-0.86)         (-0.74)   

xrd                                                                                                                                 1.075           0.187   
                                                                                                                                   (1.53)          (0.32)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21083           21083           20999           20999           20999           20763            8567            4937           20763   
Firms                3869            3869            3861            3861            3861            3832            1694             989            3832   
R^2           0.000000543          0.0102          0.0516          0.0516          0.0516          0.0524         0.00752          0.0186          0.0526   
AIC              399788.3        399590.5        397186.2        397188.0        397188.0        392935.5        160867.2         94143.8        392935.9   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
train_hlth_safe_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
train_hlth~m       -3.930           3.270           9.204*          9.214*          9.214*          9.583*          11.87*          11.44*  
                  (-1.13)          (0.76)          (2.43)          (2.43)          (2.43)          (2.52)          (2.49)          (2.06)   

dltt                                              -0.0250***      -0.0236***      -0.0236***      -0.0229***       0.0461        0.000199   
                                                 (-10.21)         (-3.75)         (-3.75)         (-3.73)          (0.58)          (0.00)   

at                                                               -0.00165        -0.00165        -0.00243         -0.0122         -0.0518   
                                                                  (-0.25)         (-0.25)         (-0.37)         (-1.87)         (-0.90)   

age                                                                                 168.4***        164.5***        64.05           165.1***
                                                                                   (4.92)          (4.67)          (1.37)          (3.81)   

emp                                                                                                0.0105         0.00899         0.00642   
                                                                                                   (0.98)          (0.86)          (0.63)   

xad                                                                                                                0.0993          -0.363   
                                                                                                                   (0.07)         (-0.38)   

xrd                                                                                                                                 1.028   
                                                                                                                                   (1.61)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        18361           18361           18288           18288           18288           18117            7354            4305   
Firms                3599            3599            3591            3591            3591            3560            1531             911   
R^2              0.000105          0.0101          0.0523          0.0523          0.0523          0.0528         0.00775          0.0170   
AIC              350505.4        350339.7        348223.9        348225.1        348225.1        345125.8        139081.4         82600.5   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(53,873 real changes made)
(51,517 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
train_hlth~m       -3.930           3.270           9.204*          9.214*          9.214*          9.583*          11.87*          11.44*          9.580*  
                  (-1.13)          (0.76)          (2.43)          (2.43)          (2.43)          (2.52)          (2.49)          (2.06)          (2.52)   

dltt                                              -0.0250***      -0.0236***      -0.0236***      -0.0229***       0.0461        0.000199         -0.0228***
                                                 (-10.21)         (-3.75)         (-3.75)         (-3.73)          (0.58)          (0.00)         (-3.70)   

at                                                               -0.00165        -0.00165        -0.00243         -0.0122         -0.0518        -0.00261   
                                                                  (-0.25)         (-0.25)         (-0.37)         (-1.87)         (-0.90)         (-0.40)   

age                                                                                 168.4***        164.5***        64.05           165.1***        163.9***
                                                                                   (4.92)          (4.67)          (1.37)          (3.81)          (4.66)   

emp                                                                                                0.0105         0.00899         0.00642         0.00934   
                                                                                                   (0.98)          (0.86)          (0.63)          (1.09)   

xad                                                                                                                0.0993          -0.363        -0.00148   
                                                                                                                   (0.07)         (-0.38)         (-0.00)   

xrd                                                                                                                                 1.028           0.157   
                                                                                                                                   (1.61)          (0.26)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        18361           18361           18288           18288           18288           18117            7354            4305           18117   
Firms                3599            3599            3591            3591            3591            3560            1531             911            3560   
R^2              0.000105          0.0101          0.0523          0.0523          0.0523          0.0528         0.00775          0.0170          0.0529   
AIC              350505.4        350339.7        348223.9        348225.1        348225.1        345125.8        139081.4         82600.5        345128.4   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
enrgy_climchge_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
enrgy_clim~m       -0.769          -10.48*         -6.833          -6.604          -6.604          -6.712          -0.981           1.702   
                  (-0.28)         (-2.23)         (-1.81)         (-1.75)         (-1.75)         (-1.76)         (-0.18)          (0.23)   

dltt                                              -0.0256***      -0.0192**       -0.0192**       -0.0188**       -0.0120          -0.216   
                                                  (-9.90)         (-3.24)         (-3.24)         (-3.16)         (-0.19)         (-1.12)   

at                                                               -0.00724        -0.00724        -0.00773         -0.0112          0.0510   
                                                                  (-1.28)         (-1.28)         (-1.37)         (-1.28)          (0.57)   

age                                                                                 328.2***        326.3***        174.9*          310.6** 
                                                                                   (4.61)          (4.55)          (2.25)          (2.98)   

emp                                                                                               0.00678         0.00882         0.00381   
                                                                                                   (0.64)          (0.78)          (0.30)   

xad                                                                                                                -0.555          -1.820   
                                                                                                                  (-0.31)         (-1.06)   

xrd                                                                                                                                 0.660   
                                                                                                                                   (0.80)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        17088           17088           17021           17021           17021           16853            6778            3987   
Firms                3598            3598            3588            3588            3588            3555            1517             891   
R^2            0.00000409          0.0157          0.0614          0.0622          0.0622          0.0624          0.0114          0.0273   
AIC              326935.7        326682.6        324661.7        324649.2        324649.2        321603.9        128267.3         76979.5   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(56,020 real changes made)
(53,878 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
enrgy_clim~m       -0.769          -10.48*         -6.833          -6.604          -6.604          -6.712          -0.981           1.702          -6.938   
                  (-0.28)         (-2.23)         (-1.81)         (-1.75)         (-1.75)         (-1.76)         (-0.18)          (0.23)         (-1.79)   

dltt                                              -0.0256***      -0.0192**       -0.0192**       -0.0188**       -0.0120          -0.216         -0.0188** 
                                                  (-9.90)         (-3.24)         (-3.24)         (-3.16)         (-0.19)         (-1.12)         (-3.12)   

at                                                               -0.00724        -0.00724        -0.00773         -0.0112          0.0510        -0.00768   
                                                                  (-1.28)         (-1.28)         (-1.37)         (-1.28)          (0.57)         (-1.33)   

age                                                                                 328.2***        326.3***        174.9*          310.6**         325.9***
                                                                                   (4.61)          (4.55)          (2.25)          (2.98)          (4.52)   

emp                                                                                               0.00678         0.00882         0.00381         0.00756   
                                                                                                   (0.64)          (0.78)          (0.30)          (0.91)   

xad                                                                                                                -0.555          -1.820          -0.806   
                                                                                                                  (-0.31)         (-1.06)         (-1.26)   

xrd                                                                                                                                 0.660           0.207   
                                                                                                                                   (0.80)          (0.34)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        17088           17088           17021           17021           17021           16853            6778            3987           16853   
Firms                3598            3598            3588            3588            3588            3555            1517             891            3555   
R^2            0.00000409          0.0157          0.0614          0.0622          0.0622          0.0624          0.0114          0.0273          0.0629   
AIC              326935.7        326682.6        324661.7        324649.2        324649.2        321603.9        128267.3         76979.5        321599.7   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
enviro_pol_rpt_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
enviro_pol~m       -0.856           8.206**         8.756**         9.113**         9.113**         9.343**         14.53**         19.11*  
                  (-0.39)          (2.76)          (3.04)          (3.14)          (3.14)          (3.22)          (2.59)          (2.50)   

dltt                                              -0.0430***      -0.0354***      -0.0354***      -0.0349***     -0.00366         -0.0716   
                                                 (-10.39)         (-5.44)         (-5.44)         (-5.38)         (-0.06)         (-0.63)   

at                                                               -0.00840        -0.00840        -0.00913         -0.0146*        -0.0242   
                                                                  (-1.48)         (-1.48)         (-1.61)         (-2.10)         (-0.54)   

age                                                                                 379.4***        375.1***        147.2           314.6** 
                                                                                   (4.33)          (4.27)          (1.67)          (2.83)   

emp                                                                                               0.00980          0.0100         0.00788   
                                                                                                   (0.92)          (0.87)          (0.69)   

xad                                                                                                                -0.226          -1.044   
                                                                                                                  (-0.14)         (-0.78)   

xrd                                                                                                                                 1.018   
                                                                                                                                   (1.46)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        14930           14930           14876           14876           14876           14753            6024            3498   
Firms                3315            3315            3305            3305            3305            3283            1407             835   
R^2            0.00000469          0.0177           0.104           0.105           0.105           0.105          0.0127          0.0251   
AIC              287439.3        287191.4        284841.4        284826.2        284826.2        282584.0        114469.0         67862.9   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(43,844 real changes made)
(42,081 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
enviro_pol~m       -0.856           8.206**         8.756**         9.113**         9.113**         9.343**         14.53**         19.11*          9.320** 
                  (-0.39)          (2.76)          (3.04)          (3.14)          (3.14)          (3.22)          (2.59)          (2.50)          (3.22)   

dltt                                              -0.0430***      -0.0354***      -0.0354***      -0.0349***     -0.00366         -0.0716         -0.0349***
                                                 (-10.39)         (-5.44)         (-5.44)         (-5.38)         (-0.06)         (-0.63)         (-5.33)   

at                                                               -0.00840        -0.00840        -0.00913         -0.0146*        -0.0242        -0.00919   
                                                                  (-1.48)         (-1.48)         (-1.61)         (-2.10)         (-0.54)         (-1.59)   

age                                                                                 379.4***        375.1***        147.2           314.6**         373.4***
                                                                                   (4.33)          (4.27)          (1.67)          (2.83)          (4.23)   

emp                                                                                               0.00980          0.0100         0.00788         0.00975   
                                                                                                   (0.92)          (0.87)          (0.69)          (1.15)   

xad                                                                                                                -0.226          -1.044          -0.673   
                                                                                                                  (-0.14)         (-0.78)         (-1.20)   

xrd                                                                                                                                 1.018           0.265   
                                                                                                                                   (1.46)          (0.46)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        14930           14930           14876           14876           14876           14753            6024            3498           14753   
Firms                3315            3315            3305            3305            3305            3283            1407             835            3283   
R^2            0.00000469          0.0177           0.104           0.105           0.105           0.105          0.0127          0.0251           0.106   
AIC              287439.3        287191.4        284841.4        284826.2        284826.2        282584.0        114469.0         67862.9        282581.6   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
resource_mgmt_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
resource_m~m       -7.716*          5.177           9.136**         9.591**         9.591**         9.858**         11.00           20.57   
                  (-2.22)          (1.31)          (2.84)          (2.91)          (2.91)          (3.01)          (1.76)          (1.84)   

dltt                                              -0.0430***      -0.0358***      -0.0358***      -0.0352***     -0.00379         -0.0718   
                                                 (-10.39)         (-5.52)         (-5.52)         (-5.47)         (-0.06)         (-0.64)   

at                                                               -0.00808        -0.00808        -0.00876         -0.0143*        -0.0241   
                                                                  (-1.43)         (-1.43)         (-1.56)         (-2.06)         (-0.54)   

age                                                                                 329.1***        324.8***        151.0*          306.3** 
                                                                                   (4.93)          (4.84)          (2.16)          (3.25)   

emp                                                                                               0.00919          0.0101         0.00804   
                                                                                                   (0.88)          (0.88)          (0.70)   

xad                                                                                                                -0.256          -1.013   
                                                                                                                  (-0.16)         (-0.76)   

xrd                                                                                                                                 1.011   
                                                                                                                                   (1.46)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16297           16297           16233           16233           16233           16100            6611            3938   
Firms                3409            3409            3398            3398            3398            3377            1456             872   
R^2              0.000332          0.0158           0.102           0.103           0.103           0.103          0.0117          0.0233   
AIC              312340.2        312103.3        309454.8        309439.4        309439.4        307026.9        125035.9         75937.9   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(45,245 real changes made)
(43,045 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
resource_m~m       -7.716*          5.177           9.136**         9.591**         9.591**         9.858**         11.00           20.57           9.724** 
                  (-2.22)          (1.31)          (2.84)          (2.91)          (2.91)          (3.01)          (1.76)          (1.84)          (2.98)   

dltt                                              -0.0430***      -0.0358***      -0.0358***      -0.0352***     -0.00379         -0.0718         -0.0352***
                                                 (-10.39)         (-5.52)         (-5.52)         (-5.47)         (-0.06)         (-0.64)         (-5.41)   

at                                                               -0.00808        -0.00808        -0.00876         -0.0143*        -0.0241        -0.00884   
                                                                  (-1.43)         (-1.43)         (-1.56)         (-2.06)         (-0.54)         (-1.55)   

age                                                                                 329.1***        324.8***        151.0*          306.3**         322.8***
                                                                                   (4.93)          (4.84)          (2.16)          (3.25)          (4.79)   

emp                                                                                               0.00919          0.0101         0.00804         0.00902   
                                                                                                   (0.88)          (0.88)          (0.70)          (1.10)   

xad                                                                                                                -0.256          -1.013          -0.638   
                                                                                                                  (-0.16)         (-0.76)         (-1.15)   

xrd                                                                                                                                 1.011           0.273   
                                                                                                                                   (1.46)          (0.47)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        16297           16297           16233           16233           16233           16100            6611            3938           16100   
Firms                3409            3409            3398            3398            3398            3377            1456             872            3377   
R^2              0.000332          0.0158           0.102           0.103           0.103           0.103          0.0117          0.0233           0.104   
AIC              312340.2        312103.3        309454.8        309439.4        309439.4        307026.9        125035.9         75937.9        307024.1   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
board_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
board_rtg_~m        1.576           0.584          -0.332          -0.340          -0.340          -0.200           1.261          -6.386   
                   (0.57)          (0.21)         (-0.13)         (-0.13)         (-0.13)         (-0.07)          (0.30)         (-1.06)   

dltt                                              -0.0248***      -0.0246***      -0.0246***      -0.0239***       0.0310          -0.215   
                                                 (-10.23)         (-3.96)         (-3.96)         (-3.93)          (0.39)         (-1.11)   

at                                                              -0.000180       -0.000180        -0.00102        -0.00701          0.0531   
                                                                  (-0.03)         (-0.03)         (-0.16)         (-0.77)          (0.58)   

age                                                                                 159.3***        155.2***        77.88           169.7***
                                                                                   (5.53)          (5.21)          (1.88)          (3.97)   

emp                                                                                                0.0110          0.0107         0.00380   
                                                                                                   (0.97)          (0.92)          (0.31)   

xad                                                                                                                -0.368          -1.729   
                                                                                                                  (-0.20)         (-1.00)   

xrd                                                                                                                                 0.704   
                                                                                                                                   (0.86)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        19806           19806           19727           19727           19727           19521            7980            4591   
Firms                3874            3874            3864            3864            3864            3827            1678             965   
R^2             0.0000119          0.0105          0.0513          0.0513          0.0513          0.0519         0.00604          0.0224   
AIC              376996.3        376804.9        374551.9        374553.9        374553.9        370832.4        150663.0         88038.6   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(55,248 real changes made)
(52,835 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
board_rtg_~m        1.576           0.584          -0.332          -0.340          -0.340          -0.200           1.261          -6.386          -0.169   
                   (0.57)          (0.21)         (-0.13)         (-0.13)         (-0.13)         (-0.07)          (0.30)         (-1.06)         (-0.06)   

dltt                                              -0.0248***      -0.0246***      -0.0246***      -0.0239***       0.0310          -0.215         -0.0240***
                                                 (-10.23)         (-3.96)         (-3.96)         (-3.93)          (0.39)         (-1.11)         (-3.87)   

at                                                              -0.000180       -0.000180        -0.00102        -0.00701          0.0531        -0.00101   
                                                                  (-0.03)         (-0.03)         (-0.16)         (-0.77)          (0.58)         (-0.15)   

age                                                                                 159.3***        155.2***        77.88           169.7***        154.6***
                                                                                   (5.53)          (5.21)          (1.88)          (3.97)          (5.17)   

emp                                                                                                0.0110          0.0107         0.00380          0.0112   
                                                                                                   (0.97)          (0.92)          (0.31)          (1.26)   

xad                                                                                                                -0.368          -1.729          -0.511   
                                                                                                                  (-0.20)         (-1.00)         (-0.80)   

xrd                                                                                                                                 0.704           0.168   
                                                                                                                                   (0.86)          (0.28)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        19806           19806           19727           19727           19727           19521            7980            4591           19521   
Firms                3874            3874            3864            3864            3864            3827            1678             965            3827   
R^2             0.0000119          0.0105          0.0513          0.0513          0.0513          0.0519         0.00604          0.0224          0.0521   
AIC              376996.3        376804.9        374551.9        374553.9        374553.9        370832.4        150663.0         88038.6        370832.4   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
ldrship_ethics_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
ldrship_et~m       -7.002*         -2.036           2.080           2.072           2.072           2.398           5.347           2.056   
                  (-2.31)         (-0.61)          (0.65)          (0.64)          (0.64)          (0.73)          (1.32)          (0.44)   

dltt                                              -0.0248***      -0.0249***      -0.0249***      -0.0242***       0.0316          -0.214   
                                                 (-10.26)         (-4.04)         (-4.04)         (-4.00)          (0.40)         (-1.11)   

at                                                               0.000178        0.000178       -0.000722        -0.00715          0.0530   
                                                                   (0.03)          (0.03)         (-0.11)         (-0.79)          (0.58)   

age                                                                                 162.9***        159.4***        85.53*          176.6***
                                                                                   (5.49)          (5.22)          (2.08)          (3.83)   

emp                                                                                                0.0113          0.0106         0.00379   
                                                                                                   (1.02)          (0.92)          (0.31)   

xad                                                                                                                -0.364          -1.740   
                                                                                                                  (-0.20)         (-1.01)   

xrd                                                                                                                                 0.709   
                                                                                                                                   (0.86)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21413           21413           21327           21327           21327           21082            8670            4975   
Firms                4025            4025            4016            4016            4016            3979            1757            1017   
R^2              0.000237          0.0103          0.0509          0.0509          0.0509          0.0516         0.00590          0.0218   
AIC              405974.1        405774.7        403338.5        403340.5        403340.5        398930.5        162977.9         95005.0   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(63,619 real changes made)
(61,118 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
ldrship_et~m       -7.002*         -2.036           2.080           2.072           2.072           2.398           5.347           2.056           2.323   
                  (-2.31)         (-0.61)          (0.65)          (0.64)          (0.64)          (0.73)          (1.32)          (0.44)          (0.71)   

dltt                                              -0.0248***      -0.0249***      -0.0249***      -0.0242***       0.0316          -0.214         -0.0242***
                                                 (-10.26)         (-4.04)         (-4.04)         (-4.00)          (0.40)         (-1.11)         (-3.94)   

at                                                               0.000178        0.000178       -0.000722        -0.00715          0.0530       -0.000705   
                                                                   (0.03)          (0.03)         (-0.11)         (-0.79)          (0.58)         (-0.11)   

age                                                                                 162.9***        159.4***        85.53*          176.6***        158.8***
                                                                                   (5.49)          (5.22)          (2.08)          (3.83)          (5.17)   

emp                                                                                                0.0113          0.0106         0.00379          0.0116   
                                                                                                   (1.02)          (0.92)          (0.31)          (1.33)   

xad                                                                                                                -0.364          -1.740          -0.517   
                                                                                                                  (-0.20)         (-1.01)         (-0.81)   

xrd                                                                                                                                 0.709           0.159   
                                                                                                                                   (0.86)          (0.26)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        21413           21413           21327           21327           21327           21082            8670            4975           21082   
Firms                4025            4025            4016            4016            4016            3979            1757            1017            3979   
R^2              0.000237          0.0103          0.0509          0.0509          0.0509          0.0516         0.00590          0.0218          0.0518   
AIC              405974.1        405774.7        403338.5        403340.5        403340.5        398930.5        162977.9         95005.0        398930.2   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
trans_report_rtg_lym

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

added macro:
             e(yearFE) : "Yes"

added macro:
             e(firmFE) : "Yes"

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
--------------------------------------------------------------------------------------------------------------------------------------------
trans_repo~m       -4.165           0.761           4.208*          4.220*          4.220*          4.326*          4.907           2.103   
                  (-1.92)          (0.28)          (2.08)          (2.13)          (2.13)          (2.13)          (1.20)          (0.41)   

dltt                                              -0.0248***      -0.0246***      -0.0246***      -0.0239***       0.0302          -0.215   
                                                 (-10.24)         (-3.96)         (-3.96)         (-3.92)          (0.38)         (-1.10)   

at                                                              -0.000282       -0.000282        -0.00113        -0.00706          0.0525   
                                                                  (-0.04)         (-0.04)         (-0.18)         (-0.78)          (0.58)   

age                                                                                 169.7***        165.6***        85.80*          177.1***
                                                                                   (5.68)          (5.39)          (1.97)          (3.58)   

emp                                                                                                0.0111          0.0107         0.00392   
                                                                                                   (0.99)          (0.93)          (0.32)   

xad                                                                                                                -0.338          -1.733   
                                                                                                                  (-0.19)         (-1.01)   

xrd                                                                                                                                 0.733   
                                                                                                                                   (0.89)   
--------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        20040           20040           19962           19962           19962           19749            8077            4643   
Firms                3892            3892            3884            3884            3884            3847            1684             971   
R^2              0.000155          0.0105          0.0514          0.0514          0.0514          0.0520         0.00613          0.0223   
AIC              381220.4        381029.6        378783.2        378785.1        378785.1        374939.6        152393.8         88982.1   
--------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(59,035 real changes made)
(56,629 real changes made)

------------------------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
               F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy      F.revt_yoy   
------------------------------------------------------------------------------------------------------------------------------------------------------------
trans_repo~m       -4.165           0.761           4.208*          4.220*          4.220*          4.326*          4.907           2.103           4.273*  
                  (-1.92)          (0.28)          (2.08)          (2.13)          (2.13)          (2.13)          (1.20)          (0.41)          (2.10)   

dltt                                              -0.0248***      -0.0246***      -0.0246***      -0.0239***       0.0302          -0.215         -0.0239***
                                                 (-10.24)         (-3.96)         (-3.96)         (-3.92)          (0.38)         (-1.10)         (-3.86)   

at                                                              -0.000282       -0.000282        -0.00113        -0.00706          0.0525        -0.00115   
                                                                  (-0.04)         (-0.04)         (-0.18)         (-0.78)          (0.58)         (-0.18)   

age                                                                                 169.7***        165.6***        85.80*          177.1***        164.9***
                                                                                   (5.68)          (5.39)          (1.97)          (3.58)          (5.34)   

emp                                                                                                0.0111          0.0107         0.00392          0.0112   
                                                                                                   (0.99)          (0.93)          (0.32)          (1.27)   

xad                                                                                                                -0.338          -1.733          -0.504   
                                                                                                                  (-0.19)         (-1.01)         (-0.79)   

xrd                                                                                                                                 0.733           0.182   
                                                                                                                                   (0.89)          (0.30)   
------------------------------------------------------------------------------------------------------------------------------------------------------------
Year FEs               No             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Firm FEs              Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes             Yes   
Observations        20040           20040           19962           19962           19962           19749            8077            4643           19749   
Firms                3892            3892            3884            3884            3884            3847            1684             971            3847   
R^2              0.000155          0.0105          0.0514          0.0514          0.0514          0.0520         0.00613          0.0223          0.0522   
AIC              381220.4        381029.6        378783.2        378785.1        378785.1        374939.6        152393.8         88982.1        374939.4   
------------------------------------------------------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. 
. capt n log close
      name:  <unnamed>
       log:  D:\Dropbox\papers\active\dissertation-csrhub\project\logs/20190122-yearly-analysis.txt
  log type:  text
 closed on:  22 Jan 2019, 15:45:05
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
