------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Dropbox\papers\active\dissertation-csrhub\project\logs\mediation-analysis-2.txt
  log type:  text
 opened on:   7 Nov 2018, 14:21:46

.                                 ***=============================***
.                                 ***             RUN MEDIATION ANALYSIS  ***
.                                 ***              WITH NEW DATASET               ***
.                                 ***=============================***
. ///     LOAD DATA
> use data\csrhub-kld-cstat-with-crosswalk-exact-stnd_firm-ym-matches-clean.dta, clear
(CSRHub Data December 2008 - September 2017)

. 
. ///     ALL INDUSTRIES
> *       Y = ni
. *       X = over_rtg
. *       M = net_kld
. *mark medall
. *markout medall ni over_rtg net_kld year debt rd ad
. 
. ///     BARON AND KINNY MEDIATION ANALYSIS
> 
. ***     All industries
. ***     Net KLD strengths
. *Main relationship
. xtreg ni over_rtg emp debt rd ad i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =      3,180
Group variable: firm_n                          Number of groups  =        733

R-sq:                                           Obs per group:
     within  = 0.0469                                         min =          1
     between = 0.1168                                         avg =        4.3
     overall = 0.1106                                         max =          9

                                                F(14,732)         =       5.39
corr(u_i, Xb)  = 0.1420                         Prob > F          =     0.0000

                               (Std. Err. adjusted for 733 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   4.295926   5.792622     0.74   0.459    -7.076207    15.66806
         emp |   9.883553   8.131809     1.22   0.225    -6.080896      25.848
        debt |   88.32267   345.0399     0.26   0.798    -589.0632    765.7085
          rd |  -.3271537   .8459268    -0.39   0.699    -1.987886    1.333578
          ad |   21.49572   27.49401     0.78   0.435     -32.4808    75.47225
             |
        year |
       2009  |   1055.642   711.7936     1.48   0.138    -341.7583    2453.043
       2010  |    1605.61   752.1227     2.13   0.033     129.0354    3082.185
       2011  |   1719.629   788.2207     2.18   0.029     172.1867    3267.072
       2012  |   1689.011   735.8138     2.30   0.022      244.454    3133.568
       2013  |    1760.78   726.2821     2.42   0.016      334.936    3186.625
       2014  |   1736.586   717.5512     2.42   0.016     327.8823     3145.29
       2015  |   1788.169   735.6261     2.43   0.015       343.98    3232.357
       2016  |    1785.39   731.9476     2.44   0.015     348.4229    3222.357
       2017  |   1899.895   751.9804     2.53   0.012      423.599     3376.19
             |
       _cons |   -1458.51   844.1992    -1.73   0.084     -3115.85    198.8305
-------------+----------------------------------------------------------------
     sigma_u |  1802.6109
     sigma_e |  1340.7397
         rho |  .64383062   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo m1_ni

. 
. *Mediator predicting independent variable
. xtreg net_kld_str over_rtg emp debt rd ad i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.1754                                         min =          1
     between = 0.0073                                         avg =        3.8
     overall = 0.0340                                         max =          8

                                                F(12,600)         =      19.08
corr(u_i, Xb)  = -0.4757                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 601 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
 net_kld_str |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   .0684441   .0103691     6.60   0.000     .0480799    .0888083
         emp |   .0037432   .0046238     0.81   0.419    -.0053377    .0128241
        debt |   .1475026   .4937197     0.30   0.765    -.8221262    1.117131
          rd |  -.2272662   .2140278    -1.06   0.289    -.6476008    .1930684
          ad |   .4813093   .4544085     1.06   0.290    -.4111152    1.373734
             |
        year |
       2009  |   .1819736   .2351514     0.77   0.439    -.2798463    .6437936
       2010  |   1.931611   .3065029     6.30   0.000     1.329662     2.53356
       2011  |   1.706179   .3076101     5.55   0.000     1.102055    2.310302
       2012  |   .9451195   .3332682     2.84   0.005     .2906056    1.599633
       2013  |   .7136659   .3408766     2.09   0.037     .0442096    1.383122
       2014  |  -.4270636   .3557607    -1.20   0.230    -1.125751    .2716238
       2015  |   .2903848   .3486194     0.83   0.405    -.3942778    .9750474
             |
       _cons |  -1.897834    .631392    -3.01   0.003    -3.137841   -.6578275
-------------+----------------------------------------------------------------
     sigma_u |  4.9978707
     sigma_e |    1.58387
         rho |  .90873461   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo m1_net_kld

. 
. *Mediation analysis
. xtreg ni over_rtg net_kld_str emp debt rd ad i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.0475                                         min =          1
     between = 0.1706                                         avg =        3.8
     overall = 0.1603                                         max =          8

                                                F(13,600)         =       1.95
corr(u_i, Xb)  = 0.2193                         Prob > F          =     0.0226

                               (Std. Err. adjusted for 601 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |  -1.020502   8.241754    -0.12   0.901    -17.20669    15.16569
 net_kld_str |   66.39514   50.34917     1.32   0.188    -32.48689    165.2772
         emp |   8.389601   13.69342     0.61   0.540    -18.50325    35.28245
        debt |  -66.16841   333.5003    -0.20   0.843    -721.1382    588.8014
          rd |  -9.894811   43.93919    -0.23   0.822    -96.18812     76.3985
          ad |   28.81646   103.1313     0.28   0.780    -173.7257    231.3586
             |
        year |
       2009  |   977.6814   766.5592     1.28   0.203    -527.7839    2483.147
       2010  |    1422.06   821.3944     1.73   0.084    -191.0978    3035.217
       2011  |   1578.687   861.6566     1.83   0.067    -113.5422    3270.917
       2012  |   1608.756   807.2734     1.99   0.047     23.33101    3194.181
       2013  |   1711.522   796.0436     2.15   0.032     148.1517    3274.893
       2014  |   1768.662   789.4457     2.24   0.025     218.2498    3319.075
       2015  |   1777.848   811.3318     2.19   0.029     184.4532    3371.244
             |
       _cons |  -1123.452   904.6743    -1.24   0.215    -2900.165    653.2607
-------------+----------------------------------------------------------------
     sigma_u |  1904.4075
     sigma_e |  1509.4998
         rho |  .61414873   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo m1_med

. 
. estout m1_ni m1_net_kld m1_med, cells(b(star fmt(%9.3f)) z(par))                ///
>         stats(N  N_g r2_a, fmt(%9.0g %9.0g %9.0g %9.4g) ///
>         labels("N" "Firms" "Adj. R^2"))      ///
>         legend collabels(none) ///
>         keep(over_rtg net_kld_str emp debt rd ad _cons) ///
>         order(over_rtg net_kld_str emp debt rd ad _cons)

------------------------------------------------------------
                    m1_ni      m1_net_kld          m1_med   
------------------------------------------------------------
over_rtg            4.296           0.068***       -1.021   
                  (0.742)         (6.601)        (-0.124)   
net_kld_str                                        66.395   
                                                  (1.319)   
emp                 9.884           0.004           8.390   
                  (1.215)         (0.810)         (0.613)   
debt               88.323           0.148         -66.168   
                  (0.256)         (0.299)        (-0.198)   
rd                 -0.327          -0.227          -9.895   
                 (-0.387)        (-1.062)        (-0.225)   
ad                 21.496           0.481          28.816   
                  (0.782)         (1.059)         (0.279)   
_cons           -1458.510          -1.898**     -1123.452   
                 (-1.728)        (-3.006)        (-1.242)   
------------------------------------------------------------
N                    3180            2312            2312   
Firms                 733             601             601   
Adj. R^2         .0426863        .1710867        .0421518   
------------------------------------------------------------
* p<0.05, ** p<0.01, *** p<0.001

.         
. 
.         
. ***     All industries
. ***     Net KLD concerns
. *Main relationship
. xtreg ni over_rtg emp debt rd ad i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =      3,180
Group variable: firm_n                          Number of groups  =        733

R-sq:                                           Obs per group:
     within  = 0.0469                                         min =          1
     between = 0.1168                                         avg =        4.3
     overall = 0.1106                                         max =          9

                                                F(14,732)         =       5.39
corr(u_i, Xb)  = 0.1420                         Prob > F          =     0.0000

                               (Std. Err. adjusted for 733 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   4.295926   5.792622     0.74   0.459    -7.076207    15.66806
         emp |   9.883553   8.131809     1.22   0.225    -6.080896      25.848
        debt |   88.32267   345.0399     0.26   0.798    -589.0632    765.7085
          rd |  -.3271537   .8459268    -0.39   0.699    -1.987886    1.333578
          ad |   21.49572   27.49401     0.78   0.435     -32.4808    75.47225
             |
        year |
       2009  |   1055.642   711.7936     1.48   0.138    -341.7583    2453.043
       2010  |    1605.61   752.1227     2.13   0.033     129.0354    3082.185
       2011  |   1719.629   788.2207     2.18   0.029     172.1867    3267.072
       2012  |   1689.011   735.8138     2.30   0.022      244.454    3133.568
       2013  |    1760.78   726.2821     2.42   0.016      334.936    3186.625
       2014  |   1736.586   717.5512     2.42   0.016     327.8823     3145.29
       2015  |   1788.169   735.6261     2.43   0.015       343.98    3232.357
       2016  |    1785.39   731.9476     2.44   0.015     348.4229    3222.357
       2017  |   1899.895   751.9804     2.53   0.012      423.599     3376.19
             |
       _cons |   -1458.51   844.1992    -1.73   0.084     -3115.85    198.8305
-------------+----------------------------------------------------------------
     sigma_u |  1802.6109
     sigma_e |  1340.7397
         rho |  .64383062   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo m2_ni

. 
. *Mediator predicting independent variable
. xtreg net_kld_con over_rtg emp debt rd ad i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.4278                                         min =          1
     between = 0.2014                                         avg =        3.8
     overall = 0.2810                                         max =          8

                                                F(12,600)         =      62.37
corr(u_i, Xb)  = 0.0689                         Prob > F          =     0.0000

                               (Std. Err. adjusted for 601 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
 net_kld_con |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   .0115939    .006868     1.69   0.092    -.0018943    .0250821
         emp |  -.0009314   .0089605    -0.10   0.917    -.0185291    .0166664
        debt |   .3100011   .3619336     0.86   0.392    -.4008095    1.020812
          rd |  -.0166351   .0719848    -0.23   0.817    -.1580079    .1247377
          ad |  -.0088398   .1667224    -0.05   0.958    -.3362701    .3185905
             |
        year |
       2009  |  -.5471945   .2263557    -2.42   0.016    -.9917403   -.1026488
       2010  |  -.6233934   .2727255    -2.29   0.023    -1.159006   -.0877809
       2011  |  -1.082001   .2926333    -3.70   0.000    -1.656711   -.5072906
       2012  |  -2.583756   .2944692    -8.77   0.000    -3.162072   -2.005441
       2013  |  -2.522556   .2984861    -8.45   0.000    -3.108761   -1.936352
       2014  |  -3.103691    .294594   -10.54   0.000    -3.682252    -2.52513
       2015  |  -2.853069   .3013079    -9.47   0.000    -3.444815   -2.261322
             |
       _cons |   3.104309   .5254365     5.91   0.000     2.072391    4.136227
-------------+----------------------------------------------------------------
     sigma_u |  1.2228438
     sigma_e |  1.0460345
         rho |  .57745769   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo m2_net_kld

. 
. *Mediation analysis
. xtreg ni over_rtg net_kld_con emp debt rd ad i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.0434                                         min =          1
     between = 0.0543                                         avg =        3.8
     overall = 0.0871                                         max =          8

                                                F(13,600)         =       1.84
corr(u_i, Xb)  = 0.0995                         Prob > F          =     0.0348

                               (Std. Err. adjusted for 601 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   3.132179   7.868031     0.40   0.691    -12.32005    18.58441
 net_kld_con |   33.78288   110.5632     0.31   0.760     -183.355    250.9208
         emp |   8.669597   13.99053     0.62   0.536    -18.80676    36.14595
        debt |  -66.84768   310.0243    -0.22   0.829    -675.7124    542.0171
          rd |   -24.4222    41.6974    -0.59   0.558    -106.3128    57.46839
          ad |   61.07169    96.5253     0.63   0.527    -128.4968    250.6402
             |
        year |
       2009  |   1008.249   729.8666     1.38   0.168    -425.1543    2441.653
       2010  |   1571.369   783.5185     2.01   0.045     32.59714    3110.141
       2011  |   1728.522   811.8155     2.13   0.034     134.1771    3322.867
       2012  |   1758.794   724.8162     2.43   0.016     335.3088    3182.279
       2013  |   1844.125    712.089     2.59   0.010     445.6355    3242.615
       2014  |   1845.159   700.1387     2.64   0.009     470.1388    3220.179
       2015  |   1893.513   731.7766     2.59   0.010     456.3587    3330.668
             |
       _cons |  -1354.332   914.1026    -1.48   0.139    -3149.561    440.8978
-------------+----------------------------------------------------------------
     sigma_u |  2006.8999
     sigma_e |  1512.7477
         rho |  .63768423   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo m2_med

. 
. estout m2_ni m2_net_kld m2_med, cells(b(star fmt(%9.3f)) z(par))                ///
>         stats(N  N_g r2_a, fmt(%9.0g %9.0g %9.0g %9.4g) ///
>         labels("N" "Firms" "Adj. R^2"))      ///
>         legend collabels(none) ///
>         keep(over_rtg net_kld_con emp debt rd ad _cons) ///
>         order(over_rtg net_kld_con emp debt rd ad _cons)

------------------------------------------------------------
                    m2_ni      m2_net_kld          m2_med   
------------------------------------------------------------
over_rtg            4.296           0.012           3.132   
                  (0.742)         (1.688)         (0.398)   
net_kld_con                                        33.783   
                                                  (0.306)   
emp                 9.884          -0.001           8.670   
                  (1.215)        (-0.104)         (0.620)   
debt               88.323           0.310         -66.848   
                  (0.256)         (0.857)        (-0.216)   
rd                 -0.327          -0.017         -24.422   
                 (-0.387)        (-0.231)        (-0.586)   
ad                 21.496          -0.009          61.072   
                  (0.782)        (-0.053)         (0.633)   
_cons           -1458.510           3.104***    -1354.332   
                 (-1.728)         (5.908)        (-1.482)   
------------------------------------------------------------
N                    3180            2312            2312   
Firms                 733             601             601   
Adj. R^2         .0426863        .4248107        .0380255   
------------------------------------------------------------
* p<0.05, ** p<0.01, *** p<0.001

.         
.         
.         
. ///     WITHIN-BETWEEN RANDOM EFFECTS MODELS
> foreach variable in net_kld_str net_kld_con over_rtg emp debt rd ad {
  2.         bysort firm_n: egen `variable'_m=mean(`variable')
  3.         bysort firm_n: gen `variable'_dm=`variable'-`variable'_m
  4. }
(499123 missing values generated)
(1,002,669 missing values generated)
(499123 missing values generated)
(1,002,669 missing values generated)
(267359 missing values generated)
(492,646 missing values generated)
(733462 missing values generated)
(975,395 missing values generated)
(732635 missing values generated)
(968,756 missing values generated)
(862630 missing values generated)
(1,010,749 missing values generated)
(882993 missing values generated)
(1,022,679 missing values generated)

. 
. 
. *** All industries
. ***     Net KLD strengths
. xtreg ni over_rtg_dm over_rtg_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year, re cluster(firm_n) base

Random-effects GLS regression                   Number of obs     =      3,180
Group variable: firm_n                          Number of groups  =        733

R-sq:                                           Obs per group:
     within  = 0.0455                                         min =          1
     between = 0.1699                                         avg =        4.3
     overall = 0.1649                                         max =          9

                                                Wald chi2(19)     =      95.24
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                               (Std. Err. adjusted for 733 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 over_rtg_dm |   4.536064   5.735541     0.79   0.429    -6.705389    15.77752
  over_rtg_m |   69.03474    21.5473     3.20   0.001     26.80281    111.2667
      emp_dm |   12.05683   8.325887     1.45   0.148     -4.26161    28.37527
     debt_dm |   321.2323   277.1972     1.16   0.247    -222.0643     864.529
       rd_dm |  -.3294216    .560181    -0.59   0.556    -1.427356    .7685129
       ad_dm |   25.74001   24.24688     1.06   0.288      -21.783    73.26302
       emp_m |   18.75345   4.239012     4.42   0.000     10.44514    27.06176
      debt_m |  -486.9817   264.5172    -1.84   0.066    -1005.426    31.46251
        rd_m |  -3.411751   1.166751    -2.92   0.003    -5.698541    -1.12496
        ad_m |   2.812823   29.10864     0.10   0.923    -54.23906    59.86471
             |
        year |
       2008  |          0  (base)
       2009  |   936.3817   678.5203     1.38   0.168    -393.4937    2266.257
       2010  |   1437.908   716.8483     2.01   0.045     32.91102    2842.905
       2011  |   1517.414    751.468     2.02   0.043      44.5635    2990.264
       2012  |   1461.615    696.544     2.10   0.036     96.41366    2826.816
       2013  |   1518.134   685.8219     2.21   0.027     173.9475     2862.32
       2014  |   1475.949   675.0399     2.19   0.029     152.8953    2799.003
       2015  |   1511.774   691.4806     2.19   0.029     156.4968    2867.051
       2016  |   1502.525   687.4999     2.19   0.029     155.0496        2850
       2017  |   1665.519   713.3012     2.33   0.020     267.4746    3063.564
             |
       _cons |  -4857.485   1289.452    -3.77   0.000    -7384.765   -2330.206
-------------+----------------------------------------------------------------
     sigma_u |  1508.5796
     sigma_e |  1340.7397
         rho |  .55870156   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg net_kld_str over_rtg_dm over_rtg_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year, re cluster(firm_n) base

Random-effects GLS regression                   Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.1671                                         min =          1
     between = 0.4479                                         avg =        3.8
     overall = 0.4356                                         max =          8

                                                Wald chi2(17)     =     442.66
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                               (Std. Err. adjusted for 601 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
 net_kld_str |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 over_rtg_dm |   .0589164   .0100947     5.84   0.000     .0391311    .0787017
  over_rtg_m |   .2332816   .0297451     7.84   0.000     .1749823    .2915808
      emp_dm |   .0028988   .0050303     0.58   0.564    -.0069605    .0127581
     debt_dm |   1.199518    .447941     2.68   0.007     .3215702    2.077467
       rd_dm |   .0057124   .0089069     0.64   0.521    -.0117447    .0231695
       ad_dm |  -.0175728   .0647206    -0.27   0.786    -.1444228    .1092772
       emp_m |   .0330834   .0049478     6.69   0.000     .0233859    .0427809
      debt_m |  -1.199452   .4321397    -2.78   0.006     -2.04643   -.3524735
        rd_m |  -.0043069   .0087289    -0.49   0.622    -.0214152    .0128014
        ad_m |  -.2960549   .7375609    -0.40   0.688    -1.741648    1.149538
             |
        year |
       2008  |          0  (base)
       2009  |  -.1272286   .2659942    -0.48   0.632    -.6485677    .3941105
       2010  |   1.421004    .335442     4.24   0.000     .7635501    2.078459
       2011  |   1.114705   .3331865     3.35   0.001     .4616717    1.767739
       2012  |   .2804874     .34574     0.81   0.417    -.3971505    .9581252
       2013  |   .0756562   .3514513     0.22   0.830    -.6131758    .7644882
       2014  |  -1.047038   .3587743    -2.92   0.004    -1.750223   -.3438537
       2015  |  -.4197513    .353548    -1.19   0.235    -1.112693      .27319
             |
       _cons |  -10.72633   1.510816    -7.10   0.000    -13.68747   -7.765184
-------------+----------------------------------------------------------------
     sigma_u |  1.5692225
     sigma_e |    1.58387
         rho |  .49535465   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg ni over_rtg_dm net_kld_str_dm over_rtg_m net_kld_str_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year, re cluster(firm_n) base

Random-effects GLS regression                   Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.0461                                         min =          1
     between = 0.3308                                         avg =        3.8
     overall = 0.2974                                         max =          8

                                                Wald chi2(19)     =     223.42
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                                 (Std. Err. adjusted for 601 clusters in firm_n)
--------------------------------------------------------------------------------
               |               Robust
            ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
   over_rtg_dm |  -3.008433   7.813992    -0.39   0.700    -18.32358    12.30671
net_kld_str_dm |   74.05621   40.35846     1.83   0.067    -5.044922    153.1573
    over_rtg_m |   .2316679   16.93192     0.01   0.989    -32.95428    33.41761
 net_kld_str_m |   561.9365   124.7124     4.51   0.000     317.5046    806.3684
        emp_dm |   13.90338   12.59785     1.10   0.270    -10.78795    38.59472
       debt_dm |  -39.78763   226.3739    -0.18   0.860    -483.4723     403.897
         rd_dm |  -.1138225   4.354365    -0.03   0.979    -8.648221    8.420576
         ad_dm |  -3.083789   26.63491    -0.12   0.908    -55.28725    49.11967
         emp_m |   2.904136   4.838092     0.60   0.548     -6.57835    12.38662
        debt_m |  -243.4947   270.4819    -0.90   0.368    -773.6295    286.6401
          rd_m |   .0964843   4.239677     0.02   0.982     -8.21313    8.406098
          ad_m |   13.36397    363.961     0.04   0.971    -699.9865    726.7145
               |
          year |
         2008  |          0  (base)
         2009  |   908.2562   720.7578     1.26   0.208    -504.4031    2320.916
         2010  |   1311.222   764.1122     1.72   0.086    -186.4103    2808.855
         2011  |   1456.451   804.2506     1.81   0.070    -119.8515    3032.753
         2012  |   1492.062    755.594     1.97   0.048     11.12498    2972.999
         2013  |   1583.208   742.7624     2.13   0.033     127.4207    3038.996
         2014  |   1643.424   738.6922     2.22   0.026     195.6143    3091.235
         2015  |   1646.047    754.617     2.18   0.029     167.0253     3125.07
               |
         _cons |  -1935.042   1083.568    -1.79   0.074    -4058.796    188.7125
---------------+----------------------------------------------------------------
       sigma_u |  1404.1107
       sigma_e |  1509.4998
           rho |  .46387596   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. 
. 
. ***     Control 2-digit NAICS
. gen naics2=substr(naics,1,2)
(963,697 missing values generated)

. destring(naics2), gen(naics_2)
naics2: all characters numeric; naics_2 generated as byte
(963697 missing values generated)

. replace naics_2=31 if naics_2==32 | naics_2==33                                                                 /*      Manufacturing */
(31,094 real changes made)

. replace naics_2=44 if naics_2==45                                                                                               /*      Retail Trade    */
(1,212 real changes made)

. replace naics_2=48 if naics_2==49                                                                                               /*      Transport and Warehousing     
>   */
(128 real changes made)

. 
. fvset base 51 naics_2

. 
. *       Net KLD strengths
. xtreg ni over_rtg_dm over_rtg_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year i.naics_2, re base

Random-effects GLS regression                   Number of obs     =      3,180
Group variable: firm_n                          Number of groups  =        733

R-sq:                                           Obs per group:
     within  = 0.0454                                         min =          1
     between = 0.1997                                         avg =        4.3
     overall = 0.1953                                         max =          9

                                                Wald chi2(33)     =     323.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
          ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 over_rtg_dm |   4.841325   6.114211     0.79   0.428    -7.142308    16.82496
  over_rtg_m |   66.50088   13.63787     4.88   0.000     39.77115    93.23062
      emp_dm |   12.74134   1.930921     6.60   0.000     8.956808    16.52588
     debt_dm |   243.4406   252.5221     0.96   0.335    -251.4937    738.3749
       rd_dm |  -.0149768   5.320669    -0.00   0.998     -10.4433    10.41334
       ad_dm |   19.48608   176.7408     0.11   0.912    -326.9195    365.8916
       emp_m |    20.7551   1.911302    10.86   0.000     17.00902    24.50119
      debt_m |   -364.943   384.9014    -0.95   0.343    -1119.336      389.45
        rd_m |  -4.387946   6.494809    -0.68   0.499    -17.11754    8.341647
        ad_m |  -24.90297   187.7544    -0.13   0.894    -392.8949     343.089
             |
        year |
       2008  |          0  (base)
       2009  |   958.6801   242.4509     3.95   0.000     483.4851    1433.875
       2010  |   1471.759   232.5871     6.33   0.000     1015.897    1927.621
       2011  |   1555.345   229.3125     6.78   0.000     1105.901    2004.789
       2012  |   1502.326   227.5967     6.60   0.000     1056.245    1948.407
       2013  |    1555.21   223.9819     6.94   0.000     1116.213    1994.206
       2014  |   1516.505   224.4212     6.76   0.000     1076.648    1956.363
       2015  |   1557.734   224.0724     6.95   0.000      1118.56    1996.908
       2016  |   1546.211   224.2314     6.90   0.000     1106.725    1985.696
       2017  |   1698.128   293.2903     5.79   0.000      1123.29    2272.967
             |
     naics_2 |
         11  |    480.647   1164.609     0.41   0.680    -1801.946     2763.24
         21  |   1136.946   1236.847     0.92   0.358     -1287.23    3561.121
         23  |    362.188   1818.129     0.20   0.842    -3201.279    3925.655
         31  |   273.3832    172.678     1.58   0.113    -65.05951     611.826
         42  |  -356.0502   431.5297    -0.83   0.409    -1201.833    489.7324
         44  |  -745.7707   238.1848    -3.13   0.002    -1212.604   -278.9371
         51  |          0  (base)
         52  |  -60.04597   608.2476    -0.10   0.921    -1252.189    1132.097
         53  |   38.95825   402.1045     0.10   0.923    -749.1521    827.0686
         54  |  -210.3933   363.0154    -0.58   0.562    -921.8904    501.1038
         56  |  -445.7502   983.1771    -0.45   0.650    -2372.742    1481.242
         61  |  -302.1426   1725.711    -0.18   0.861    -3684.474    3080.189
         62  |  -207.7521   763.9857    -0.27   0.786    -1705.136    1289.632
         71  |  -106.4385   943.2327    -0.11   0.910    -1955.141    1742.264
         72  |  -639.8573   311.5401    -2.05   0.040    -1250.465   -29.24992
             |
       _cons |  -4796.349   785.2619    -6.11   0.000    -6335.434   -3257.264
-------------+----------------------------------------------------------------
     sigma_u |   1496.416
     sigma_e |  1340.7397
         rho |  .55470582   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo nis1

. 
. xtreg net_kld_str over_rtg_dm over_rtg_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year i.naics_2, re base

Random-effects GLS regression                   Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.1694                                         min =          1
     between = 0.4998                                         avg =        3.8
     overall = 0.4840                                         max =          8

                                                Wald chi2(31)     =    1059.86
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
 net_kld_str |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 over_rtg_dm |   .0615237   .0083712     7.35   0.000     .0451164     .077931
  over_rtg_m |   .2282872   .0167856    13.60   0.000      .195388    .2611864
      emp_dm |   .0050823   .0031722     1.60   0.109    -.0011352    .0112998
     debt_dm |   .9929248   .3986198     2.49   0.013     .2116443    1.774205
       rd_dm |   .0071778   .0146883     0.49   0.625    -.0216107    .0359663
       ad_dm |  -.0146427   .2389322    -0.06   0.951    -.4829411    .4536558
       emp_m |   .0352016   .0021515    16.36   0.000     .0309847    .0394186
      debt_m |  -.9738048   .5067075    -1.92   0.055    -1.966933    .0193236
        rd_m |  -.0060824   .0146296    -0.42   0.678    -.0347558     .022591
        ad_m |   -.371266    1.10154    -0.34   0.736    -2.530245    1.787713
             |
        year |
       2008  |          0  (base)
       2009  |  -.0693145   .2984638    -0.23   0.816    -.6542928    .5156638
       2010  |   1.508307   .2867009     5.26   0.000     .9463836    2.070231
       2011  |    1.21753   .2830879     4.30   0.000     .6626883    1.772373
       2012  |   .3879203   .2815459     1.38   0.168    -.1638995      .93974
       2013  |    .153556   .2760748     0.56   0.578    -.3875406    .6946526
       2014  |  -.9702355   .2769847    -3.50   0.000    -1.513115   -.4273554
       2015  |  -.3133172    .277566    -1.13   0.259    -.8573365    .2307021
             |
     naics_2 |
         11  |   2.639642   1.267623     2.08   0.037     .1551467    5.124137
         21  |   2.729813   1.334951     2.04   0.041     .1133573    5.346269
         23  |   .4584466   1.980747     0.23   0.817    -3.423745    4.340639
         31  |   .6720845   .2123529     3.16   0.002     .2558804    1.088289
         42  |  -1.105528   .5065848    -2.18   0.029    -2.098416   -.1126395
         44  |  -.7764751   .2849784    -2.72   0.006    -1.335023   -.2179276
         51  |          0  (base)
         52  |  -.3457072   .7106821    -0.49   0.627    -1.738619    1.047204
         53  |   .2047507   .4744367     0.43   0.666    -.7251282     1.13463
         54  |  -.6402234   .4079535    -1.57   0.117    -1.439798    .1593508
         56  |  -2.104921    1.36314    -1.54   0.123    -4.776627     .566784
         61  |  -1.053555   2.287555    -0.46   0.645    -5.537081     3.42997
         62  |  -1.427846   1.112626    -1.28   0.199    -3.608553    .7528608
         71  |  -.3059019   1.246559    -0.25   0.806    -2.749113    2.137309
         72  |  -1.088651   .3890739    -2.80   0.005    -1.851221   -.3260797
             |
       _cons |  -10.72686   .9635047   -11.13   0.000     -12.6153   -8.838429
-------------+----------------------------------------------------------------
     sigma_u |  1.5312722
     sigma_e |    1.58387
         rho |  .48312024   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo nis2

. 
. xtreg ni over_rtg_dm net_kld_str_dm over_rtg_m net_kld_str_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year i.naics_2, re base

Random-effects GLS regression                   Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.0458                                         min =          1
     between = 0.3383                                         avg =        3.8
     overall = 0.3043                                         max =          8

                                                Wald chi2(33)     =     429.96
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

--------------------------------------------------------------------------------
            ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
   over_rtg_dm |  -2.046455   8.019117    -0.26   0.799    -17.76364    13.67073
net_kld_str_dm |    72.1583   22.51871     3.20   0.001     28.02244    116.2942
    over_rtg_m |   2.069217   17.07896     0.12   0.904    -31.40493    35.54336
 net_kld_str_m |   536.8873   46.60574    11.52   0.000     445.5417    628.2328
        emp_dm |    14.7393   2.973605     4.96   0.000     8.911143    20.56746
       debt_dm |   -119.217   375.6263    -0.32   0.751     -855.431     616.997
         rd_dm |   .0859239   13.62501     0.01   0.995    -26.61861    26.79046
         ad_dm |  -5.031222   225.0833    -0.02   0.982    -446.1863    436.1239
         emp_m |   4.750099   2.339333     2.03   0.042     .1650899    9.335108
        debt_m |  -291.3758   469.3359    -0.62   0.535    -1211.257    628.5057
          rd_m |  -.6696916   13.56216    -0.05   0.961    -27.25103    25.91164
          ad_m |   15.19087   1021.155     0.01   0.988    -1986.236    2016.618
               |
          year |
         2008  |          0  (base)
         2009  |   920.7093   281.6605     3.27   0.001     368.6648    1472.754
         2010  |   1331.921   273.1086     4.88   0.000     796.6381    1867.204
         2011  |   1477.623   269.2147     5.49   0.000     949.9721    2005.274
         2012  |   1510.624   266.4221     5.67   0.000     988.4467    2032.802
         2013  |   1596.678   261.1165     6.11   0.000     1084.899    2108.457
         2014  |   1653.756   262.0561     6.31   0.000     1140.136    2167.377
         2015  |   1664.549   262.3931     6.34   0.000     1150.268     2178.83
               |
       naics_2 |
           11  |  -210.1523   1170.442    -0.18   0.858    -2504.176    2083.872
           21  |   -272.379   1239.109    -0.22   0.826    -2700.989    2156.231
           23  |   536.5644   1834.346     0.29   0.770    -3058.688    4131.817
           31  |   170.1889    197.026     0.86   0.388     -215.975    556.3527
           42  |   166.3989   469.0812     0.35   0.723    -752.9835    1085.781
           44  |  -401.1741   264.8992    -1.51   0.130    -920.3671    118.0188
           51  |          0  (base)
           52  |  -36.97034   657.2368    -0.06   0.955    -1325.131     1251.19
           53  |   206.4937   438.0107     0.47   0.637    -651.9916    1064.979
           54  |   30.96756   377.1468     0.08   0.935    -708.2265    770.1616
           56  |  -24.42559   1261.302    -0.02   0.985    -2496.532    2447.681
           61  |    265.086    2129.86     0.12   0.901    -3909.364    4439.536
           62  |   176.1922   1028.873     0.17   0.864    -1840.362    2192.746
           71  |   346.0298   1156.694     0.30   0.765    -1921.049    2613.108
           72  |  -244.5569   361.6597    -0.68   0.499    -953.3969    464.2832
               |
         _cons |  -2057.774   943.4455    -2.18   0.029    -3906.894   -208.6551
---------------+----------------------------------------------------------------
       sigma_u |  1415.8918
       sigma_e |  1509.4998
           rho |  .46803428   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. eststo nis3

. 
. *       Net KLD concerns
. xtreg ni over_rtg_dm over_rtg_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year i.naics_2, re base

Random-effects GLS regression                   Number of obs     =      3,180
Group variable: firm_n                          Number of groups  =        733

R-sq:                                           Obs per group:
     within  = 0.0454                                         min =          1
     between = 0.1997                                         avg =        4.3
     overall = 0.1953                                         max =          9

                                                Wald chi2(33)     =     323.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
          ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 over_rtg_dm |   4.841325   6.114211     0.79   0.428    -7.142308    16.82496
  over_rtg_m |   66.50088   13.63787     4.88   0.000     39.77115    93.23062
      emp_dm |   12.74134   1.930921     6.60   0.000     8.956808    16.52588
     debt_dm |   243.4406   252.5221     0.96   0.335    -251.4937    738.3749
       rd_dm |  -.0149768   5.320669    -0.00   0.998     -10.4433    10.41334
       ad_dm |   19.48608   176.7408     0.11   0.912    -326.9195    365.8916
       emp_m |    20.7551   1.911302    10.86   0.000     17.00902    24.50119
      debt_m |   -364.943   384.9014    -0.95   0.343    -1119.336      389.45
        rd_m |  -4.387946   6.494809    -0.68   0.499    -17.11754    8.341647
        ad_m |  -24.90297   187.7544    -0.13   0.894    -392.8949     343.089
             |
        year |
       2008  |          0  (base)
       2009  |   958.6801   242.4509     3.95   0.000     483.4851    1433.875
       2010  |   1471.759   232.5871     6.33   0.000     1015.897    1927.621
       2011  |   1555.345   229.3125     6.78   0.000     1105.901    2004.789
       2012  |   1502.326   227.5967     6.60   0.000     1056.245    1948.407
       2013  |    1555.21   223.9819     6.94   0.000     1116.213    1994.206
       2014  |   1516.505   224.4212     6.76   0.000     1076.648    1956.363
       2015  |   1557.734   224.0724     6.95   0.000      1118.56    1996.908
       2016  |   1546.211   224.2314     6.90   0.000     1106.725    1985.696
       2017  |   1698.128   293.2903     5.79   0.000      1123.29    2272.967
             |
     naics_2 |
         11  |    480.647   1164.609     0.41   0.680    -1801.946     2763.24
         21  |   1136.946   1236.847     0.92   0.358     -1287.23    3561.121
         23  |    362.188   1818.129     0.20   0.842    -3201.279    3925.655
         31  |   273.3832    172.678     1.58   0.113    -65.05951     611.826
         42  |  -356.0502   431.5297    -0.83   0.409    -1201.833    489.7324
         44  |  -745.7707   238.1848    -3.13   0.002    -1212.604   -278.9371
         51  |          0  (base)
         52  |  -60.04597   608.2476    -0.10   0.921    -1252.189    1132.097
         53  |   38.95825   402.1045     0.10   0.923    -749.1521    827.0686
         54  |  -210.3933   363.0154    -0.58   0.562    -921.8904    501.1038
         56  |  -445.7502   983.1771    -0.45   0.650    -2372.742    1481.242
         61  |  -302.1426   1725.711    -0.18   0.861    -3684.474    3080.189
         62  |  -207.7521   763.9857    -0.27   0.786    -1705.136    1289.632
         71  |  -106.4385   943.2327    -0.11   0.910    -1955.141    1742.264
         72  |  -639.8573   311.5401    -2.05   0.040    -1250.465   -29.24992
             |
       _cons |  -4796.349   785.2619    -6.11   0.000    -6335.434   -3257.264
-------------+----------------------------------------------------------------
     sigma_u |   1496.416
     sigma_e |  1340.7397
         rho |  .55470582   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo nic1

. 
. xtreg net_kld_con over_rtg_dm over_rtg_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year i.naics_2, re base

Random-effects GLS regression                   Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.4253                                         min =          1
     between = 0.5525                                         avg =        3.8
     overall = 0.5169                                         max =          8

                                                Wald chi2(31)     =    2062.99
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
 net_kld_con |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 over_rtg_dm |   .0057813   .0053997     1.07   0.284     -.004802    .0163646
  over_rtg_m |  -.0169473   .0080776    -2.10   0.036    -.0327791   -.0011155
      emp_dm |  -.0069055    .001807    -3.82   0.000    -.0104471   -.0033639
     debt_dm |   .4859656    .237602     2.05   0.041     .0202741     .951657
       rd_dm |  -.0026367   .0076075    -0.35   0.729    -.0175472    .0122737
       ad_dm |  -.0806636   .1517165    -0.53   0.595    -.3780225    .2166952
       emp_m |   .0174752   .0010135    17.24   0.000     .0154888    .0194616
      debt_m |    .677479   .2488786     2.72   0.006      .189686    1.165272
        rd_m |  -.0051266   .0075682    -0.68   0.498    -.0199599    .0097067
        ad_m |   .2811149   .5650668     0.50   0.619    -.8263955    1.388625
             |
        year |
       2008  |          0  (base)
       2009  |  -.5603599   .1944657    -2.88   0.004    -.9415057   -.1792142
       2010  |  -.6849123   .1861994    -3.68   0.000    -1.049857   -.3199681
       2011  |   -1.12751   .1836701    -6.14   0.000    -1.487496   -.7675228
       2012  |  -2.605228   .1824528   -14.28   0.000    -2.962829   -2.247627
       2013  |  -2.525735   .1786041   -14.14   0.000    -2.875792   -2.175677
       2014  |  -3.103587   .1790098   -17.34   0.000     -3.45444   -2.752734
       2015  |  -2.857632    .179148   -15.95   0.000    -3.208755   -2.506508
             |
     naics_2 |
         11  |   4.407296   .5976563     7.37   0.000     3.235911     5.57868
         21  |   3.614971   .6584269     5.49   0.000     2.324478    4.905464
         23  |  -.4779413   1.017381    -0.47   0.639    -2.471972     1.51609
         31  |   .1202137   .1037194     1.16   0.246    -.0830725       .3235
         42  |   .1122325   .2476715     0.45   0.650    -.3731948    .5976598
         44  |  -.4326556    .139076    -3.11   0.002    -.7052395   -.1600717
         51  |          0  (base)
         52  |  -.3717583   .3533819    -1.05   0.293    -1.064374    .3208574
         53  |  -.3040448   .2294694    -1.32   0.185    -.7537966    .1457069
         54  |  -.1629439    .198083    -0.82   0.411    -.5511794    .2252916
         56  |  -.5020162    .683484    -0.73   0.463     -1.84162    .8375878
         61  |   .5349081   1.269522     0.42   0.674    -1.953309    3.023125
         62  |   .5172636   .5433267     0.95   0.341     -.547637    1.582164
         71  |   2.461879   .6531781     3.77   0.000     1.181674    3.742085
         72  |   .1638935   .1890311     0.87   0.386    -.2066007    .5343876
             |
       _cons |    4.13078   .4793377     8.62   0.000     3.191295    5.070265
-------------+----------------------------------------------------------------
     sigma_u |  .63682677
     sigma_e |  1.0460345
         rho |  .27041306   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo nic2

. 
. xtreg ni over_rtg_dm net_kld_con_dm over_rtg_m net_kld_con_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year i.naics_2, re base

Random-effects GLS regression                   Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.0377                                         min =          1
     between = 0.3457                                         avg =        3.8
     overall = 0.3198                                         max =          8

                                                Wald chi2(33)     =     446.65
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

--------------------------------------------------------------------------------
            ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
   over_rtg_dm |   3.877843   7.997472     0.48   0.628    -11.79691     19.5526
net_kld_con_dm |   94.32603   34.38849     2.74   0.006     26.92583    161.7262
    over_rtg_m |   110.4598   15.19217     7.27   0.000     80.68366    140.2359
 net_kld_con_m |   865.1279   69.91447    12.37   0.000     728.0981    1002.158
        emp_dm |   20.75673   3.001345     6.92   0.000     14.87421    26.63926
       debt_dm |  -39.27954   376.3306    -0.10   0.917     -776.874    698.3149
         rd_dm |   3.376976   13.38372     0.25   0.801    -22.85463    29.60858
         ad_dm |   21.14022   227.3092     0.09   0.926    -424.3776    466.6581
         emp_m |   3.606224   2.322502     1.55   0.120    -.9457966    8.158244
        debt_m |  -1146.807   458.9004    -2.50   0.012    -2046.235   -247.3782
          rd_m |  -.4907825   13.32589    -0.04   0.971    -26.60905    25.62749
          ad_m |  -163.2698   1002.215    -0.16   0.871    -2127.575    1801.036
               |
          year |
         2008  |          0  (base)
         2009  |   1014.545   285.8062     3.55   0.000     454.3751    1574.715
         2010  |   1546.379   274.7024     5.63   0.000     1007.972    2084.786
         2011  |   1692.784   272.7245     6.21   0.000     1158.254    2227.315
         2012  |       1777   282.0759     6.30   0.000     1224.141    2329.858
         2013  |   1847.047    276.126     6.69   0.000      1305.85    2388.244
         2014  |   1886.072   283.3054     6.66   0.000     1330.804    2441.341
         2015  |   1926.988   280.7311     6.86   0.000     1376.765    2477.211
               |
       naics_2 |
           11  |  -3097.026   1175.914    -2.63   0.008    -5401.774   -792.2767
           21  |  -2458.898   1239.678    -1.98   0.047    -4888.622   -29.17414
           23  |   869.9896   1799.571     0.48   0.629    -2657.104    4397.084
           31  |      157.5    192.647     0.82   0.414    -220.0811    535.0811
           42  |   -193.387   456.9797    -0.42   0.672    -1089.051    702.2767
           44  |  -557.0455   257.6201    -2.16   0.031    -1061.972   -52.11932
           51  |          0  (base)
           52  |   388.8395   643.8034     0.60   0.546     -872.992    1650.671
           53  |   409.4852   427.4492     0.96   0.338    -428.2998     1247.27
           54  |  -130.5193    367.491    -0.36   0.722    -850.7884    589.7497
           56  |  -70.74471   1233.842    -0.06   0.954     -2489.03    2347.541
           61  |   79.32194   2108.315     0.04   0.970    -4052.899    4211.543
           62  |  -959.5374   1004.588    -0.96   0.339    -2928.494    1009.419
           71  |  -1217.103   1142.636    -1.07   0.287    -3456.628    1022.422
           72  |  -966.3347   351.1661    -2.75   0.006    -1654.608   -278.0617
               |
         _cons |   -8195.04   892.2935    -9.18   0.000    -9943.903   -6446.177
---------------+----------------------------------------------------------------
       sigma_u |   1345.446
       sigma_e |  1512.7477
           rho |  .44166581   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. eststo nic3

. 
. 
. *       Regression of net income on CSRHub rating
. estout nis1 nic1, cells(b(star fmt(%9.3f)) z(par))                ///
>         stats(N  N_g r2_a, fmt(%9.0g %9.0g %9.0g %9.4g) ///
>         labels("N" "Firms" "Adj. R^2"))      ///
>         legend collabels(none) ///
>         order(over* net*)

--------------------------------------------
                     nis1            nic1   
--------------------------------------------
over_rtg_dm         4.841           4.841   
                  (0.792)         (0.792)   
over_rtg_m         66.501***       66.501***
                  (4.876)         (4.876)   
net*                                        
                                            
emp_dm             12.741***       12.741***
                  (6.599)         (6.599)   
debt_dm           243.441         243.441   
                  (0.964)         (0.964)   
rd_dm              -0.015          -0.015   
                 (-0.003)        (-0.003)   
ad_dm              19.486          19.486   
                  (0.110)         (0.110)   
emp_m              20.755***       20.755***
                 (10.859)        (10.859)   
debt_m           -364.943        -364.943   
                 (-0.948)        (-0.948)   
rd_m               -4.388          -4.388   
                 (-0.676)        (-0.676)   
ad_m              -24.903         -24.903   
                 (-0.133)        (-0.133)   
2008.year           0.000           0.000   
                      (.)             (.)   
2009.year         958.680***      958.680***
                  (3.954)         (3.954)   
2010.year        1471.759***     1471.759***
                  (6.328)         (6.328)   
2011.year        1555.345***     1555.345***
                  (6.783)         (6.783)   
2012.year        1502.326***     1502.326***
                  (6.601)         (6.601)   
2013.year        1555.210***     1555.210***
                  (6.943)         (6.943)   
2014.year        1516.505***     1516.505***
                  (6.757)         (6.757)   
2015.year        1557.734***     1557.734***
                  (6.952)         (6.952)   
2016.year        1546.211***     1546.211***
                  (6.896)         (6.896)   
2017.year        1698.128***     1698.128***
                  (5.790)         (5.790)   
11.naics_2        480.647         480.647   
                  (0.413)         (0.413)   
21.naics_2       1136.946        1136.946   
                  (0.919)         (0.919)   
23.naics_2        362.188         362.188   
                  (0.199)         (0.199)   
31.naics_2        273.383         273.383   
                  (1.583)         (1.583)   
42.naics_2       -356.050        -356.050   
                 (-0.825)        (-0.825)   
44.naics_2       -745.771**      -745.771** 
                 (-3.131)        (-3.131)   
51.naics_2          0.000           0.000   
                      (.)             (.)   
52.naics_2        -60.046         -60.046   
                 (-0.099)        (-0.099)   
53.naics_2         38.958          38.958   
                  (0.097)         (0.097)   
54.naics_2       -210.393        -210.393   
                 (-0.580)        (-0.580)   
56.naics_2       -445.750        -445.750   
                 (-0.453)        (-0.453)   
61.naics_2       -302.143        -302.143   
                 (-0.175)        (-0.175)   
62.naics_2       -207.752        -207.752   
                 (-0.272)        (-0.272)   
71.naics_2       -106.439        -106.439   
                 (-0.113)        (-0.113)   
72.naics_2       -639.857*       -639.857*  
                 (-2.054)        (-2.054)   
_cons           -4796.349***    -4796.349***
                 (-6.108)        (-6.108)   
--------------------------------------------
N                    3180            3180   
Firms                 733             733   
Adj. R^2                                    
--------------------------------------------
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Regression of CSRHub rating on KLD strengths or concerns
. estout nis2 nic2, cells(b(star fmt(%9.3f)) z(par))                ///
>         stats(N  N_g r2_a, fmt(%9.0g %9.0g %9.0g %9.4g) ///
>         labels("N" "Firms" "Adj. R^2"))      ///
>         legend collabels(none) ///
>         order(over* net*)

--------------------------------------------
                     nis2            nic2   
--------------------------------------------
over_rtg_dm         0.062***        0.006   
                  (7.349)         (1.071)   
over_rtg_m          0.228***       -0.017*  
                 (13.600)        (-2.098)   
net*                                        
                                            
emp_dm              0.005          -0.007***
                  (1.602)        (-3.822)   
debt_dm             0.993*          0.486*  
                  (2.491)         (2.045)   
rd_dm               0.007          -0.003   
                  (0.489)        (-0.347)   
ad_dm              -0.015          -0.081   
                 (-0.061)        (-0.532)   
emp_m               0.035***        0.017***
                 (16.361)        (17.243)   
debt_m             -0.974           0.677** 
                 (-1.922)         (2.722)   
rd_m               -0.006          -0.005   
                 (-0.416)        (-0.677)   
ad_m               -0.371           0.281   
                 (-0.337)         (0.497)   
2008.year           0.000           0.000   
                      (.)             (.)   
2009.year          -0.069          -0.560** 
                 (-0.232)        (-2.882)   
2010.year           1.508***       -0.685***
                  (5.261)        (-3.678)   
2011.year           1.218***       -1.128***
                  (4.301)        (-6.139)   
2012.year           0.388          -2.605***
                  (1.378)       (-14.279)   
2013.year           0.154          -2.526***
                  (0.556)       (-14.142)   
2014.year          -0.970***       -3.104***
                 (-3.503)       (-17.338)   
2015.year          -0.313          -2.858***
                 (-1.129)       (-15.951)   
11.naics_2          2.640*          4.407***
                  (2.082)         (7.374)   
21.naics_2          2.730*          3.615***
                  (2.045)         (5.490)   
23.naics_2          0.458          -0.478   
                  (0.231)        (-0.470)   
31.naics_2          0.672**         0.120   
                  (3.165)         (1.159)   
42.naics_2         -1.106*          0.112   
                 (-2.182)         (0.453)   
44.naics_2         -0.776**        -0.433** 
                 (-2.725)        (-3.111)   
51.naics_2          0.000           0.000   
                      (.)             (.)   
52.naics_2         -0.346          -0.372   
                 (-0.486)        (-1.052)   
53.naics_2          0.205          -0.304   
                  (0.432)        (-1.325)   
54.naics_2         -0.640          -0.163   
                 (-1.569)        (-0.823)   
56.naics_2         -2.105          -0.502   
                 (-1.544)        (-0.734)   
61.naics_2         -1.054           0.535   
                 (-0.461)         (0.421)   
62.naics_2         -1.428           0.517   
                 (-1.283)         (0.952)   
71.naics_2         -0.306           2.462***
                 (-0.245)         (3.769)   
72.naics_2         -1.089**         0.164   
                 (-2.798)         (0.867)   
_cons             -10.727***        4.131***
                (-11.133)         (8.618)   
--------------------------------------------
N                    2312            2312   
Firms                 601             601   
Adj. R^2                                    
--------------------------------------------
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Regression of net income on CSRHub rating and KLD strengths or concerns
. estout nis1 nic1 nis3 nic3, cells(b(star fmt(%9.3f)) z(par))                ///
>         stats(N  N_g r2_a, fmt(%9.0g %9.0g %9.0g %9.4g) ///
>         labels("N" "Firms" "Adj. R^2"))      ///
>         legend collabels(none) ///
>         order(over* net*)

----------------------------------------------------------------------------
                     nis1            nic1            nis3            nic3   
----------------------------------------------------------------------------
over_rtg_dm         4.841           4.841          -2.046           3.878   
                  (0.792)         (0.792)        (-0.255)         (0.485)   
over_rtg_m         66.501***       66.501***        2.069         110.460***
                  (4.876)         (4.876)         (0.121)         (7.271)   
net_kld_s~dm                                       72.158**                 
                                                  (3.204)                   
net_kld_s~_m                                      536.887***                
                                                 (11.520)                   
net_kld_c~dm                                                       94.326** 
                                                                  (2.743)   
net_kld_c~_m                                                      865.128***
                                                                 (12.374)   
emp_dm             12.741***       12.741***       14.739***       20.757***
                  (6.599)         (6.599)         (4.957)         (6.916)   
debt_dm           243.441         243.441        -119.217         -39.280   
                  (0.964)         (0.964)        (-0.317)        (-0.104)   
rd_dm              -0.015          -0.015           0.086           3.377   
                 (-0.003)        (-0.003)         (0.006)         (0.252)   
ad_dm              19.486          19.486          -5.031          21.140   
                  (0.110)         (0.110)        (-0.022)         (0.093)   
emp_m              20.755***       20.755***        4.750*          3.606   
                 (10.859)        (10.859)         (2.031)         (1.553)   
debt_m           -364.943        -364.943        -291.376       -1146.807*  
                 (-0.948)        (-0.948)        (-0.621)        (-2.499)   
rd_m               -4.388          -4.388          -0.670          -0.491   
                 (-0.676)        (-0.676)        (-0.049)        (-0.037)   
ad_m              -24.903         -24.903          15.191        -163.270   
                 (-0.133)        (-0.133)         (0.015)        (-0.163)   
2008.year           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)   
2009.year         958.680***      958.680***      920.709**      1014.545***
                  (3.954)         (3.954)         (3.269)         (3.550)   
2010.year        1471.759***     1471.759***     1331.921***     1546.379***
                  (6.328)         (6.328)         (4.877)         (5.629)   
2011.year        1555.345***     1555.345***     1477.623***     1692.784***
                  (6.783)         (6.783)         (5.489)         (6.207)   
2012.year        1502.326***     1502.326***     1510.624***     1777.000***
                  (6.601)         (6.601)         (5.670)         (6.300)   
2013.year        1555.210***     1555.210***     1596.678***     1847.047***
                  (6.943)         (6.943)         (6.115)         (6.689)   
2014.year        1516.505***     1516.505***     1653.756***     1886.072***
                  (6.757)         (6.757)         (6.311)         (6.657)   
2015.year        1557.734***     1557.734***     1664.549***     1926.988***
                  (6.952)         (6.952)         (6.344)         (6.864)   
2016.year        1546.211***     1546.211***                                
                  (6.896)         (6.896)                                   
2017.year        1698.128***     1698.128***                                
                  (5.790)         (5.790)                                   
11.naics_2        480.647         480.647        -210.152       -3097.026** 
                  (0.413)         (0.413)        (-0.180)        (-2.634)   
21.naics_2       1136.946        1136.946        -272.379       -2458.898*  
                  (0.919)         (0.919)        (-0.220)        (-1.983)   
23.naics_2        362.188         362.188         536.564         869.990   
                  (0.199)         (0.199)         (0.293)         (0.483)   
31.naics_2        273.383         273.383         170.189         157.500   
                  (1.583)         (1.583)         (0.864)         (0.818)   
42.naics_2       -356.050        -356.050         166.399        -193.387   
                 (-0.825)        (-0.825)         (0.355)        (-0.423)   
44.naics_2       -745.771**      -745.771**      -401.174        -557.045*  
                 (-3.131)        (-3.131)        (-1.514)        (-2.162)   
51.naics_2          0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)   
52.naics_2        -60.046         -60.046         -36.970         388.840   
                 (-0.099)        (-0.099)        (-0.056)         (0.604)   
53.naics_2         38.958          38.958         206.494         409.485   
                  (0.097)         (0.097)         (0.471)         (0.958)   
54.naics_2       -210.393        -210.393          30.968        -130.519   
                 (-0.580)        (-0.580)         (0.082)        (-0.355)   
56.naics_2       -445.750        -445.750         -24.426         -70.745   
                 (-0.453)        (-0.453)        (-0.019)        (-0.057)   
61.naics_2       -302.143        -302.143         265.086          79.322   
                 (-0.175)        (-0.175)         (0.124)         (0.038)   
62.naics_2       -207.752        -207.752         176.192        -959.537   
                 (-0.272)        (-0.272)         (0.171)        (-0.955)   
71.naics_2       -106.439        -106.439         346.030       -1217.103   
                 (-0.113)        (-0.113)         (0.299)        (-1.065)   
72.naics_2       -639.857*       -639.857*       -244.557        -966.335** 
                 (-2.054)        (-2.054)        (-0.676)        (-2.752)   
_cons           -4796.349***    -4796.349***    -2057.774*      -8195.040***
                 (-6.108)        (-6.108)        (-2.181)        (-9.184)   
----------------------------------------------------------------------------
N                    3180            3180            2312            2312   
Firms                 733             733             601             601   
Adj. R^2                                                                    
----------------------------------------------------------------------------
* p<0.05, ** p<0.01, *** p<0.001

. 
. *       Regression of net income on CSRHub rating and KLD strengths and KLD concerns
. xtreg ni over_rtg_dm net_kld_str_dm net_kld_con_dm over_rtg_m net_kld_str_m net_kld_con_m emp_dm debt_dm rd_dm ad_dm emp_m debt_m rd_m ad_m i.year i.naics_2, re base

Random-effects GLS regression                   Number of obs     =      2,312
Group variable: firm_n                          Number of groups  =        601

R-sq:                                           Obs per group:
     within  = 0.0430                                         min =          1
     between = 0.4234                                         avg =        3.8
     overall = 0.3760                                         max =          8

                                                Wald chi2(35)     =     601.42
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

--------------------------------------------------------------------------------
            ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
   over_rtg_dm |  -.6016767   8.086233    -0.07   0.941     -16.4504    15.24705
net_kld_str_dm |   71.85701   22.65779     3.17   0.002     27.44855    116.2655
net_kld_con_dm |   92.17942   34.25033     2.69   0.007        25.05    159.3088
    over_rtg_m |   38.68882   16.21057     2.39   0.017     6.916691    70.46095
 net_kld_str_m |   407.4318   45.08295     9.04   0.000     319.0709    495.7928
 net_kld_con_m |   674.2382   69.49097     9.70   0.000     538.0384     810.438
        emp_dm |   20.34905   2.938617     6.92   0.000     14.58946    26.10863
       debt_dm |  -307.1715   371.0559    -0.83   0.408    -1034.428    420.0847
         rd_dm |    .112356   12.78774     0.01   0.993    -24.95115    25.17586
         ad_dm |   22.41694   225.8628     0.10   0.921    -420.2661       465.1
         emp_m |  -4.372485   2.322872    -1.88   0.060     -8.92523    .1802605
        debt_m |  -758.1811   436.2999    -1.74   0.082    -1613.313      96.951
          rd_m |     .13282    12.7245     0.01   0.992    -24.80675    25.07239
          ad_m |    39.0257   955.9591     0.04   0.967     -1834.62    1912.671
               |
          year |
         2008  |          0  (base)
         2009  |   1029.997   285.2743     3.61   0.000     470.8692    1589.124
         2010  |   1457.974   276.6295     5.27   0.000     915.7899    2000.158
         2011  |   1646.242    274.167     6.00   0.000     1108.885      2183.6
         2012  |   1814.403   282.0506     6.43   0.000     1261.594    2367.212
         2013  |   1907.542   275.7943     6.92   0.000     1366.995    2448.089
         2014  |   2025.961   282.4671     7.17   0.000     1472.335    2579.586
         2015  |   2031.571   279.9198     7.26   0.000     1482.938    2580.203
               |
       naics_2 |
           11  |  -2962.797   1106.268    -2.68   0.007    -5131.042   -794.5526
           21  |  -2731.245   1173.861    -2.33   0.020     -5031.97   -430.5197
           23  |   799.4959   1714.795     0.47   0.641    -2561.441    4160.433
           31  |    38.5714   182.5076     0.21   0.833     -319.137    396.2798
           42  |   93.10334   433.1109     0.21   0.830    -755.7785    941.9851
           44  |  -344.5173   244.6774    -1.41   0.159    -824.0762    135.0416
           51  |          0  (base)
           52  |   310.2102   610.6293     0.51   0.611    -886.6012    1507.022
           53  |   377.8704   403.4236     0.94   0.349    -412.8253    1168.566
           54  |   39.87354   347.4173     0.11   0.909    -641.0518    720.7989
           56  |   184.1278   1171.485     0.16   0.875     -2111.94    2480.196
           61  |   405.7838   2037.614     0.20   0.842    -3587.867    4399.434
           62  |  -398.8132   951.6622    -0.42   0.675    -2264.037     1466.41
           71  |  -735.7334   1094.736    -0.67   0.502    -2881.377    1409.911
           72  |  -550.9241   334.8603    -1.65   0.100    -1207.238      105.39
               |
         _cons |  -4792.022   919.3065    -5.21   0.000     -6593.83   -2990.214
---------------+----------------------------------------------------------------
       sigma_u |  1237.1569
       sigma_e |  1509.6563
           rho |  .40176118   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. eststo nistrcon

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. capt log close
