----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Dropbox\papers\active\dissertation-csrhub\project\logs\mediation-analysis.txt
  log type:  text
 opened on:  31 Oct 2018, 13:52:37

. 
. ***     Load subset of stnd_firm matched across all three of KLD, CSTAT, and CSRHUB
. use data\subset-stnd_firm-in-all-three-datasets.dta, clear
(unique stnd_firm that match across kld, cstat, and csrhub data)

. 
. replace ym=ym(year(datadate),month(datadate)) if ym==.
(14,010 real changes made)

. 
. ***     generate random effects within between variables
. foreach variable in net_kld over_rtg {
  2.         bysort firm_n: egen `variable'_m=mean(`variable')
  3.         bysort firm_n: gen `variable'_dm=`variable'-`variable'_m
  4. }
(523 missing values generated)
(214,657 missing values generated)
(14744 missing values generated)
(71,018 missing values generated)

. 
. ///     ALL INDUSTRIES
> ***     Baron and Kinny method
. *Main relationship
. xtreg ni net_kld i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =     25,645
Group variable: firm_n                          Number of groups  =      2,860

R-sq:                                           Obs per group:
     within  = 0.0418                                         min =          1
     between = 0.0000                                         avg =        9.0
     overall = 0.0045                                         max =         25

                                                F(25,2859)        =       7.19
corr(u_i, Xb)  = -0.1195                        Prob > F          =     0.0000

                             (Std. Err. adjusted for 2,860 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     net_kld |   53.23686   13.53336     3.93   0.000     26.70073      79.773
             |
        year |
       1992  |  -51.56458   44.64397    -1.16   0.248    -139.1022    35.97304
       1993  |   122.4098   71.89759     1.70   0.089    -18.56654    263.3862
       1994  |   243.6696   77.53365     3.14   0.002      91.6421    395.6972
       1995  |   197.1658   74.80544     2.64   0.008     50.48775    343.8439
       1996  |   303.6585   74.63159     4.07   0.000     157.3214    449.9957
       1997  |   403.1213   93.86864     4.29   0.000     219.0643    587.1784
       1998  |   522.2437   133.6892     3.91   0.000     260.1066    784.3808
       1999  |   622.0107   111.5255     5.58   0.000     403.3321    840.6893
       2000  |    694.878   132.8892     5.23   0.000     434.3097    955.4464
       2001  |   549.1861   148.4443     3.70   0.000     258.1174    840.2548
       2002  |   578.7311   153.0122     3.78   0.000     278.7056    878.7566
       2003  |   967.6373   157.6882     6.14   0.000     658.4431    1276.832
       2004  |   1074.499   162.0858     6.63   0.000     756.6818    1392.316
       2005  |   1139.206   165.3889     6.89   0.000     814.9126      1463.5
       2006  |   1203.312   170.4631     7.06   0.000     869.0692    1537.555
       2007  |   1167.365   171.5377     6.81   0.000     831.0144    1503.715
       2008  |    947.796   189.9997     4.99   0.000     575.2458    1320.346
       2009  |   1023.105   170.8259     5.99   0.000     688.1502    1358.059
       2010  |   1178.614   173.8548     6.78   0.000     837.7202    1519.507
       2011  |    1265.45   180.9374     6.99   0.000     910.6686     1620.23
       2012  |   1152.163   169.1792     6.81   0.000     820.4375    1483.889
       2013  |   1237.834   172.6819     7.17   0.000     899.2401    1576.427
       2014  |   1249.362   172.2699     7.25   0.000     911.5762    1587.148
       2015  |   1124.258   165.1782     6.81   0.000      800.378    1448.139
             |
       _cons |  -668.2221   156.6319    -4.27   0.000     -975.345   -361.0993
-------------+----------------------------------------------------------------
     sigma_u |  1222.4877
     sigma_e |  1270.9361
         rho |  .48057688   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. *Mediator predicting independent variable
. xtreg net_kld over_rtg i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =      9,220
Group variable: firm_n                          Number of groups  =      2,228

R-sq:                                           Obs per group:
     within  = 0.2169                                         min =          1
     between = 0.0057                                         avg =        4.1
     overall = 0.0641                                         max =          8

                                                F(8,2227)         =      94.14
corr(u_i, Xb)  = -0.1106                        Prob > F          =     0.0000

                             (Std. Err. adjusted for 2,228 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
     net_kld |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   .0409849   .0055269     7.42   0.000     .0301466    .0518233
             |
        year |
       2009  |   .5106364   .1287981     3.96   0.000     .2580596    .7632133
       2010  |   2.124312   .1839608    11.55   0.000     1.763559    2.485065
       2011  |   2.202966    .193586    11.38   0.000     1.823338    2.582594
       2012  |   3.734855   .2023606    18.46   0.000      3.33802     4.13169
       2013  |   3.305928   .1974976    16.74   0.000      2.91863    3.693227
       2014  |   3.027115   .1922167    15.75   0.000     2.650172    3.404057
       2015  |   3.435457   .1922895    17.87   0.000     3.058371    3.812542
             |
       _cons |   -4.55992   .3511904   -12.98   0.000    -5.248615   -3.871225
-------------+----------------------------------------------------------------
     sigma_u |  1.9643317
     sigma_e |  1.7603007
         rho |  .55461494   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. *Mediation analysis
. xtreg ni net_kld over_rtg i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =      9,200
Group variable: firm_n                          Number of groups  =      2,228

R-sq:                                           Obs per group:
     within  = 0.0228                                         min =          1
     between = 0.0388                                         avg =        4.1
     overall = 0.0025                                         max =          8

                                                F(9,2227)         =       9.50
corr(u_i, Xb)  = -0.1502                        Prob > F          =     0.0000

                             (Std. Err. adjusted for 2,228 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     net_kld |  -8.149646   14.72818    -0.55   0.580    -37.03204    20.73275
    over_rtg |   .7698409   3.241087     0.24   0.812    -5.586027    7.125709
             |
        year |
       2009  |   184.5244    265.648     0.69   0.487    -336.4192    705.4681
       2010  |    684.564   277.6784     2.47   0.014     140.0284      1229.1
       2011  |   823.5334    282.235     2.92   0.004     270.0622    1377.005
       2012  |   810.8328   282.4472     2.87   0.004     256.9455     1364.72
       2013  |   877.8971   285.1242     3.08   0.002       318.76    1437.034
       2014  |   874.0372   280.0743     3.12   0.002     324.8032    1423.271
       2015  |    763.884   298.6509     2.56   0.011     178.2206    1349.547
             |
       _cons |  -228.9233   364.0665    -0.63   0.530    -942.8685    485.0218
-------------+----------------------------------------------------------------
     sigma_u |  1687.9104
     sigma_e |  1272.9002
         rho |  .63746697   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. 
. ***      Within between random effects
. xtreg ni net_kld_dm net_kld_m i.year, re cluster(firm_n)

Random-effects GLS regression                   Number of obs     =     25,645
Group variable: firm_n                          Number of groups  =      2,860

R-sq:                                           Obs per group:
     within  = 0.0416                                         min =          1
     between = 0.0132                                         avg =        9.0
     overall = 0.0138                                         max =         25

                                                Wald chi2(26)     =     220.67
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                             (Std. Err. adjusted for 2,860 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  net_kld_dm |   56.02481   13.71197     4.09   0.000     29.14986    82.89977
   net_kld_m |   138.4394   35.39162     3.91   0.000     69.07309    207.8057
             |
        year |
       1992  |  -50.50886   44.08741    -1.15   0.252    -136.9186    35.90087
       1993  |   120.4348   68.91901     1.75   0.081    -14.64395    255.5136
       1994  |   240.2968   74.59693     3.22   0.001     94.08947    386.5041
       1995  |   197.9919   72.33269     2.74   0.006     56.22247    339.7614
       1996  |   300.3095   71.38743     4.21   0.000     160.3927    440.2263
       1997  |   395.7472   90.44965     4.38   0.000     218.4691    573.0252
       1998  |   510.7036   130.7438     3.91   0.000     254.4505    766.9566
       1999  |    611.307   106.9333     5.72   0.000     401.7215    820.8925
       2000  |   688.4207   125.4227     5.49   0.000     442.5967    934.2448
       2001  |   503.7073   137.1023     3.67   0.000     234.9917    772.4229
       2002  |   531.2407    140.847     3.77   0.000     255.1857    807.2957
       2003  |   870.8962   142.3097     6.12   0.000     591.9743    1149.818
       2004  |   974.4234   146.4986     6.65   0.000     687.2915    1261.555
       2005  |   1036.926   149.7682     6.92   0.000     743.3859    1330.467
       2006  |   1098.438   154.5025     7.11   0.000     795.6187    1401.257
       2007  |   1062.365   154.9407     6.86   0.000     758.6865    1366.043
       2008  |   841.7342    173.971     4.84   0.000     500.7574    1182.711
       2009  |   914.8197   154.2069     5.93   0.000     612.5797     1217.06
       2010  |   1067.056   157.0119     6.80   0.000     759.3186    1374.794
       2011  |   1154.542   164.1732     7.03   0.000     832.7687    1476.316
       2012  |   1027.758   151.2526     6.79   0.000     731.3082    1324.208
       2013  |   1131.696   154.3028     7.33   0.000      829.268    1434.124
       2014  |   1134.633   153.1844     7.41   0.000     834.3968    1434.869
       2015  |   981.2227   146.6865     6.69   0.000     693.7224    1268.723
             |
       _cons |  -687.0718   134.6863    -5.10   0.000    -951.0521   -423.0915
-------------+----------------------------------------------------------------
     sigma_u |  991.06998
     sigma_e |  1270.9361
         rho |  .37814065   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg net_kld over_rtg_dm over_rtg_m i.year, re cluster(firm_n)

Random-effects GLS regression                   Number of obs     =      9,220
Group variable: firm_n                          Number of groups  =      2,228

R-sq:                                           Obs per group:
     within  = 0.2163                                         min =          1
     between = 0.1118                                         avg =        4.1
     overall = 0.1622                                         max =          8

                                                Wald chi2(9)      =     993.30
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                             (Std. Err. adjusted for 2,228 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
     net_kld |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 over_rtg_dm |   .0344534   .0053486     6.44   0.000     .0239703    .0449365
  over_rtg_m |   .1898533   .0138484    13.71   0.000     .1627109    .2169957
             |
        year |
       2009  |   .3652059   .1302024     2.80   0.005     .1100139    .6203978
       2010  |   1.778377   .1837358     9.68   0.000     1.418261    2.138492
       2011  |   1.758807    .193269     9.10   0.000     1.380007    2.137608
       2012  |   3.184132   .2012761    15.82   0.000     2.789638    3.578626
       2013  |   2.763937   .1971527    14.02   0.000     2.377525    3.150349
       2014  |   2.511502   .1915627    13.11   0.000     2.136046    2.886958
       2015  |   2.835929   .1917871    14.79   0.000     2.460033    3.211824
             |
       _cons |  -12.07189   .7162789   -16.85   0.000    -13.47577   -10.66801
-------------+----------------------------------------------------------------
     sigma_u |   1.336705
     sigma_e |  1.7603007
         rho |  .36573587   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg ni net_kld_dm over_rtg_dm net_kld_m over_rtg_m i.year, re cluster(firm_n)

Random-effects GLS regression                   Number of obs     =      9,200
Group variable: firm_n                          Number of groups  =      2,228

R-sq:                                           Obs per group:
     within  = 0.0191                                         min =          1
     between = 0.0376                                         avg =        4.1
     overall = 0.0363                                         max =          8

                                                Wald chi2(11)     =      95.89
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                             (Std. Err. adjusted for 2,228 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  net_kld_dm |   27.87978   14.76834     1.89   0.059    -1.065637     56.8252
 over_rtg_dm |  -2.575916   3.092762    -0.83   0.405    -8.637617    3.485786
   net_kld_m |   136.9634   54.40686     2.52   0.012     30.32796    243.5989
  over_rtg_m |   45.48208   12.14543     3.74   0.000     21.67747     69.2867
             |
        year |
       2009  |   94.15026   261.5754     0.36   0.719    -418.5281    606.8286
       2010  |   476.3531   271.7674     1.75   0.080    -56.30118    1009.007
       2011  |   583.9116   274.3591     2.13   0.033     46.17752    1121.646
       2012  |   479.6102   274.0141     1.75   0.080    -57.44753    1016.668
       2013  |    566.351   277.5287     2.04   0.041     22.40475    1110.297
       2014  |   565.8944   272.5341     2.08   0.038     31.73746    1100.051
       2015  |   411.3439   290.7191     1.41   0.157     -158.455    981.1428
             |
       _cons |  -2436.577   600.5803    -4.06   0.000    -3613.693   -1259.461
-------------+----------------------------------------------------------------
     sigma_u |  1366.2458
     sigma_e |  1272.9002
         rho |  .53532546   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. 
. ///     MANUFACTURING
> preserve

. 
. keep if industry=="Manufacturing"
(232,211 observations deleted)

. 
. ***     Baron and Kinny method
. *Main relationship
. xtreg ni net_kld i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =        448
Group variable: firm_n                          Number of groups  =         83

R-sq:                                           Obs per group:
     within  = 0.0634                                         min =          1
     between = 0.3989                                         avg =        5.4
     overall = 0.2813                                         max =          8

                                                F(8,82)           =       2.59
corr(u_i, Xb)  = 0.4847                         Prob > F          =     0.0142

                                (Std. Err. adjusted for 83 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     net_kld |   40.24569   24.19025     1.66   0.100    -7.876421    88.36779
             |
        year |
       2009  |   90.60821   69.48648     1.30   0.196    -47.62252    228.8389
       2010  |   112.1936    64.0338     1.75   0.083    -15.19003    239.5772
       2011  |   142.0897   62.97285     2.26   0.027     16.81666    267.3628
       2012  |   59.08978   73.78895     0.80   0.426    -87.69996    205.8795
       2013  |   110.7521   69.72563     1.59   0.116    -27.95438    249.4586
       2014  |   122.1435   74.07658     1.65   0.103    -25.21843    269.5054
       2015  |   23.56248   131.1717     0.18   0.858    -237.3798    284.5047
             |
       _cons |   280.1776   57.29678     4.89   0.000      166.196    394.1591
-------------+----------------------------------------------------------------
     sigma_u |  1271.3804
     sigma_e |  311.84711
         rho |  .94325081   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. *Mediator predicting independent variable
. xtreg net_kld over_rtg i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =        323
Group variable: firm_n                          Number of groups  =         68

R-sq:                                           Obs per group:
     within  = 0.2737                                         min =          1
     between = 0.1214                                         avg =        4.8
     overall = 0.1251                                         max =          8

                                                F(8,67)           =       6.94
corr(u_i, Xb)  = -0.0137                        Prob > F          =     0.0000

                                (Std. Err. adjusted for 68 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
     net_kld |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    over_rtg |   .0567641   .0368566     1.54   0.128     -.016802    .1303301
             |
        year |
       2009  |   1.479983   .5294369     2.80   0.007     .4232225    2.536743
       2010  |   2.283187   .7302287     3.13   0.003     .8256444     3.74073
       2011  |   1.974153   .7728865     2.55   0.013     .4314656    3.516841
       2012  |   3.785841   .7682906     4.93   0.000     2.252327    5.319356
       2013  |   3.304386    .704674     4.69   0.000     1.897851    4.710921
       2014  |   3.354137   .7094239     4.73   0.000     1.938121    4.770153
       2015  |   3.330393   .7160489     4.65   0.000     1.901153    4.759632
             |
       _cons |  -5.496261    2.14274    -2.57   0.013    -9.773187   -1.219335
-------------+----------------------------------------------------------------
     sigma_u |  1.7961807
     sigma_e |  1.5927565
         rho |  .55981047   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. *Mediation analysis
. xtreg ni net_kld over_rtg i.year, fe cluster(firm_n)

Fixed-effects (within) regression               Number of obs     =        323
Group variable: firm_n                          Number of groups  =         68

R-sq:                                           Obs per group:
     within  = 0.0949                                         min =          1
     between = 0.3756                                         avg =        4.8
     overall = 0.3345                                         max =          8

                                                F(9,67)           =       2.22
corr(u_i, Xb)  = 0.5243                         Prob > F          =     0.0311

                                (Std. Err. adjusted for 68 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     net_kld |   52.49095   35.44599     1.48   0.143    -18.25954    123.2414
    over_rtg |   1.944091   4.161039     0.47   0.642    -6.361377    10.24956
             |
        year |
       2009  |   417.4346   233.0878     1.79   0.078    -47.81058    882.6798
       2010  |   325.7055   228.4004     1.43   0.159    -130.1836    781.5947
       2011  |   346.3146   240.1594     1.44   0.154    -133.0456    825.6747
       2012  |   248.0569   271.6878     0.91   0.365    -294.2343    790.3481
       2013  |   295.2943   267.5096     1.10   0.274    -238.6571    829.2456
       2014  |   295.3868   274.8951     1.07   0.286    -253.3061    844.0798
       2015  |   200.2199   325.2082     0.62   0.540    -448.8984    849.3381
             |
       _cons |   91.63906   298.8708     0.31   0.760    -504.9096    688.1877
-------------+----------------------------------------------------------------
     sigma_u |  1382.0702
     sigma_e |  366.38116
         rho |  .93433857   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. 
. ***      Within between random effects
. xtreg ni net_kld_dm net_kld_m i.year, re cluster(firm_n)

Random-effects GLS regression                   Number of obs     =        448
Group variable: firm_n                          Number of groups  =         83

R-sq:                                           Obs per group:
     within  = 0.0632                                         min =          1
     between = 0.3807                                         avg =        5.4
     overall = 0.4400                                         max =          8

                                                Wald chi2(9)      =      23.06
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0061

                                (Std. Err. adjusted for 83 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  net_kld_dm |   43.01444   24.96126     1.72   0.085     -5.90873    91.93761
   net_kld_m |   509.9531    273.607     1.86   0.062    -26.30676    1046.213
             |
        year |
       2009  |   89.11729    70.0729     1.27   0.203    -48.22306    226.4576
       2010  |   113.4091    64.8008     1.75   0.080    -13.59816    240.4163
       2011  |   141.3366   62.76177     2.25   0.024     18.32577    264.3474
       2012  |   51.77922   73.95578     0.70   0.484    -93.17145    196.7299
       2013  |   102.7417    70.0753     1.47   0.143    -34.60339    240.0867
       2014  |   112.6909   74.32996     1.52   0.129    -32.99317    258.3749
       2015  |   13.02589   132.6273     0.10   0.922    -246.9188    272.9706
             |
       _cons |   346.9308   211.9695     1.64   0.102    -68.52176    762.3834
-------------+----------------------------------------------------------------
     sigma_u |  990.25201
     sigma_e |  311.84711
         rho |  .90977517   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg net_kld over_rtg_dm over_rtg_m i.year, re cluster(firm_n)

Random-effects GLS regression                   Number of obs     =        323
Group variable: firm_n                          Number of groups  =         68

R-sq:                                           Obs per group:
     within  = 0.2682                                         min =          1
     between = 0.3483                                         avg =        4.8
     overall = 0.3031                                         max =          8

                                                Wald chi2(9)      =     138.95
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                                (Std. Err. adjusted for 68 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
     net_kld |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 over_rtg_dm |    .053433    .034937     1.53   0.126    -.0150422    .1219082
  over_rtg_m |   .2799056   .0849128     3.30   0.001     .1134796    .4463316
             |
        year |
       2009  |   1.136905   .5510607     2.06   0.039     .0568461    2.216964
       2010  |    1.58968   .7449001     2.13   0.033      .129703    3.049658
       2011  |   1.152835   .7714964     1.49   0.135    -.3592703     2.66494
       2012  |   3.009959    .774636     3.89   0.000       1.4917    4.528218
       2013  |   2.432691   .7311654     3.33   0.001     .9996335    3.865749
       2014  |   2.490019    .729568     3.41   0.001     1.060092    3.919946
       2015  |   2.466071   .7315935     3.37   0.001     1.032174    3.899968
             |
       _cons |  -16.61784   4.253733    -3.91   0.000    -24.95501   -8.280681
-------------+----------------------------------------------------------------
     sigma_u |  1.0246476
     sigma_e |  1.5927565
         rho |   .2927149   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg ni net_kld_dm over_rtg_dm net_kld_m over_rtg_m i.year, re cluster(firm_n)

Random-effects GLS regression                   Number of obs     =        323
Group variable: firm_n                          Number of groups  =         68

R-sq:                                           Obs per group:
     within  = 0.0944                                         min =          1
     between = 0.4445                                         avg =        4.8
     overall = 0.5113                                         max =          8

                                                Wald chi2(11)     =      29.92
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0016

                                (Std. Err. adjusted for 68 clusters in firm_n)
------------------------------------------------------------------------------
             |               Robust
          ni |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  net_kld_dm |   58.21406    36.3349     1.60   0.109    -13.00103    129.4291
 over_rtg_dm |   1.683424   4.223562     0.40   0.690    -6.594605    9.961453
   net_kld_m |   610.5446   314.2154     1.94   0.052    -5.306287    1226.396
  over_rtg_m |  -2.036552   32.32516    -0.06   0.950    -65.39271    61.31961
             |
        year |
       2009  |   398.9452   234.2486     1.70   0.089    -60.17372    858.0641
       2010  |   301.0024   224.6811     1.34   0.180    -139.3644    741.3693
       2011  |   323.3625   234.5977     1.38   0.168    -136.4406    783.1655
       2012  |   210.3173   266.2243     0.79   0.430    -311.4727    732.1073
       2013  |    258.349   262.2523     0.99   0.325    -255.6561    772.3541
       2014  |   256.0502   268.7266     0.95   0.341    -270.6443    782.7447
       2015  |   159.5833   319.5316     0.50   0.617    -466.6872    785.8537
             |
       _cons |   241.3415   1836.058     0.13   0.895    -3357.265    3839.948
-------------+----------------------------------------------------------------
     sigma_u |  1058.5714
     sigma_e |  366.38116
         rho |   .8930234   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. restore

. 
. 
. capt n log close
      name:  <unnamed>
       log:  D:\Dropbox\papers\active\dissertation-csrhub\project\logs\mediation-analysis.txt
  log type:  text
 closed on:  31 Oct 2018, 13:52:52
----------------------------------------------------------------------------------------------------------------------------------------------------------------
